hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// CR Configuration

#define	GFXMMU_CR_B3PM				(0x1u<<31)
#define	GFXMMU_CR_B3PE				(0x1u<<30)
#define	GFXMMU_CR_B2PM				(0x1u<<29)
#define	GFXMMU_CR_B2PE				(0x1u<<28)
#define	GFXMMU_CR_B1PM				(0x1u<<27)
#define	GFXMMU_CR_B1PE				(0x1u<<26)
#define	GFXMMU_CR_B0PM				(0x1u<<25)
#define	GFXMMU_CR_B0PE				(0x1u<<24)
#define	GFXMMU_CR_ATE				(0x1u<<15)
#define	GFXMMU_CR_BS				(0x1u<<6)
#define	GFXMMU_CR_AMEIE				(0x1u<<4)
#define	GFXMMU_CR_B3OIE				(0x1u<<3)
#define	GFXMMU_CR_B2OIE				(0x1u<<2)
#define	GFXMMU_CR_B1OIE				(0x1u<<1)
#define	GFXMMU_CR_B0OIE				(0x1u<<0)

#define	GFXMMU_CR_B3PM_B_0X0		(0x0u<<31)
#define	GFXMMU_CR_B3PM_B_0X1		(0x1u<<31)
#define	GFXMMU_CR_B3PE_B_0X0		(0x0u<<30)
#define	GFXMMU_CR_B3PE_B_0X1		(0x1u<<30)
#define	GFXMMU_CR_B2PM_B_0X0		(0x0u<<29)
#define	GFXMMU_CR_B2PM_B_0X1		(0x1u<<29)
#define	GFXMMU_CR_B2PE_B_0X0		(0x0u<<28)
#define	GFXMMU_CR_B2PE_B_0X1		(0x1u<<28)
#define	GFXMMU_CR_B1PM_B_0X0		(0x0u<<27)
#define	GFXMMU_CR_B1PM_B_0X1		(0x1u<<27)
#define	GFXMMU_CR_B1PE_B_0X0		(0x0u<<26)
#define	GFXMMU_CR_B1PE_B_0X1		(0x1u<<26)
#define	GFXMMU_CR_B0PM_B_0X0		(0x0u<<25)
#define	GFXMMU_CR_B0PM_B_0X1		(0x1u<<25)
#define	GFXMMU_CR_B0PE_B_0X0		(0x0u<<24)
#define	GFXMMU_CR_B0PE_B_0X1		(0x1u<<24)
#define	GFXMMU_CR_ATE_B_0X0			(0x0u<<15)
#define	GFXMMU_CR_ATE_B_0X1			(0x1u<<15)
#define	GFXMMU_CR_BS_B_0X0			(0x0u<<6)
#define	GFXMMU_CR_BS_B_0X1			(0x1u<<6)
#define	GFXMMU_CR_AMEIE_B_0X0		(0x0u<<4)
#define	GFXMMU_CR_AMEIE_B_0X1		(0x1u<<4)
#define	GFXMMU_CR_B3OIE_B_0X0		(0x0u<<3)
#define	GFXMMU_CR_B3OIE_B_0X1		(0x1u<<3)
#define	GFXMMU_CR_B2OIE_B_0X0		(0x0u<<2)
#define	GFXMMU_CR_B2OIE_B_0X1		(0x1u<<2)
#define	GFXMMU_CR_B1OIE_B_0X0		(0x0u<<1)
#define	GFXMMU_CR_B1OIE_B_0X1		(0x1u<<1)
#define	GFXMMU_CR_B0OIE_B_0X0		(0x0u<<0)
#define	GFXMMU_CR_B0OIE_B_0X1		(0x1u<<0)

// SR Configuration

#define	GFXMMU_SR_AMEF				(0x1u<<4)
#define	GFXMMU_SR_B3OF				(0x1u<<3)
#define	GFXMMU_SR_B2OF				(0x1u<<2)
#define	GFXMMU_SR_B1OF				(0x1u<<1)
#define	GFXMMU_SR_B0OF				(0x1u<<0)

// FCR Configuration

#define	GFXMMU_FCR_CAMEF			(0x1u<<4)
#define	GFXMMU_FCR_CB3OF			(0x1u<<3)
#define	GFXMMU_FCR_CB2OF			(0x1u<<2)
#define	GFXMMU_FCR_CB1OF			(0x1u<<1)
#define	GFXMMU_FCR_CB0OF			(0x1u<<0)

// DVR Configuration

#define	GFXMMU_DVR_DV				(0xFFFFFFFFu<<0)
#define	GFXMMU_DVR_DV_0				(0x1u<<0)

// DAR Configuration

#define	GFXMMU_DAR_DA				(0xFFu<<0)
#define	GFXMMU_DAR_DA_0				(0x1u<<0)

// B0CR Configuration

#define	GFXMMU_B0CR_PBBA			(0x1FFu<<23)
#define	GFXMMU_B0CR_PBBA_0			(0x1u<<23)
#define	GFXMMU_B0CR_PBO				(0x7FFFFu<<4)
#define	GFXMMU_B0CR_PBO_0			(0x1u<<4)

// B1CR Configuration

#define	GFXMMU_B1CR_PBBA			(0x1FFu<<23)
#define	GFXMMU_B1CR_PBBA_0			(0x1u<<23)
#define	GFXMMU_B1CR_PBO				(0x7FFFFu<<4)
#define	GFXMMU_B1CR_PBO_0			(0x1u<<4)

// B2CR Configuration

#define	GFXMMU_B2CR_PBBA			(0x1FFu<<23)
#define	GFXMMU_B2CR_PBBA_0			(0x1u<<23)
#define	GFXMMU_B2CR_PBO				(0x7FFFFu<<4)
#define	GFXMMU_B2CR_PBO_0			(0x1u<<4)

// B3CR Configuration

#define	GFXMMU_B3CR_PBBA			(0x1FFu<<23)
#define	GFXMMU_B3CR_PBBA_0			(0x1u<<23)
#define	GFXMMU_B3CR_PBO				(0x7FFFFu<<4)
#define	GFXMMU_B3CR_PBO_0			(0x1u<<4)

// LUT0L Configuration

#define	GFXMMU_LUT0L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT0L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT0L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT0L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT0L_EN				(0x1u<<0)

#define	GFXMMU_LUT0L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT0L_EN_B_0X1		(0x1u<<0)

// LUT0H Configuration

#define	GFXMMU_LUT0H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT0H_LO_0			(0x1u<<0)

// LUT1L Configuration

#define	GFXMMU_LUT1L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT1L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT1L_EN				(0x1u<<0)

#define	GFXMMU_LUT1L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT1L_EN_B_0X1		(0x1u<<0)

// LUT1H Configuration

#define	GFXMMU_LUT1H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT1H_LO_0			(0x1u<<0)

// LUT2L Configuration

#define	GFXMMU_LUT2L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT2L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT2L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT2L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT2L_EN				(0x1u<<0)

#define	GFXMMU_LUT2L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT2L_EN_B_0X1		(0x1u<<0)

// LUT2H Configuration

#define	GFXMMU_LUT2H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT2H_LO_0			(0x1u<<0)

// LUT3L Configuration

#define	GFXMMU_LUT3L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT3L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT3L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT3L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT3L_EN				(0x1u<<0)

#define	GFXMMU_LUT3L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT3L_EN_B_0X1		(0x1u<<0)

// LUT3H Configuration

#define	GFXMMU_LUT3H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT3H_LO_0			(0x1u<<0)

// LUT4L Configuration

#define	GFXMMU_LUT4L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT4L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT4L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT4L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT4L_EN				(0x1u<<0)

#define	GFXMMU_LUT4L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT4L_EN_B_0X1		(0x1u<<0)

// LUT4H Configuration

#define	GFXMMU_LUT4H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT4H_LO_0			(0x1u<<0)

// LUT5L Configuration

#define	GFXMMU_LUT5L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT5L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT5L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT5L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT5L_EN				(0x1u<<0)

#define	GFXMMU_LUT5L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT5L_EN_B_0X1		(0x1u<<0)

// LUT5H Configuration

#define	GFXMMU_LUT5H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT5H_LO_0			(0x1u<<0)

// LUT6L Configuration

#define	GFXMMU_LUT6L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT6L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT6L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT6L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT6L_EN				(0x1u<<0)

#define	GFXMMU_LUT6L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT6L_EN_B_0X1		(0x1u<<0)

// LUT6H Configuration

#define	GFXMMU_LUT6H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT6H_LO_0			(0x1u<<0)

// LUT7L Configuration

#define	GFXMMU_LUT7L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT7L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT7L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT7L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT7L_EN				(0x1u<<0)

#define	GFXMMU_LUT7L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT7L_EN_B_0X1		(0x1u<<0)

