hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT7H Configuration

#define	GFXMMU_LUT7H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT7H_LO_0			(0x1u<<0)

// LUT8L Configuration

#define	GFXMMU_LUT8L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT8L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT8L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT8L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT8L_EN				(0x1u<<0)

#define	GFXMMU_LUT8L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT8L_EN_B_0X1		(0x1u<<0)

// LUT8H Configuration

#define	GFXMMU_LUT8H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT8H_LO_0			(0x1u<<0)

// LUT9L Configuration

#define	GFXMMU_LUT9L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT9L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT9L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT9L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT9L_EN				(0x1u<<0)

#define	GFXMMU_LUT9L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT9L_EN_B_0X1		(0x1u<<0)

// LUT9H Configuration

#define	GFXMMU_LUT9H_LO				(0x3FFFFu<<0)
#define	GFXMMU_LUT9H_LO_0			(0x1u<<0)

// LUT10L Configuration

#define	GFXMMU_LUT10L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT10L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT10L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT10L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT10L_EN			(0x1u<<0)

#define	GFXMMU_LUT10L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT10L_EN_B_0X1		(0x1u<<0)

// LUT10H Configuration

#define	GFXMMU_LUT10H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT10H_LO_0			(0x1u<<0)

// LUT11L Configuration

#define	GFXMMU_LUT11L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT11L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT11L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT11L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT11L_EN			(0x1u<<0)

#define	GFXMMU_LUT11L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT11L_EN_B_0X1		(0x1u<<0)

// LUT11H Configuration

#define	GFXMMU_LUT11H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT11H_LO_0			(0x1u<<0)

// LUT12L Configuration

#define	GFXMMU_LUT12L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT12L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT12L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT12L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT12L_EN			(0x1u<<0)

#define	GFXMMU_LUT12L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT12L_EN_B_0X1		(0x1u<<0)

// LUT12H Configuration

#define	GFXMMU_LUT12H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT12H_LO_0			(0x1u<<0)

// LUT13L Configuration

#define	GFXMMU_LUT13L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT13L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT13L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT13L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT13L_EN			(0x1u<<0)

#define	GFXMMU_LUT13L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT13L_EN_B_0X1		(0x1u<<0)

// LUT13H Configuration

#define	GFXMMU_LUT13H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT13H_LO_0			(0x1u<<0)

// LUT14L Configuration

#define	GFXMMU_LUT14L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT14L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT14L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT14L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT14L_EN			(0x1u<<0)

#define	GFXMMU_LUT14L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT14L_EN_B_0X1		(0x1u<<0)

// LUT14H Configuration

#define	GFXMMU_LUT14H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT14H_LO_0			(0x1u<<0)

// LUT15L Configuration

#define	GFXMMU_LUT15L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT15L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT15L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT15L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT15L_EN			(0x1u<<0)

#define	GFXMMU_LUT15L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT15L_EN_B_0X1		(0x1u<<0)

// LUT15H Configuration

#define	GFXMMU_LUT15H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT15H_LO_0			(0x1u<<0)

// LUT16L Configuration

#define	GFXMMU_LUT16L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT16L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT16L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT16L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT16L_EN			(0x1u<<0)

#define	GFXMMU_LUT16L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT16L_EN_B_0X1		(0x1u<<0)

// LUT16H Configuration

#define	GFXMMU_LUT16H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT16H_LO_0			(0x1u<<0)

// LUT17L Configuration

#define	GFXMMU_LUT17L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT17L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT17L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT17L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT17L_EN			(0x1u<<0)

#define	GFXMMU_LUT17L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT17L_EN_B_0X1		(0x1u<<0)

// LUT17H Configuration

#define	GFXMMU_LUT17H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT17H_LO_0			(0x1u<<0)

// LUT18L Configuration

#define	GFXMMU_LUT18L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT18L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT18L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT18L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT18L_EN			(0x1u<<0)

#define	GFXMMU_LUT18L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT18L_EN_B_0X1		(0x1u<<0)

// LUT18H Configuration

#define	GFXMMU_LUT18H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT18H_LO_0			(0x1u<<0)

// LUT19L Configuration

#define	GFXMMU_LUT19L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT19L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT19L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT19L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT19L_EN			(0x1u<<0)

#define	GFXMMU_LUT19L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT19L_EN_B_0X1		(0x1u<<0)

// LUT19H Configuration

#define	GFXMMU_LUT19H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT19H_LO_0			(0x1u<<0)

// LUT20L Configuration

#define	GFXMMU_LUT20L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT20L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT20L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT20L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT20L_EN			(0x1u<<0)

#define	GFXMMU_LUT20L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT20L_EN_B_0X1		(0x1u<<0)

// LUT20H Configuration

#define	GFXMMU_LUT20H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT20H_LO_0			(0x1u<<0)

// LUT21L Configuration

#define	GFXMMU_LUT21L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT21L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT21L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT21L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT21L_EN			(0x1u<<0)

#define	GFXMMU_LUT21L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT21L_EN_B_0X1		(0x1u<<0)

// LUT21H Configuration

#define	GFXMMU_LUT21H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT21H_LO_0			(0x1u<<0)

// LUT22L Configuration

#define	GFXMMU_LUT22L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT22L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT22L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT22L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT22L_EN			(0x1u<<0)

#define	GFXMMU_LUT22L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT22L_EN_B_0X1		(0x1u<<0)

// LUT22H Configuration

#define	GFXMMU_LUT22H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT22H_LO_0			(0x1u<<0)

