hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT23L Configuration

#define	GFXMMU_LUT23L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT23L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT23L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT23L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT23L_EN			(0x1u<<0)

#define	GFXMMU_LUT23L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT23L_EN_B_0X1		(0x1u<<0)

// LUT23H Configuration

#define	GFXMMU_LUT23H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT23H_LO_0			(0x1u<<0)

// LUT24L Configuration

#define	GFXMMU_LUT24L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT24L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT24L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT24L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT24L_EN			(0x1u<<0)

#define	GFXMMU_LUT24L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT24L_EN_B_0X1		(0x1u<<0)

// LUT24H Configuration

#define	GFXMMU_LUT24H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT24H_LO_0			(0x1u<<0)

// LUT25L Configuration

#define	GFXMMU_LUT25L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT25L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT25L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT25L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT25L_EN			(0x1u<<0)

#define	GFXMMU_LUT25L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT25L_EN_B_0X1		(0x1u<<0)

// LUT25H Configuration

#define	GFXMMU_LUT25H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT25H_LO_0			(0x1u<<0)

// LUT26L Configuration

#define	GFXMMU_LUT26L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT26L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT26L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT26L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT26L_EN			(0x1u<<0)

#define	GFXMMU_LUT26L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT26L_EN_B_0X1		(0x1u<<0)

// LUT26H Configuration

#define	GFXMMU_LUT26H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT26H_LO_0			(0x1u<<0)

// LUT27L Configuration

#define	GFXMMU_LUT27L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT27L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT27L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT27L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT27L_EN			(0x1u<<0)

#define	GFXMMU_LUT27L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT27L_EN_B_0X1		(0x1u<<0)

// LUT27H Configuration

#define	GFXMMU_LUT27H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT27H_LO_0			(0x1u<<0)

// LUT28L Configuration

#define	GFXMMU_LUT28L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT28L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT28L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT28L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT28L_EN			(0x1u<<0)

#define	GFXMMU_LUT28L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT28L_EN_B_0X1		(0x1u<<0)

// LUT28H Configuration

#define	GFXMMU_LUT28H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT28H_LO_0			(0x1u<<0)

// LUT29L Configuration

#define	GFXMMU_LUT29L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT29L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT29L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT29L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT29L_EN			(0x1u<<0)

#define	GFXMMU_LUT29L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT29L_EN_B_0X1		(0x1u<<0)

// LUT29H Configuration

#define	GFXMMU_LUT29H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT29H_LO_0			(0x1u<<0)

// LUT30L Configuration

#define	GFXMMU_LUT30L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT30L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT30L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT30L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT30L_EN			(0x1u<<0)

#define	GFXMMU_LUT30L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT30L_EN_B_0X1		(0x1u<<0)

// LUT30H Configuration

#define	GFXMMU_LUT30H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT30H_LO_0			(0x1u<<0)

// LUT31L Configuration

#define	GFXMMU_LUT31L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT31L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT31L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT31L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT31L_EN			(0x1u<<0)

#define	GFXMMU_LUT31L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT31L_EN_B_0X1		(0x1u<<0)

// LUT31H Configuration

#define	GFXMMU_LUT31H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT31H_LO_0			(0x1u<<0)

// LUT32L Configuration

#define	GFXMMU_LUT32L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT32L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT32L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT32L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT32L_EN			(0x1u<<0)

#define	GFXMMU_LUT32L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT32L_EN_B_0X1		(0x1u<<0)

// LUT32H Configuration

#define	GFXMMU_LUT32H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT32H_LO_0			(0x1u<<0)

// LUT33L Configuration

#define	GFXMMU_LUT33L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT33L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT33L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT33L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT33L_EN			(0x1u<<0)

#define	GFXMMU_LUT33L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT33L_EN_B_0X1		(0x1u<<0)

// LUT33H Configuration

#define	GFXMMU_LUT33H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT33H_LO_0			(0x1u<<0)

// LUT34L Configuration

#define	GFXMMU_LUT34L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT34L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT34L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT34L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT34L_EN			(0x1u<<0)

#define	GFXMMU_LUT34L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT34L_EN_B_0X1		(0x1u<<0)

// LUT34H Configuration

#define	GFXMMU_LUT34H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT34H_LO_0			(0x1u<<0)

// LUT35L Configuration

#define	GFXMMU_LUT35L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT35L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT35L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT35L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT35L_EN			(0x1u<<0)

#define	GFXMMU_LUT35L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT35L_EN_B_0X1		(0x1u<<0)

// LUT35H Configuration

#define	GFXMMU_LUT35H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT35H_LO_0			(0x1u<<0)

// LUT36L Configuration

#define	GFXMMU_LUT36L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT36L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT36L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT36L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT36L_EN			(0x1u<<0)

#define	GFXMMU_LUT36L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT36L_EN_B_0X1		(0x1u<<0)

// LUT36H Configuration

#define	GFXMMU_LUT36H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT36H_LO_0			(0x1u<<0)

// LUT37L Configuration

#define	GFXMMU_LUT37L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT37L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT37L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT37L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT37L_EN			(0x1u<<0)

#define	GFXMMU_LUT37L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT37L_EN_B_0X1		(0x1u<<0)

// LUT37H Configuration

