hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT53L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT53L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT53L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT53L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT53L_EN			(0x1u<<0)

#define	GFXMMU_LUT53L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT53L_EN_B_0X1		(0x1u<<0)

// LUT53H Configuration

#define	GFXMMU_LUT53H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT53H_LO_0			(0x1u<<0)

// LUT54L Configuration

#define	GFXMMU_LUT54L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT54L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT54L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT54L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT54L_EN			(0x1u<<0)

#define	GFXMMU_LUT54L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT54L_EN_B_0X1		(0x1u<<0)

// LUT54H Configuration

#define	GFXMMU_LUT54H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT54H_LO_0			(0x1u<<0)

// LUT55L Configuration

#define	GFXMMU_LUT55L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT55L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT55L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT55L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT55L_EN			(0x1u<<0)

#define	GFXMMU_LUT55L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT55L_EN_B_0X1		(0x1u<<0)

// LUT55H Configuration

#define	GFXMMU_LUT55H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT55H_LO_0			(0x1u<<0)

// LUT56L Configuration

#define	GFXMMU_LUT56L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT56L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT56L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT56L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT56L_EN			(0x1u<<0)

#define	GFXMMU_LUT56L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT56L_EN_B_0X1		(0x1u<<0)

// LUT56H Configuration

#define	GFXMMU_LUT56H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT56H_LO_0			(0x1u<<0)

// LUT57L Configuration

#define	GFXMMU_LUT57L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT57L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT57L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT57L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT57L_EN			(0x1u<<0)

#define	GFXMMU_LUT57L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT57L_EN_B_0X1		(0x1u<<0)

// LUT57H Configuration

#define	GFXMMU_LUT57H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT57H_LO_0			(0x1u<<0)

// LUT58L Configuration

#define	GFXMMU_LUT58L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT58L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT58L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT58L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT58L_EN			(0x1u<<0)

#define	GFXMMU_LUT58L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT58L_EN_B_0X1		(0x1u<<0)

// LUT58H Configuration

#define	GFXMMU_LUT58H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT58H_LO_0			(0x1u<<0)

// LUT59L Configuration

#define	GFXMMU_LUT59L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT59L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT59L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT59L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT59L_EN			(0x1u<<0)

#define	GFXMMU_LUT59L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT59L_EN_B_0X1		(0x1u<<0)

// LUT59H Configuration

#define	GFXMMU_LUT59H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT59H_LO_0			(0x1u<<0)

// LUT60L Configuration

#define	GFXMMU_LUT60L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT60L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT60L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT60L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT60L_EN			(0x1u<<0)

#define	GFXMMU_LUT60L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT60L_EN_B_0X1		(0x1u<<0)

// LUT60H Configuration

#define	GFXMMU_LUT60H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT60H_LO_0			(0x1u<<0)

// LUT61L Configuration

#define	GFXMMU_LUT61L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT61L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT61L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT61L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT61L_EN			(0x1u<<0)

#define	GFXMMU_LUT61L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT61L_EN_B_0X1		(0x1u<<0)

// LUT61H Configuration

#define	GFXMMU_LUT61H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT61H_LO_0			(0x1u<<0)

// LUT62L Configuration

#define	GFXMMU_LUT62L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT62L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT62L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT62L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT62L_EN			(0x1u<<0)

#define	GFXMMU_LUT62L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT62L_EN_B_0X1		(0x1u<<0)

// LUT62H Configuration

#define	GFXMMU_LUT62H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT62H_LO_0			(0x1u<<0)

// LUT63L Configuration

#define	GFXMMU_LUT63L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT63L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT63L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT63L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT63L_EN			(0x1u<<0)

#define	GFXMMU_LUT63L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT63L_EN_B_0X1		(0x1u<<0)

// LUT63H Configuration

#define	GFXMMU_LUT63H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT63H_LO_0			(0x1u<<0)

// LUT64L Configuration

#define	GFXMMU_LUT64L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT64L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT64L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT64L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT64L_EN			(0x1u<<0)

#define	GFXMMU_LUT64L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT64L_EN_B_0X1		(0x1u<<0)

// LUT64H Configuration

#define	GFXMMU_LUT64H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT64H_LO_0			(0x1u<<0)

// LUT65L Configuration

#define	GFXMMU_LUT65L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT65L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT65L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT65L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT65L_EN			(0x1u<<0)

#define	GFXMMU_LUT65L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT65L_EN_B_0X1		(0x1u<<0)

// LUT65H Configuration

#define	GFXMMU_LUT65H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT65H_LO_0			(0x1u<<0)

// LUT66L Configuration

#define	GFXMMU_LUT66L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT66L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT66L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT66L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT66L_EN			(0x1u<<0)

#define	GFXMMU_LUT66L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT66L_EN_B_0X1		(0x1u<<0)

// LUT66H Configuration

#define	GFXMMU_LUT66H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT66H_LO_0			(0x1u<<0)

// LUT67L Configuration

#define	GFXMMU_LUT67L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT67L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT67L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT67L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT67L_EN			(0x1u<<0)

#define	GFXMMU_LUT67L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT67L_EN_B_0X1		(0x1u<<0)

// LUT67H Configuration

