hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT84L Configuration

#define	GFXMMU_LUT84L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT84L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT84L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT84L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT84L_EN			(0x1u<<0)

#define	GFXMMU_LUT84L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT84L_EN_B_0X1		(0x1u<<0)

// LUT84H Configuration

#define	GFXMMU_LUT84H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT84H_LO_0			(0x1u<<0)

// LUT85L Configuration

#define	GFXMMU_LUT85L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT85L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT85L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT85L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT85L_EN			(0x1u<<0)

#define	GFXMMU_LUT85L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT85L_EN_B_0X1		(0x1u<<0)

// LUT85H Configuration

#define	GFXMMU_LUT85H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT85H_LO_0			(0x1u<<0)

// LUT86L Configuration

#define	GFXMMU_LUT86L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT86L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT86L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT86L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT86L_EN			(0x1u<<0)

#define	GFXMMU_LUT86L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT86L_EN_B_0X1		(0x1u<<0)

// LUT86H Configuration

#define	GFXMMU_LUT86H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT86H_LO_0			(0x1u<<0)

// LUT87L Configuration

#define	GFXMMU_LUT87L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT87L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT87L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT87L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT87L_EN			(0x1u<<0)

#define	GFXMMU_LUT87L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT87L_EN_B_0X1		(0x1u<<0)

// LUT87H Configuration

#define	GFXMMU_LUT87H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT87H_LO_0			(0x1u<<0)

// LUT88L Configuration

#define	GFXMMU_LUT88L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT88L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT88L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT88L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT88L_EN			(0x1u<<0)

#define	GFXMMU_LUT88L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT88L_EN_B_0X1		(0x1u<<0)

// LUT88H Configuration

#define	GFXMMU_LUT88H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT88H_LO_0			(0x1u<<0)

// LUT89L Configuration

#define	GFXMMU_LUT89L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT89L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT89L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT89L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT89L_EN			(0x1u<<0)

#define	GFXMMU_LUT89L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT89L_EN_B_0X1		(0x1u<<0)

// LUT89H Configuration

#define	GFXMMU_LUT89H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT89H_LO_0			(0x1u<<0)

// LUT90L Configuration

#define	GFXMMU_LUT90L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT90L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT90L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT90L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT90L_EN			(0x1u<<0)

#define	GFXMMU_LUT90L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT90L_EN_B_0X1		(0x1u<<0)

// LUT90H Configuration

#define	GFXMMU_LUT90H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT90H_LO_0			(0x1u<<0)

// LUT91L Configuration

#define	GFXMMU_LUT91L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT91L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT91L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT91L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT91L_EN			(0x1u<<0)

#define	GFXMMU_LUT91L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT91L_EN_B_0X1		(0x1u<<0)

// LUT91H Configuration

#define	GFXMMU_LUT91H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT91H_LO_0			(0x1u<<0)

// LUT92L Configuration

#define	GFXMMU_LUT92L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT92L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT92L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT92L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT92L_EN			(0x1u<<0)

#define	GFXMMU_LUT92L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT92L_EN_B_0X1		(0x1u<<0)

// LUT92H Configuration

#define	GFXMMU_LUT92H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT92H_LO_0			(0x1u<<0)

// LUT93L Configuration

#define	GFXMMU_LUT93L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT93L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT93L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT93L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT93L_EN			(0x1u<<0)

#define	GFXMMU_LUT93L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT93L_EN_B_0X1		(0x1u<<0)

// LUT93H Configuration

#define	GFXMMU_LUT93H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT93H_LO_0			(0x1u<<0)

// LUT94L Configuration

#define	GFXMMU_LUT94L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT94L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT94L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT94L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT94L_EN			(0x1u<<0)

#define	GFXMMU_LUT94L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT94L_EN_B_0X1		(0x1u<<0)

// LUT94H Configuration

#define	GFXMMU_LUT94H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT94H_LO_0			(0x1u<<0)

// LUT95L Configuration

#define	GFXMMU_LUT95L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT95L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT95L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT95L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT95L_EN			(0x1u<<0)

#define	GFXMMU_LUT95L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT95L_EN_B_0X1		(0x1u<<0)

// LUT95H Configuration

#define	GFXMMU_LUT95H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT95H_LO_0			(0x1u<<0)

// LUT96L Configuration

#define	GFXMMU_LUT96L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT96L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT96L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT96L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT96L_EN			(0x1u<<0)

#define	GFXMMU_LUT96L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT96L_EN_B_0X1		(0x1u<<0)

// LUT96H Configuration

#define	GFXMMU_LUT96H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT96H_LO_0			(0x1u<<0)

// LUT97L Configuration

#define	GFXMMU_LUT97L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT97L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT97L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT97L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT97L_EN			(0x1u<<0)

#define	GFXMMU_LUT97L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT97L_EN_B_0X1		(0x1u<<0)

// LUT97H Configuration

#define	GFXMMU_LUT97H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT97H_LO_0			(0x1u<<0)

// LUT98L Configuration

#define	GFXMMU_LUT98L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT98L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT98L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT98L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT98L_EN			(0x1u<<0)

#define	GFXMMU_LUT98L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT98L_EN_B_0X1		(0x1u<<0)

