hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT98H Configuration

#define	GFXMMU_LUT98H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT98H_LO_0			(0x1u<<0)

// LUT99L Configuration

#define	GFXMMU_LUT99L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT99L_LVB_0			(0x1u<<16)
#define	GFXMMU_LUT99L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT99L_FVB_0			(0x1u<<8)
#define	GFXMMU_LUT99L_EN			(0x1u<<0)

#define	GFXMMU_LUT99L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT99L_EN_B_0X1		(0x1u<<0)

// LUT99H Configuration

#define	GFXMMU_LUT99H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT99H_LO_0			(0x1u<<0)

// LUT100L Configuration

#define	GFXMMU_LUT100L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT100L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT100L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT100L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT100L_EN			(0x1u<<0)

#define	GFXMMU_LUT100L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT100L_EN_B_0X1		(0x1u<<0)

// LUT100H Configuration

#define	GFXMMU_LUT100H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT100H_LO_0			(0x1u<<0)

// LUT101L Configuration

#define	GFXMMU_LUT101L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT101L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT101L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT101L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT101L_EN			(0x1u<<0)

#define	GFXMMU_LUT101L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT101L_EN_B_0X1		(0x1u<<0)

// LUT101H Configuration

#define	GFXMMU_LUT101H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT101H_LO_0			(0x1u<<0)

// LUT102L Configuration

#define	GFXMMU_LUT102L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT102L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT102L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT102L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT102L_EN			(0x1u<<0)

#define	GFXMMU_LUT102L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT102L_EN_B_0X1		(0x1u<<0)

// LUT102H Configuration

#define	GFXMMU_LUT102H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT102H_LO_0			(0x1u<<0)

// LUT103L Configuration

#define	GFXMMU_LUT103L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT103L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT103L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT103L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT103L_EN			(0x1u<<0)

#define	GFXMMU_LUT103L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT103L_EN_B_0X1		(0x1u<<0)

// LUT103H Configuration

#define	GFXMMU_LUT103H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT103H_LO_0			(0x1u<<0)

// LUT104L Configuration

#define	GFXMMU_LUT104L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT104L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT104L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT104L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT104L_EN			(0x1u<<0)

#define	GFXMMU_LUT104L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT104L_EN_B_0X1		(0x1u<<0)

// LUT104H Configuration

#define	GFXMMU_LUT104H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT104H_LO_0			(0x1u<<0)

// LUT105L Configuration

#define	GFXMMU_LUT105L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT105L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT105L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT105L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT105L_EN			(0x1u<<0)

#define	GFXMMU_LUT105L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT105L_EN_B_0X1		(0x1u<<0)

// LUT105H Configuration

#define	GFXMMU_LUT105H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT105H_LO_0			(0x1u<<0)

// LUT106L Configuration

#define	GFXMMU_LUT106L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT106L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT106L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT106L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT106L_EN			(0x1u<<0)

#define	GFXMMU_LUT106L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT106L_EN_B_0X1		(0x1u<<0)

// LUT106H Configuration

#define	GFXMMU_LUT106H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT106H_LO_0			(0x1u<<0)

// LUT107L Configuration

#define	GFXMMU_LUT107L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT107L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT107L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT107L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT107L_EN			(0x1u<<0)

#define	GFXMMU_LUT107L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT107L_EN_B_0X1		(0x1u<<0)

// LUT107H Configuration

#define	GFXMMU_LUT107H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT107H_LO_0			(0x1u<<0)

// LUT108L Configuration

#define	GFXMMU_LUT108L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT108L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT108L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT108L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT108L_EN			(0x1u<<0)

#define	GFXMMU_LUT108L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT108L_EN_B_0X1		(0x1u<<0)

// LUT108H Configuration

#define	GFXMMU_LUT108H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT108H_LO_0			(0x1u<<0)

// LUT109L Configuration

#define	GFXMMU_LUT109L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT109L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT109L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT109L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT109L_EN			(0x1u<<0)

#define	GFXMMU_LUT109L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT109L_EN_B_0X1		(0x1u<<0)

// LUT109H Configuration

#define	GFXMMU_LUT109H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT109H_LO_0			(0x1u<<0)

// LUT110L Configuration

#define	GFXMMU_LUT110L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT110L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT110L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT110L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT110L_EN			(0x1u<<0)

#define	GFXMMU_LUT110L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT110L_EN_B_0X1		(0x1u<<0)

// LUT110H Configuration

#define	GFXMMU_LUT110H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT110H_LO_0			(0x1u<<0)

// LUT111L Configuration

#define	GFXMMU_LUT111L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT111L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT111L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT111L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT111L_EN			(0x1u<<0)

#define	GFXMMU_LUT111L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT111L_EN_B_0X1		(0x1u<<0)

// LUT111H Configuration

#define	GFXMMU_LUT111H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT111H_LO_0			(0x1u<<0)

// LUT112L Configuration

#define	GFXMMU_LUT112L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT112L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT112L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT112L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT112L_EN			(0x1u<<0)

#define	GFXMMU_LUT112L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT112L_EN_B_0X1		(0x1u<<0)

// LUT112H Configuration

#define	GFXMMU_LUT112H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT112H_LO_0			(0x1u<<0)

// LUT113L Configuration

#define	GFXMMU_LUT113L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT113L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT113L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT113L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT113L_EN			(0x1u<<0)

#define	GFXMMU_LUT113L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT113L_EN_B_0X1		(0x1u<<0)

// LUT113H Configuration

#define	GFXMMU_LUT113H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT113H_LO_0			(0x1u<<0)

