hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT145H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT145H_LO_0			(0x1u<<0)

// LUT146L Configuration

#define	GFXMMU_LUT146L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT146L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT146L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT146L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT146L_EN			(0x1u<<0)

#define	GFXMMU_LUT146L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT146L_EN_B_0X1		(0x1u<<0)

// LUT146H Configuration

#define	GFXMMU_LUT146H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT146H_LO_0			(0x1u<<0)

// LUT147L Configuration

#define	GFXMMU_LUT147L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT147L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT147L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT147L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT147L_EN			(0x1u<<0)

#define	GFXMMU_LUT147L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT147L_EN_B_0X1		(0x1u<<0)

// LUT147H Configuration

#define	GFXMMU_LUT147H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT147H_LO_0			(0x1u<<0)

// LUT148L Configuration

#define	GFXMMU_LUT148L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT148L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT148L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT148L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT148L_EN			(0x1u<<0)

#define	GFXMMU_LUT148L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT148L_EN_B_0X1		(0x1u<<0)

// LUT148H Configuration

#define	GFXMMU_LUT148H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT148H_LO_0			(0x1u<<0)

// LUT149L Configuration

#define	GFXMMU_LUT149L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT149L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT149L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT149L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT149L_EN			(0x1u<<0)

#define	GFXMMU_LUT149L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT149L_EN_B_0X1		(0x1u<<0)

// LUT149H Configuration

#define	GFXMMU_LUT149H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT149H_LO_0			(0x1u<<0)

// LUT150L Configuration

#define	GFXMMU_LUT150L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT150L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT150L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT150L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT150L_EN			(0x1u<<0)

#define	GFXMMU_LUT150L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT150L_EN_B_0X1		(0x1u<<0)

// LUT150H Configuration

#define	GFXMMU_LUT150H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT150H_LO_0			(0x1u<<0)

// LUT151L Configuration

#define	GFXMMU_LUT151L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT151L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT151L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT151L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT151L_EN			(0x1u<<0)

#define	GFXMMU_LUT151L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT151L_EN_B_0X1		(0x1u<<0)

// LUT151H Configuration

#define	GFXMMU_LUT151H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT151H_LO_0			(0x1u<<0)

// LUT152L Configuration

#define	GFXMMU_LUT152L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT152L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT152L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT152L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT152L_EN			(0x1u<<0)

#define	GFXMMU_LUT152L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT152L_EN_B_0X1		(0x1u<<0)

// LUT152H Configuration

#define	GFXMMU_LUT152H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT152H_LO_0			(0x1u<<0)

// LUT153L Configuration

#define	GFXMMU_LUT153L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT153L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT153L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT153L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT153L_EN			(0x1u<<0)

#define	GFXMMU_LUT153L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT153L_EN_B_0X1		(0x1u<<0)

// LUT153H Configuration

#define	GFXMMU_LUT153H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT153H_LO_0			(0x1u<<0)

// LUT154L Configuration

#define	GFXMMU_LUT154L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT154L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT154L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT154L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT154L_EN			(0x1u<<0)

#define	GFXMMU_LUT154L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT154L_EN_B_0X1		(0x1u<<0)

// LUT154H Configuration

#define	GFXMMU_LUT154H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT154H_LO_0			(0x1u<<0)

// LUT155L Configuration

#define	GFXMMU_LUT155L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT155L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT155L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT155L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT155L_EN			(0x1u<<0)

#define	GFXMMU_LUT155L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT155L_EN_B_0X1		(0x1u<<0)

// LUT155H Configuration

#define	GFXMMU_LUT155H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT155H_LO_0			(0x1u<<0)

// LUT156L Configuration

#define	GFXMMU_LUT156L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT156L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT156L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT156L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT156L_EN			(0x1u<<0)

#define	GFXMMU_LUT156L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT156L_EN_B_0X1		(0x1u<<0)

// LUT156H Configuration

#define	GFXMMU_LUT156H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT156H_LO_0			(0x1u<<0)

// LUT157L Configuration

#define	GFXMMU_LUT157L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT157L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT157L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT157L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT157L_EN			(0x1u<<0)

#define	GFXMMU_LUT157L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT157L_EN_B_0X1		(0x1u<<0)

// LUT157H Configuration

#define	GFXMMU_LUT157H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT157H_LO_0			(0x1u<<0)

// LUT158L Configuration

#define	GFXMMU_LUT158L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT158L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT158L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT158L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT158L_EN			(0x1u<<0)

#define	GFXMMU_LUT158L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT158L_EN_B_0X1		(0x1u<<0)

// LUT158H Configuration

#define	GFXMMU_LUT158H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT158H_LO_0			(0x1u<<0)

// LUT159L Configuration

#define	GFXMMU_LUT159L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT159L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT159L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT159L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT159L_EN			(0x1u<<0)

#define	GFXMMU_LUT159L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT159L_EN_B_0X1		(0x1u<<0)

// LUT159H Configuration

#define	GFXMMU_LUT159H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT159H_LO_0			(0x1u<<0)

