hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT205L Configuration

#define	GFXMMU_LUT205L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT205L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT205L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT205L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT205L_EN			(0x1u<<0)

#define	GFXMMU_LUT205L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT205L_EN_B_0X1		(0x1u<<0)

// LUT205H Configuration

#define	GFXMMU_LUT205H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT205H_LO_0			(0x1u<<0)

// LUT206L Configuration

#define	GFXMMU_LUT206L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT206L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT206L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT206L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT206L_EN			(0x1u<<0)

#define	GFXMMU_LUT206L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT206L_EN_B_0X1		(0x1u<<0)

// LUT206H Configuration

#define	GFXMMU_LUT206H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT206H_LO_0			(0x1u<<0)

// LUT207L Configuration

#define	GFXMMU_LUT207L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT207L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT207L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT207L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT207L_EN			(0x1u<<0)

#define	GFXMMU_LUT207L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT207L_EN_B_0X1		(0x1u<<0)

// LUT207H Configuration

#define	GFXMMU_LUT207H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT207H_LO_0			(0x1u<<0)

// LUT208L Configuration

#define	GFXMMU_LUT208L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT208L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT208L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT208L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT208L_EN			(0x1u<<0)

#define	GFXMMU_LUT208L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT208L_EN_B_0X1		(0x1u<<0)

// LUT208H Configuration

#define	GFXMMU_LUT208H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT208H_LO_0			(0x1u<<0)

// LUT209L Configuration

#define	GFXMMU_LUT209L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT209L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT209L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT209L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT209L_EN			(0x1u<<0)

#define	GFXMMU_LUT209L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT209L_EN_B_0X1		(0x1u<<0)

// LUT209H Configuration

#define	GFXMMU_LUT209H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT209H_LO_0			(0x1u<<0)

// LUT210L Configuration

#define	GFXMMU_LUT210L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT210L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT210L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT210L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT210L_EN			(0x1u<<0)

#define	GFXMMU_LUT210L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT210L_EN_B_0X1		(0x1u<<0)

// LUT210H Configuration

#define	GFXMMU_LUT210H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT210H_LO_0			(0x1u<<0)

// LUT211L Configuration

#define	GFXMMU_LUT211L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT211L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT211L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT211L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT211L_EN			(0x1u<<0)

#define	GFXMMU_LUT211L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT211L_EN_B_0X1		(0x1u<<0)

// LUT211H Configuration

#define	GFXMMU_LUT211H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT211H_LO_0			(0x1u<<0)

// LUT212L Configuration

#define	GFXMMU_LUT212L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT212L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT212L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT212L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT212L_EN			(0x1u<<0)

#define	GFXMMU_LUT212L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT212L_EN_B_0X1		(0x1u<<0)

// LUT212H Configuration

#define	GFXMMU_LUT212H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT212H_LO_0			(0x1u<<0)

// LUT213L Configuration

#define	GFXMMU_LUT213L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT213L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT213L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT213L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT213L_EN			(0x1u<<0)

#define	GFXMMU_LUT213L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT213L_EN_B_0X1		(0x1u<<0)

// LUT213H Configuration

#define	GFXMMU_LUT213H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT213H_LO_0			(0x1u<<0)

// LUT214L Configuration

#define	GFXMMU_LUT214L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT214L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT214L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT214L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT214L_EN			(0x1u<<0)

#define	GFXMMU_LUT214L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT214L_EN_B_0X1		(0x1u<<0)

// LUT214H Configuration

#define	GFXMMU_LUT214H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT214H_LO_0			(0x1u<<0)

// LUT215L Configuration

#define	GFXMMU_LUT215L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT215L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT215L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT215L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT215L_EN			(0x1u<<0)

#define	GFXMMU_LUT215L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT215L_EN_B_0X1		(0x1u<<0)

// LUT215H Configuration

#define	GFXMMU_LUT215H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT215H_LO_0			(0x1u<<0)

// LUT216L Configuration

#define	GFXMMU_LUT216L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT216L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT216L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT216L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT216L_EN			(0x1u<<0)

#define	GFXMMU_LUT216L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT216L_EN_B_0X1		(0x1u<<0)

// LUT216H Configuration

#define	GFXMMU_LUT216H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT216H_LO_0			(0x1u<<0)

// LUT217L Configuration

#define	GFXMMU_LUT217L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT217L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT217L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT217L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT217L_EN			(0x1u<<0)

#define	GFXMMU_LUT217L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT217L_EN_B_0X1		(0x1u<<0)

// LUT217H Configuration

#define	GFXMMU_LUT217H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT217H_LO_0			(0x1u<<0)

// LUT218L Configuration

#define	GFXMMU_LUT218L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT218L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT218L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT218L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT218L_EN			(0x1u<<0)

#define	GFXMMU_LUT218L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT218L_EN_B_0X1		(0x1u<<0)

// LUT218H Configuration

#define	GFXMMU_LUT218H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT218H_LO_0			(0x1u<<0)

// LUT219L Configuration

#define	GFXMMU_LUT219L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT219L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT219L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT219L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT219L_EN			(0x1u<<0)

#define	GFXMMU_LUT219L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT219L_EN_B_0X1		(0x1u<<0)

