hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT219H Configuration

#define	GFXMMU_LUT219H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT219H_LO_0			(0x1u<<0)

// LUT220L Configuration

#define	GFXMMU_LUT220L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT220L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT220L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT220L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT220L_EN			(0x1u<<0)

#define	GFXMMU_LUT220L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT220L_EN_B_0X1		(0x1u<<0)

// LUT220H Configuration

#define	GFXMMU_LUT220H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT220H_LO_0			(0x1u<<0)

// LUT221L Configuration

#define	GFXMMU_LUT221L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT221L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT221L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT221L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT221L_EN			(0x1u<<0)

#define	GFXMMU_LUT221L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT221L_EN_B_0X1		(0x1u<<0)

// LUT221H Configuration

#define	GFXMMU_LUT221H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT221H_LO_0			(0x1u<<0)

// LUT222L Configuration

#define	GFXMMU_LUT222L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT222L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT222L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT222L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT222L_EN			(0x1u<<0)

#define	GFXMMU_LUT222L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT222L_EN_B_0X1		(0x1u<<0)

// LUT222H Configuration

#define	GFXMMU_LUT222H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT222H_LO_0			(0x1u<<0)

// LUT223L Configuration

#define	GFXMMU_LUT223L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT223L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT223L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT223L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT223L_EN			(0x1u<<0)

#define	GFXMMU_LUT223L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT223L_EN_B_0X1		(0x1u<<0)

// LUT223H Configuration

#define	GFXMMU_LUT223H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT223H_LO_0			(0x1u<<0)

// LUT224L Configuration

#define	GFXMMU_LUT224L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT224L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT224L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT224L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT224L_EN			(0x1u<<0)

#define	GFXMMU_LUT224L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT224L_EN_B_0X1		(0x1u<<0)

// LUT224H Configuration

#define	GFXMMU_LUT224H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT224H_LO_0			(0x1u<<0)

// LUT225L Configuration

#define	GFXMMU_LUT225L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT225L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT225L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT225L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT225L_EN			(0x1u<<0)

#define	GFXMMU_LUT225L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT225L_EN_B_0X1		(0x1u<<0)

// LUT225H Configuration

#define	GFXMMU_LUT225H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT225H_LO_0			(0x1u<<0)

// LUT226L Configuration

#define	GFXMMU_LUT226L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT226L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT226L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT226L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT226L_EN			(0x1u<<0)

#define	GFXMMU_LUT226L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT226L_EN_B_0X1		(0x1u<<0)

// LUT226H Configuration

#define	GFXMMU_LUT226H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT226H_LO_0			(0x1u<<0)

// LUT227L Configuration

#define	GFXMMU_LUT227L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT227L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT227L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT227L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT227L_EN			(0x1u<<0)

#define	GFXMMU_LUT227L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT227L_EN_B_0X1		(0x1u<<0)

// LUT227H Configuration

#define	GFXMMU_LUT227H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT227H_LO_0			(0x1u<<0)

// LUT228L Configuration

#define	GFXMMU_LUT228L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT228L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT228L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT228L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT228L_EN			(0x1u<<0)

#define	GFXMMU_LUT228L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT228L_EN_B_0X1		(0x1u<<0)

// LUT228H Configuration

#define	GFXMMU_LUT228H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT228H_LO_0			(0x1u<<0)

// LUT229L Configuration

#define	GFXMMU_LUT229L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT229L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT229L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT229L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT229L_EN			(0x1u<<0)

#define	GFXMMU_LUT229L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT229L_EN_B_0X1		(0x1u<<0)

// LUT229H Configuration

#define	GFXMMU_LUT229H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT229H_LO_0			(0x1u<<0)

// LUT230L Configuration

#define	GFXMMU_LUT230L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT230L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT230L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT230L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT230L_EN			(0x1u<<0)

#define	GFXMMU_LUT230L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT230L_EN_B_0X1		(0x1u<<0)

// LUT230H Configuration

#define	GFXMMU_LUT230H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT230H_LO_0			(0x1u<<0)

// LUT231L Configuration

#define	GFXMMU_LUT231L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT231L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT231L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT231L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT231L_EN			(0x1u<<0)

#define	GFXMMU_LUT231L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT231L_EN_B_0X1		(0x1u<<0)

// LUT231H Configuration

#define	GFXMMU_LUT231H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT231H_LO_0			(0x1u<<0)

// LUT232L Configuration

#define	GFXMMU_LUT232L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT232L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT232L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT232L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT232L_EN			(0x1u<<0)

#define	GFXMMU_LUT232L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT232L_EN_B_0X1		(0x1u<<0)

// LUT232H Configuration

#define	GFXMMU_LUT232H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT232H_LO_0			(0x1u<<0)

// LUT233L Configuration

#define	GFXMMU_LUT233L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT233L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT233L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT233L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT233L_EN			(0x1u<<0)

#define	GFXMMU_LUT233L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT233L_EN_B_0X1		(0x1u<<0)

// LUT233H Configuration

#define	GFXMMU_LUT233H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT233H_LO_0			(0x1u<<0)

// LUT234L Configuration

