hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT234L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT234L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT234L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT234L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT234L_EN			(0x1u<<0)

#define	GFXMMU_LUT234L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT234L_EN_B_0X1		(0x1u<<0)

// LUT234H Configuration

#define	GFXMMU_LUT234H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT234H_LO_0			(0x1u<<0)

// LUT235L Configuration

#define	GFXMMU_LUT235L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT235L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT235L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT235L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT235L_EN			(0x1u<<0)

#define	GFXMMU_LUT235L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT235L_EN_B_0X1		(0x1u<<0)

// LUT235H Configuration

#define	GFXMMU_LUT235H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT235H_LO_0			(0x1u<<0)

// LUT236L Configuration

#define	GFXMMU_LUT236L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT236L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT236L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT236L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT236L_EN			(0x1u<<0)

#define	GFXMMU_LUT236L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT236L_EN_B_0X1		(0x1u<<0)

// LUT236H Configuration

#define	GFXMMU_LUT236H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT236H_LO_0			(0x1u<<0)

// LUT237L Configuration

#define	GFXMMU_LUT237L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT237L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT237L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT237L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT237L_EN			(0x1u<<0)

#define	GFXMMU_LUT237L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT237L_EN_B_0X1		(0x1u<<0)

// LUT237H Configuration

#define	GFXMMU_LUT237H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT237H_LO_0			(0x1u<<0)

// LUT238L Configuration

#define	GFXMMU_LUT238L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT238L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT238L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT238L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT238L_EN			(0x1u<<0)

#define	GFXMMU_LUT238L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT238L_EN_B_0X1		(0x1u<<0)

// LUT238H Configuration

#define	GFXMMU_LUT238H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT238H_LO_0			(0x1u<<0)

// LUT239L Configuration

#define	GFXMMU_LUT239L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT239L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT239L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT239L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT239L_EN			(0x1u<<0)

#define	GFXMMU_LUT239L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT239L_EN_B_0X1		(0x1u<<0)

// LUT239H Configuration

#define	GFXMMU_LUT239H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT239H_LO_0			(0x1u<<0)

// LUT240L Configuration

#define	GFXMMU_LUT240L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT240L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT240L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT240L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT240L_EN			(0x1u<<0)

#define	GFXMMU_LUT240L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT240L_EN_B_0X1		(0x1u<<0)

// LUT240H Configuration

#define	GFXMMU_LUT240H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT240H_LO_0			(0x1u<<0)

// LUT241L Configuration

#define	GFXMMU_LUT241L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT241L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT241L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT241L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT241L_EN			(0x1u<<0)

#define	GFXMMU_LUT241L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT241L_EN_B_0X1		(0x1u<<0)

// LUT241H Configuration

#define	GFXMMU_LUT241H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT241H_LO_0			(0x1u<<0)

// LUT242L Configuration

#define	GFXMMU_LUT242L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT242L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT242L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT242L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT242L_EN			(0x1u<<0)

#define	GFXMMU_LUT242L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT242L_EN_B_0X1		(0x1u<<0)

// LUT242H Configuration

#define	GFXMMU_LUT242H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT242H_LO_0			(0x1u<<0)

// LUT243L Configuration

#define	GFXMMU_LUT243L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT243L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT243L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT243L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT243L_EN			(0x1u<<0)

#define	GFXMMU_LUT243L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT243L_EN_B_0X1		(0x1u<<0)

// LUT243H Configuration

#define	GFXMMU_LUT243H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT243H_LO_0			(0x1u<<0)

// LUT244L Configuration

#define	GFXMMU_LUT244L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT244L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT244L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT244L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT244L_EN			(0x1u<<0)

#define	GFXMMU_LUT244L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT244L_EN_B_0X1		(0x1u<<0)

// LUT244H Configuration

#define	GFXMMU_LUT244H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT244H_LO_0			(0x1u<<0)

// LUT245L Configuration

#define	GFXMMU_LUT245L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT245L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT245L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT245L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT245L_EN			(0x1u<<0)

#define	GFXMMU_LUT245L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT245L_EN_B_0X1		(0x1u<<0)

// LUT245H Configuration

#define	GFXMMU_LUT245H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT245H_LO_0			(0x1u<<0)

// LUT246L Configuration

#define	GFXMMU_LUT246L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT246L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT246L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT246L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT246L_EN			(0x1u<<0)

#define	GFXMMU_LUT246L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT246L_EN_B_0X1		(0x1u<<0)

// LUT246H Configuration

#define	GFXMMU_LUT246H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT246H_LO_0			(0x1u<<0)

// LUT247L Configuration

#define	GFXMMU_LUT247L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT247L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT247L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT247L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT247L_EN			(0x1u<<0)

#define	GFXMMU_LUT247L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT247L_EN_B_0X1		(0x1u<<0)

// LUT247H Configuration

#define	GFXMMU_LUT247H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT247H_LO_0			(0x1u<<0)

// LUT248L Configuration

#define	GFXMMU_LUT248L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT248L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT248L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT248L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT248L_EN			(0x1u<<0)

#define	GFXMMU_LUT248L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT248L_EN_B_0X1		(0x1u<<0)

// LUT248H Configuration

#define	GFXMMU_LUT248H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT248H_LO_0			(0x1u<<0)

// LUT249L Configuration

#define	GFXMMU_LUT249L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT249L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT249L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT249L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT249L_EN			(0x1u<<0)

#define	GFXMMU_LUT249L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT249L_EN_B_0X1		(0x1u<<0)

