hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT264L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT264L_EN_B_0X1		(0x1u<<0)

// LUT264H Configuration

#define	GFXMMU_LUT264H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT264H_LO_0			(0x1u<<0)

// LUT265L Configuration

#define	GFXMMU_LUT265L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT265L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT265L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT265L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT265L_EN			(0x1u<<0)

#define	GFXMMU_LUT265L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT265L_EN_B_0X1		(0x1u<<0)

// LUT265H Configuration

#define	GFXMMU_LUT265H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT265H_LO_0			(0x1u<<0)

// LUT266L Configuration

#define	GFXMMU_LUT266L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT266L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT266L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT266L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT266L_EN			(0x1u<<0)

#define	GFXMMU_LUT266L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT266L_EN_B_0X1		(0x1u<<0)

// LUT266H Configuration

#define	GFXMMU_LUT266H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT266H_LO_0			(0x1u<<0)

// LUT267L Configuration

#define	GFXMMU_LUT267L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT267L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT267L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT267L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT267L_EN			(0x1u<<0)

#define	GFXMMU_LUT267L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT267L_EN_B_0X1		(0x1u<<0)

// LUT267H Configuration

#define	GFXMMU_LUT267H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT267H_LO_0			(0x1u<<0)

// LUT268L Configuration

#define	GFXMMU_LUT268L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT268L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT268L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT268L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT268L_EN			(0x1u<<0)

#define	GFXMMU_LUT268L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT268L_EN_B_0X1		(0x1u<<0)

// LUT268H Configuration

#define	GFXMMU_LUT268H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT268H_LO_0			(0x1u<<0)

// LUT269L Configuration

#define	GFXMMU_LUT269L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT269L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT269L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT269L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT269L_EN			(0x1u<<0)

#define	GFXMMU_LUT269L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT269L_EN_B_0X1		(0x1u<<0)

// LUT269H Configuration

#define	GFXMMU_LUT269H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT269H_LO_0			(0x1u<<0)

// LUT270L Configuration

#define	GFXMMU_LUT270L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT270L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT270L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT270L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT270L_EN			(0x1u<<0)

#define	GFXMMU_LUT270L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT270L_EN_B_0X1		(0x1u<<0)

// LUT270H Configuration

#define	GFXMMU_LUT270H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT270H_LO_0			(0x1u<<0)

// LUT271L Configuration

#define	GFXMMU_LUT271L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT271L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT271L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT271L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT271L_EN			(0x1u<<0)

#define	GFXMMU_LUT271L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT271L_EN_B_0X1		(0x1u<<0)

// LUT271H Configuration

#define	GFXMMU_LUT271H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT271H_LO_0			(0x1u<<0)

// LUT272L Configuration

#define	GFXMMU_LUT272L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT272L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT272L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT272L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT272L_EN			(0x1u<<0)

#define	GFXMMU_LUT272L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT272L_EN_B_0X1		(0x1u<<0)

// LUT272H Configuration

#define	GFXMMU_LUT272H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT272H_LO_0			(0x1u<<0)

// LUT273L Configuration

#define	GFXMMU_LUT273L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT273L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT273L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT273L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT273L_EN			(0x1u<<0)

#define	GFXMMU_LUT273L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT273L_EN_B_0X1		(0x1u<<0)

// LUT273H Configuration

#define	GFXMMU_LUT273H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT273H_LO_0			(0x1u<<0)

// LUT274L Configuration

#define	GFXMMU_LUT274L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT274L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT274L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT274L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT274L_EN			(0x1u<<0)

#define	GFXMMU_LUT274L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT274L_EN_B_0X1		(0x1u<<0)

// LUT274H Configuration

#define	GFXMMU_LUT274H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT274H_LO_0			(0x1u<<0)

// LUT275L Configuration

#define	GFXMMU_LUT275L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT275L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT275L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT275L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT275L_EN			(0x1u<<0)

#define	GFXMMU_LUT275L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT275L_EN_B_0X1		(0x1u<<0)

// LUT275H Configuration

#define	GFXMMU_LUT275H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT275H_LO_0			(0x1u<<0)

// LUT276L Configuration

#define	GFXMMU_LUT276L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT276L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT276L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT276L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT276L_EN			(0x1u<<0)

#define	GFXMMU_LUT276L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT276L_EN_B_0X1		(0x1u<<0)

// LUT276H Configuration

#define	GFXMMU_LUT276H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT276H_LO_0			(0x1u<<0)

// LUT277L Configuration

#define	GFXMMU_LUT277L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT277L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT277L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT277L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT277L_EN			(0x1u<<0)

#define	GFXMMU_LUT277L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT277L_EN_B_0X1		(0x1u<<0)

// LUT277H Configuration

#define	GFXMMU_LUT277H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT277H_LO_0			(0x1u<<0)

// LUT278L Configuration

#define	GFXMMU_LUT278L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT278L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT278L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT278L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT278L_EN			(0x1u<<0)

#define	GFXMMU_LUT278L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT278L_EN_B_0X1		(0x1u<<0)

// LUT278H Configuration

#define	GFXMMU_LUT278H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT278H_LO_0			(0x1u<<0)

// LUT279L Configuration

#define	GFXMMU_LUT279L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT279L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT279L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT279L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT279L_EN			(0x1u<<0)

