hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT279L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT279L_EN_B_0X1		(0x1u<<0)

// LUT279H Configuration

#define	GFXMMU_LUT279H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT279H_LO_0			(0x1u<<0)

// LUT280L Configuration

#define	GFXMMU_LUT280L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT280L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT280L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT280L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT280L_EN			(0x1u<<0)

#define	GFXMMU_LUT280L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT280L_EN_B_0X1		(0x1u<<0)

// LUT280H Configuration

#define	GFXMMU_LUT280H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT280H_LO_0			(0x1u<<0)

// LUT281L Configuration

#define	GFXMMU_LUT281L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT281L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT281L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT281L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT281L_EN			(0x1u<<0)

#define	GFXMMU_LUT281L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT281L_EN_B_0X1		(0x1u<<0)

// LUT281H Configuration

#define	GFXMMU_LUT281H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT281H_LO_0			(0x1u<<0)

// LUT282L Configuration

#define	GFXMMU_LUT282L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT282L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT282L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT282L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT282L_EN			(0x1u<<0)

#define	GFXMMU_LUT282L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT282L_EN_B_0X1		(0x1u<<0)

// LUT282H Configuration

#define	GFXMMU_LUT282H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT282H_LO_0			(0x1u<<0)

// LUT283L Configuration

#define	GFXMMU_LUT283L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT283L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT283L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT283L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT283L_EN			(0x1u<<0)

#define	GFXMMU_LUT283L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT283L_EN_B_0X1		(0x1u<<0)

// LUT283H Configuration

#define	GFXMMU_LUT283H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT283H_LO_0			(0x1u<<0)

// LUT284L Configuration

#define	GFXMMU_LUT284L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT284L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT284L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT284L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT284L_EN			(0x1u<<0)

#define	GFXMMU_LUT284L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT284L_EN_B_0X1		(0x1u<<0)

// LUT284H Configuration

#define	GFXMMU_LUT284H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT284H_LO_0			(0x1u<<0)

// LUT285L Configuration

#define	GFXMMU_LUT285L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT285L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT285L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT285L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT285L_EN			(0x1u<<0)

#define	GFXMMU_LUT285L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT285L_EN_B_0X1		(0x1u<<0)

// LUT285H Configuration

#define	GFXMMU_LUT285H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT285H_LO_0			(0x1u<<0)

// LUT286L Configuration

#define	GFXMMU_LUT286L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT286L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT286L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT286L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT286L_EN			(0x1u<<0)

#define	GFXMMU_LUT286L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT286L_EN_B_0X1		(0x1u<<0)

// LUT286H Configuration

#define	GFXMMU_LUT286H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT286H_LO_0			(0x1u<<0)

// LUT287L Configuration

#define	GFXMMU_LUT287L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT287L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT287L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT287L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT287L_EN			(0x1u<<0)

#define	GFXMMU_LUT287L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT287L_EN_B_0X1		(0x1u<<0)

// LUT287H Configuration

#define	GFXMMU_LUT287H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT287H_LO_0			(0x1u<<0)

// LUT288L Configuration

#define	GFXMMU_LUT288L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT288L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT288L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT288L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT288L_EN			(0x1u<<0)

#define	GFXMMU_LUT288L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT288L_EN_B_0X1		(0x1u<<0)

// LUT288H Configuration

#define	GFXMMU_LUT288H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT288H_LO_0			(0x1u<<0)

// LUT289L Configuration

#define	GFXMMU_LUT289L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT289L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT289L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT289L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT289L_EN			(0x1u<<0)

#define	GFXMMU_LUT289L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT289L_EN_B_0X1		(0x1u<<0)

// LUT289H Configuration

#define	GFXMMU_LUT289H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT289H_LO_0			(0x1u<<0)

// LUT290L Configuration

#define	GFXMMU_LUT290L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT290L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT290L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT290L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT290L_EN			(0x1u<<0)

#define	GFXMMU_LUT290L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT290L_EN_B_0X1		(0x1u<<0)

// LUT290H Configuration

#define	GFXMMU_LUT290H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT290H_LO_0			(0x1u<<0)

// LUT291L Configuration

#define	GFXMMU_LUT291L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT291L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT291L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT291L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT291L_EN			(0x1u<<0)

#define	GFXMMU_LUT291L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT291L_EN_B_0X1		(0x1u<<0)

// LUT291H Configuration

#define	GFXMMU_LUT291H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT291H_LO_0			(0x1u<<0)

// LUT292L Configuration

#define	GFXMMU_LUT292L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT292L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT292L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT292L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT292L_EN			(0x1u<<0)

#define	GFXMMU_LUT292L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT292L_EN_B_0X1		(0x1u<<0)

// LUT292H Configuration

#define	GFXMMU_LUT292H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT292H_LO_0			(0x1u<<0)

// LUT293L Configuration

#define	GFXMMU_LUT293L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT293L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT293L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT293L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT293L_EN			(0x1u<<0)

#define	GFXMMU_LUT293L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT293L_EN_B_0X1		(0x1u<<0)

// LUT293H Configuration

#define	GFXMMU_LUT293H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT293H_LO_0			(0x1u<<0)

