hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT324L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT324L_EN_B_0X1		(0x1u<<0)

// LUT324H Configuration

#define	GFXMMU_LUT324H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT324H_LO_0			(0x1u<<0)

// LUT325L Configuration

#define	GFXMMU_LUT325L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT325L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT325L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT325L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT325L_EN			(0x1u<<0)

#define	GFXMMU_LUT325L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT325L_EN_B_0X1		(0x1u<<0)

// LUT325H Configuration

#define	GFXMMU_LUT325H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT325H_LO_0			(0x1u<<0)

// LUT326L Configuration

#define	GFXMMU_LUT326L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT326L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT326L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT326L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT326L_EN			(0x1u<<0)

#define	GFXMMU_LUT326L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT326L_EN_B_0X1		(0x1u<<0)

// LUT326H Configuration

#define	GFXMMU_LUT326H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT326H_LO_0			(0x1u<<0)

// LUT327L Configuration

#define	GFXMMU_LUT327L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT327L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT327L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT327L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT327L_EN			(0x1u<<0)

#define	GFXMMU_LUT327L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT327L_EN_B_0X1		(0x1u<<0)

// LUT327H Configuration

#define	GFXMMU_LUT327H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT327H_LO_0			(0x1u<<0)

// LUT328L Configuration

#define	GFXMMU_LUT328L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT328L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT328L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT328L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT328L_EN			(0x1u<<0)

#define	GFXMMU_LUT328L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT328L_EN_B_0X1		(0x1u<<0)

// LUT328H Configuration

#define	GFXMMU_LUT328H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT328H_LO_0			(0x1u<<0)

// LUT329L Configuration

#define	GFXMMU_LUT329L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT329L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT329L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT329L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT329L_EN			(0x1u<<0)

#define	GFXMMU_LUT329L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT329L_EN_B_0X1		(0x1u<<0)

// LUT329H Configuration

#define	GFXMMU_LUT329H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT329H_LO_0			(0x1u<<0)

// LUT330L Configuration

#define	GFXMMU_LUT330L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT330L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT330L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT330L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT330L_EN			(0x1u<<0)

#define	GFXMMU_LUT330L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT330L_EN_B_0X1		(0x1u<<0)

// LUT330H Configuration

#define	GFXMMU_LUT330H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT330H_LO_0			(0x1u<<0)

// LUT331L Configuration

#define	GFXMMU_LUT331L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT331L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT331L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT331L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT331L_EN			(0x1u<<0)

#define	GFXMMU_LUT331L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT331L_EN_B_0X1		(0x1u<<0)

// LUT331H Configuration

#define	GFXMMU_LUT331H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT331H_LO_0			(0x1u<<0)

// LUT332L Configuration

#define	GFXMMU_LUT332L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT332L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT332L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT332L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT332L_EN			(0x1u<<0)

#define	GFXMMU_LUT332L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT332L_EN_B_0X1		(0x1u<<0)

// LUT332H Configuration

#define	GFXMMU_LUT332H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT332H_LO_0			(0x1u<<0)

// LUT333L Configuration

#define	GFXMMU_LUT333L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT333L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT333L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT333L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT333L_EN			(0x1u<<0)

#define	GFXMMU_LUT333L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT333L_EN_B_0X1		(0x1u<<0)

// LUT333H Configuration

#define	GFXMMU_LUT333H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT333H_LO_0			(0x1u<<0)

// LUT334L Configuration

#define	GFXMMU_LUT334L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT334L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT334L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT334L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT334L_EN			(0x1u<<0)

#define	GFXMMU_LUT334L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT334L_EN_B_0X1		(0x1u<<0)

// LUT334H Configuration

#define	GFXMMU_LUT334H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT334H_LO_0			(0x1u<<0)

// LUT335L Configuration

#define	GFXMMU_LUT335L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT335L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT335L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT335L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT335L_EN			(0x1u<<0)

#define	GFXMMU_LUT335L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT335L_EN_B_0X1		(0x1u<<0)

// LUT335H Configuration

#define	GFXMMU_LUT335H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT335H_LO_0			(0x1u<<0)

// LUT336L Configuration

#define	GFXMMU_LUT336L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT336L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT336L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT336L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT336L_EN			(0x1u<<0)

#define	GFXMMU_LUT336L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT336L_EN_B_0X1		(0x1u<<0)

// LUT336H Configuration

#define	GFXMMU_LUT336H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT336H_LO_0			(0x1u<<0)

// LUT337L Configuration

#define	GFXMMU_LUT337L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT337L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT337L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT337L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT337L_EN			(0x1u<<0)

#define	GFXMMU_LUT337L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT337L_EN_B_0X1		(0x1u<<0)

// LUT337H Configuration

#define	GFXMMU_LUT337H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT337H_LO_0			(0x1u<<0)

// LUT338L Configuration

#define	GFXMMU_LUT338L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT338L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT338L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT338L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT338L_EN			(0x1u<<0)

#define	GFXMMU_LUT338L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT338L_EN_B_0X1		(0x1u<<0)

// LUT338H Configuration

#define	GFXMMU_LUT338H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT338H_LO_0			(0x1u<<0)

// LUT339L Configuration

#define	GFXMMU_LUT339L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT339L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT339L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT339L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT339L_EN			(0x1u<<0)

