hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT354L Configuration

#define	GFXMMU_LUT354L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT354L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT354L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT354L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT354L_EN			(0x1u<<0)

#define	GFXMMU_LUT354L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT354L_EN_B_0X1		(0x1u<<0)

// LUT354H Configuration

#define	GFXMMU_LUT354H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT354H_LO_0			(0x1u<<0)

// LUT355L Configuration

#define	GFXMMU_LUT355L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT355L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT355L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT355L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT355L_EN			(0x1u<<0)

#define	GFXMMU_LUT355L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT355L_EN_B_0X1		(0x1u<<0)

// LUT355H Configuration

#define	GFXMMU_LUT355H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT355H_LO_0			(0x1u<<0)

// LUT356L Configuration

#define	GFXMMU_LUT356L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT356L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT356L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT356L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT356L_EN			(0x1u<<0)

#define	GFXMMU_LUT356L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT356L_EN_B_0X1		(0x1u<<0)

// LUT356H Configuration

#define	GFXMMU_LUT356H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT356H_LO_0			(0x1u<<0)

// LUT357L Configuration

#define	GFXMMU_LUT357L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT357L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT357L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT357L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT357L_EN			(0x1u<<0)

#define	GFXMMU_LUT357L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT357L_EN_B_0X1		(0x1u<<0)

// LUT357H Configuration

#define	GFXMMU_LUT357H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT357H_LO_0			(0x1u<<0)

// LUT358L Configuration

#define	GFXMMU_LUT358L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT358L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT358L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT358L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT358L_EN			(0x1u<<0)

#define	GFXMMU_LUT358L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT358L_EN_B_0X1		(0x1u<<0)

// LUT358H Configuration

#define	GFXMMU_LUT358H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT358H_LO_0			(0x1u<<0)

// LUT359L Configuration

#define	GFXMMU_LUT359L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT359L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT359L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT359L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT359L_EN			(0x1u<<0)

#define	GFXMMU_LUT359L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT359L_EN_B_0X1		(0x1u<<0)

// LUT359H Configuration

#define	GFXMMU_LUT359H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT359H_LO_0			(0x1u<<0)

// LUT360L Configuration

#define	GFXMMU_LUT360L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT360L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT360L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT360L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT360L_EN			(0x1u<<0)

#define	GFXMMU_LUT360L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT360L_EN_B_0X1		(0x1u<<0)

// LUT360H Configuration

#define	GFXMMU_LUT360H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT360H_LO_0			(0x1u<<0)

// LUT361L Configuration

#define	GFXMMU_LUT361L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT361L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT361L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT361L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT361L_EN			(0x1u<<0)

#define	GFXMMU_LUT361L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT361L_EN_B_0X1		(0x1u<<0)

// LUT361H Configuration

#define	GFXMMU_LUT361H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT361H_LO_0			(0x1u<<0)

// LUT362L Configuration

#define	GFXMMU_LUT362L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT362L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT362L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT362L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT362L_EN			(0x1u<<0)

#define	GFXMMU_LUT362L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT362L_EN_B_0X1		(0x1u<<0)

// LUT362H Configuration

#define	GFXMMU_LUT362H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT362H_LO_0			(0x1u<<0)

// LUT363L Configuration

#define	GFXMMU_LUT363L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT363L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT363L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT363L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT363L_EN			(0x1u<<0)

#define	GFXMMU_LUT363L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT363L_EN_B_0X1		(0x1u<<0)

// LUT363H Configuration

#define	GFXMMU_LUT363H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT363H_LO_0			(0x1u<<0)

// LUT364L Configuration

#define	GFXMMU_LUT364L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT364L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT364L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT364L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT364L_EN			(0x1u<<0)

#define	GFXMMU_LUT364L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT364L_EN_B_0X1		(0x1u<<0)

// LUT364H Configuration

#define	GFXMMU_LUT364H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT364H_LO_0			(0x1u<<0)

// LUT365L Configuration

#define	GFXMMU_LUT365L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT365L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT365L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT365L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT365L_EN			(0x1u<<0)

#define	GFXMMU_LUT365L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT365L_EN_B_0X1		(0x1u<<0)

// LUT365H Configuration

#define	GFXMMU_LUT365H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT365H_LO_0			(0x1u<<0)

// LUT366L Configuration

#define	GFXMMU_LUT366L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT366L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT366L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT366L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT366L_EN			(0x1u<<0)

#define	GFXMMU_LUT366L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT366L_EN_B_0X1		(0x1u<<0)

// LUT366H Configuration

#define	GFXMMU_LUT366H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT366H_LO_0			(0x1u<<0)

// LUT367L Configuration

#define	GFXMMU_LUT367L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT367L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT367L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT367L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT367L_EN			(0x1u<<0)

#define	GFXMMU_LUT367L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT367L_EN_B_0X1		(0x1u<<0)

// LUT367H Configuration

#define	GFXMMU_LUT367H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT367H_LO_0			(0x1u<<0)

// LUT368L Configuration

#define	GFXMMU_LUT368L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT368L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT368L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT368L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT368L_EN			(0x1u<<0)

#define	GFXMMU_LUT368L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT368L_EN_B_0X1		(0x1u<<0)

// LUT368H Configuration

#define	GFXMMU_LUT368H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT368H_LO_0			(0x1u<<0)

// LUT369L Configuration

