hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT369L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT369L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT369L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT369L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT369L_EN			(0x1u<<0)

#define	GFXMMU_LUT369L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT369L_EN_B_0X1		(0x1u<<0)

// LUT369H Configuration

#define	GFXMMU_LUT369H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT369H_LO_0			(0x1u<<0)

// LUT370L Configuration

#define	GFXMMU_LUT370L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT370L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT370L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT370L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT370L_EN			(0x1u<<0)

#define	GFXMMU_LUT370L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT370L_EN_B_0X1		(0x1u<<0)

// LUT370H Configuration

#define	GFXMMU_LUT370H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT370H_LO_0			(0x1u<<0)

// LUT371L Configuration

#define	GFXMMU_LUT371L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT371L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT371L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT371L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT371L_EN			(0x1u<<0)

#define	GFXMMU_LUT371L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT371L_EN_B_0X1		(0x1u<<0)

// LUT371H Configuration

#define	GFXMMU_LUT371H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT371H_LO_0			(0x1u<<0)

// LUT372L Configuration

#define	GFXMMU_LUT372L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT372L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT372L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT372L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT372L_EN			(0x1u<<0)

#define	GFXMMU_LUT372L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT372L_EN_B_0X1		(0x1u<<0)

// LUT372H Configuration

#define	GFXMMU_LUT372H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT372H_LO_0			(0x1u<<0)

// LUT373L Configuration

#define	GFXMMU_LUT373L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT373L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT373L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT373L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT373L_EN			(0x1u<<0)

#define	GFXMMU_LUT373L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT373L_EN_B_0X1		(0x1u<<0)

// LUT373H Configuration

#define	GFXMMU_LUT373H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT373H_LO_0			(0x1u<<0)

// LUT374L Configuration

#define	GFXMMU_LUT374L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT374L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT374L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT374L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT374L_EN			(0x1u<<0)

#define	GFXMMU_LUT374L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT374L_EN_B_0X1		(0x1u<<0)

// LUT374H Configuration

#define	GFXMMU_LUT374H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT374H_LO_0			(0x1u<<0)

// LUT375L Configuration

#define	GFXMMU_LUT375L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT375L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT375L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT375L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT375L_EN			(0x1u<<0)

#define	GFXMMU_LUT375L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT375L_EN_B_0X1		(0x1u<<0)

// LUT375H Configuration

#define	GFXMMU_LUT375H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT375H_LO_0			(0x1u<<0)

// LUT376L Configuration

#define	GFXMMU_LUT376L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT376L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT376L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT376L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT376L_EN			(0x1u<<0)

#define	GFXMMU_LUT376L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT376L_EN_B_0X1		(0x1u<<0)

// LUT376H Configuration

#define	GFXMMU_LUT376H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT376H_LO_0			(0x1u<<0)

// LUT377L Configuration

#define	GFXMMU_LUT377L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT377L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT377L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT377L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT377L_EN			(0x1u<<0)

#define	GFXMMU_LUT377L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT377L_EN_B_0X1		(0x1u<<0)

// LUT377H Configuration

#define	GFXMMU_LUT377H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT377H_LO_0			(0x1u<<0)

// LUT378L Configuration

#define	GFXMMU_LUT378L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT378L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT378L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT378L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT378L_EN			(0x1u<<0)

#define	GFXMMU_LUT378L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT378L_EN_B_0X1		(0x1u<<0)

// LUT378H Configuration

#define	GFXMMU_LUT378H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT378H_LO_0			(0x1u<<0)

// LUT379L Configuration

#define	GFXMMU_LUT379L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT379L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT379L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT379L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT379L_EN			(0x1u<<0)

#define	GFXMMU_LUT379L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT379L_EN_B_0X1		(0x1u<<0)

// LUT379H Configuration

#define	GFXMMU_LUT379H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT379H_LO_0			(0x1u<<0)

// LUT380L Configuration

#define	GFXMMU_LUT380L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT380L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT380L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT380L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT380L_EN			(0x1u<<0)

#define	GFXMMU_LUT380L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT380L_EN_B_0X1		(0x1u<<0)

// LUT380H Configuration

#define	GFXMMU_LUT380H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT380H_LO_0			(0x1u<<0)

// LUT381L Configuration

#define	GFXMMU_LUT381L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT381L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT381L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT381L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT381L_EN			(0x1u<<0)

#define	GFXMMU_LUT381L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT381L_EN_B_0X1		(0x1u<<0)

// LUT381H Configuration

#define	GFXMMU_LUT381H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT381H_LO_0			(0x1u<<0)

// LUT382L Configuration

#define	GFXMMU_LUT382L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT382L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT382L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT382L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT382L_EN			(0x1u<<0)

#define	GFXMMU_LUT382L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT382L_EN_B_0X1		(0x1u<<0)

// LUT382H Configuration

#define	GFXMMU_LUT382H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT382H_LO_0			(0x1u<<0)

// LUT383L Configuration

#define	GFXMMU_LUT383L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT383L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT383L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT383L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT383L_EN			(0x1u<<0)

#define	GFXMMU_LUT383L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT383L_EN_B_0X1		(0x1u<<0)

