hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT398L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT398L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT398L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT398L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT398L_EN			(0x1u<<0)

#define	GFXMMU_LUT398L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT398L_EN_B_0X1		(0x1u<<0)

// LUT398H Configuration

#define	GFXMMU_LUT398H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT398H_LO_0			(0x1u<<0)

// LUT399L Configuration

#define	GFXMMU_LUT399L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT399L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT399L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT399L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT399L_EN			(0x1u<<0)

#define	GFXMMU_LUT399L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT399L_EN_B_0X1		(0x1u<<0)

// LUT399H Configuration

#define	GFXMMU_LUT399H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT399H_LO_0			(0x1u<<0)

// LUT400L Configuration

#define	GFXMMU_LUT400L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT400L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT400L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT400L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT400L_EN			(0x1u<<0)

#define	GFXMMU_LUT400L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT400L_EN_B_0X1		(0x1u<<0)

// LUT400H Configuration

#define	GFXMMU_LUT400H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT400H_LO_0			(0x1u<<0)

// LUT401L Configuration

#define	GFXMMU_LUT401L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT401L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT401L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT401L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT401L_EN			(0x1u<<0)

#define	GFXMMU_LUT401L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT401L_EN_B_0X1		(0x1u<<0)

// LUT401H Configuration

#define	GFXMMU_LUT401H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT401H_LO_0			(0x1u<<0)

// LUT402L Configuration

#define	GFXMMU_LUT402L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT402L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT402L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT402L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT402L_EN			(0x1u<<0)

#define	GFXMMU_LUT402L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT402L_EN_B_0X1		(0x1u<<0)

// LUT402H Configuration

#define	GFXMMU_LUT402H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT402H_LO_0			(0x1u<<0)

// LUT403L Configuration

#define	GFXMMU_LUT403L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT403L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT403L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT403L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT403L_EN			(0x1u<<0)

#define	GFXMMU_LUT403L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT403L_EN_B_0X1		(0x1u<<0)

// LUT403H Configuration

#define	GFXMMU_LUT403H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT403H_LO_0			(0x1u<<0)

// LUT404L Configuration

#define	GFXMMU_LUT404L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT404L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT404L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT404L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT404L_EN			(0x1u<<0)

#define	GFXMMU_LUT404L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT404L_EN_B_0X1		(0x1u<<0)

// LUT404H Configuration

#define	GFXMMU_LUT404H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT404H_LO_0			(0x1u<<0)

// LUT405L Configuration

#define	GFXMMU_LUT405L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT405L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT405L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT405L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT405L_EN			(0x1u<<0)

#define	GFXMMU_LUT405L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT405L_EN_B_0X1		(0x1u<<0)

// LUT405H Configuration

#define	GFXMMU_LUT405H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT405H_LO_0			(0x1u<<0)

// LUT406L Configuration

#define	GFXMMU_LUT406L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT406L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT406L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT406L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT406L_EN			(0x1u<<0)

#define	GFXMMU_LUT406L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT406L_EN_B_0X1		(0x1u<<0)

// LUT406H Configuration

#define	GFXMMU_LUT406H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT406H_LO_0			(0x1u<<0)

// LUT407L Configuration

#define	GFXMMU_LUT407L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT407L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT407L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT407L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT407L_EN			(0x1u<<0)

#define	GFXMMU_LUT407L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT407L_EN_B_0X1		(0x1u<<0)

// LUT407H Configuration

#define	GFXMMU_LUT407H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT407H_LO_0			(0x1u<<0)

// LUT408L Configuration

#define	GFXMMU_LUT408L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT408L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT408L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT408L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT408L_EN			(0x1u<<0)

#define	GFXMMU_LUT408L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT408L_EN_B_0X1		(0x1u<<0)

// LUT408H Configuration

#define	GFXMMU_LUT408H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT408H_LO_0			(0x1u<<0)

// LUT409L Configuration

#define	GFXMMU_LUT409L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT409L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT409L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT409L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT409L_EN			(0x1u<<0)

#define	GFXMMU_LUT409L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT409L_EN_B_0X1		(0x1u<<0)

// LUT409H Configuration

#define	GFXMMU_LUT409H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT409H_LO_0			(0x1u<<0)

// LUT410L Configuration

#define	GFXMMU_LUT410L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT410L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT410L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT410L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT410L_EN			(0x1u<<0)

#define	GFXMMU_LUT410L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT410L_EN_B_0X1		(0x1u<<0)

// LUT410H Configuration

#define	GFXMMU_LUT410H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT410H_LO_0			(0x1u<<0)

// LUT411L Configuration

#define	GFXMMU_LUT411L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT411L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT411L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT411L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT411L_EN			(0x1u<<0)

#define	GFXMMU_LUT411L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT411L_EN_B_0X1		(0x1u<<0)

// LUT411H Configuration

#define	GFXMMU_LUT411H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT411H_LO_0			(0x1u<<0)

// LUT412L Configuration

#define	GFXMMU_LUT412L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT412L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT412L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT412L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT412L_EN			(0x1u<<0)

#define	GFXMMU_LUT412L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT412L_EN_B_0X1		(0x1u<<0)

