hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT412H Configuration

#define	GFXMMU_LUT412H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT412H_LO_0			(0x1u<<0)

// LUT413L Configuration

#define	GFXMMU_LUT413L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT413L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT413L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT413L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT413L_EN			(0x1u<<0)

#define	GFXMMU_LUT413L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT413L_EN_B_0X1		(0x1u<<0)

// LUT413H Configuration

#define	GFXMMU_LUT413H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT413H_LO_0			(0x1u<<0)

// LUT414L Configuration

#define	GFXMMU_LUT414L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT414L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT414L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT414L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT414L_EN			(0x1u<<0)

#define	GFXMMU_LUT414L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT414L_EN_B_0X1		(0x1u<<0)

// LUT414H Configuration

#define	GFXMMU_LUT414H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT414H_LO_0			(0x1u<<0)

// LUT415L Configuration

#define	GFXMMU_LUT415L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT415L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT415L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT415L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT415L_EN			(0x1u<<0)

#define	GFXMMU_LUT415L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT415L_EN_B_0X1		(0x1u<<0)

// LUT415H Configuration

#define	GFXMMU_LUT415H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT415H_LO_0			(0x1u<<0)

// LUT416L Configuration

#define	GFXMMU_LUT416L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT416L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT416L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT416L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT416L_EN			(0x1u<<0)

#define	GFXMMU_LUT416L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT416L_EN_B_0X1		(0x1u<<0)

// LUT416H Configuration

#define	GFXMMU_LUT416H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT416H_LO_0			(0x1u<<0)

// LUT417L Configuration

#define	GFXMMU_LUT417L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT417L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT417L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT417L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT417L_EN			(0x1u<<0)

#define	GFXMMU_LUT417L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT417L_EN_B_0X1		(0x1u<<0)

// LUT417H Configuration

#define	GFXMMU_LUT417H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT417H_LO_0			(0x1u<<0)

// LUT418L Configuration

#define	GFXMMU_LUT418L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT418L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT418L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT418L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT418L_EN			(0x1u<<0)

#define	GFXMMU_LUT418L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT418L_EN_B_0X1		(0x1u<<0)

// LUT418H Configuration

#define	GFXMMU_LUT418H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT418H_LO_0			(0x1u<<0)

// LUT419L Configuration

#define	GFXMMU_LUT419L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT419L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT419L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT419L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT419L_EN			(0x1u<<0)

#define	GFXMMU_LUT419L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT419L_EN_B_0X1		(0x1u<<0)

// LUT419H Configuration

#define	GFXMMU_LUT419H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT419H_LO_0			(0x1u<<0)

// LUT420L Configuration

#define	GFXMMU_LUT420L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT420L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT420L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT420L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT420L_EN			(0x1u<<0)

#define	GFXMMU_LUT420L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT420L_EN_B_0X1		(0x1u<<0)

// LUT420H Configuration

#define	GFXMMU_LUT420H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT420H_LO_0			(0x1u<<0)

// LUT421L Configuration

#define	GFXMMU_LUT421L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT421L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT421L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT421L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT421L_EN			(0x1u<<0)

#define	GFXMMU_LUT421L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT421L_EN_B_0X1		(0x1u<<0)

// LUT421H Configuration

#define	GFXMMU_LUT421H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT421H_LO_0			(0x1u<<0)

// LUT422L Configuration

#define	GFXMMU_LUT422L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT422L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT422L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT422L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT422L_EN			(0x1u<<0)

#define	GFXMMU_LUT422L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT422L_EN_B_0X1		(0x1u<<0)

// LUT422H Configuration

#define	GFXMMU_LUT422H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT422H_LO_0			(0x1u<<0)

// LUT423L Configuration

#define	GFXMMU_LUT423L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT423L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT423L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT423L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT423L_EN			(0x1u<<0)

#define	GFXMMU_LUT423L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT423L_EN_B_0X1		(0x1u<<0)

// LUT423H Configuration

#define	GFXMMU_LUT423H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT423H_LO_0			(0x1u<<0)

// LUT424L Configuration

#define	GFXMMU_LUT424L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT424L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT424L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT424L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT424L_EN			(0x1u<<0)

#define	GFXMMU_LUT424L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT424L_EN_B_0X1		(0x1u<<0)

// LUT424H Configuration

#define	GFXMMU_LUT424H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT424H_LO_0			(0x1u<<0)

// LUT425L Configuration

#define	GFXMMU_LUT425L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT425L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT425L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT425L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT425L_EN			(0x1u<<0)

#define	GFXMMU_LUT425L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT425L_EN_B_0X1		(0x1u<<0)

// LUT425H Configuration

#define	GFXMMU_LUT425H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT425H_LO_0			(0x1u<<0)

// LUT426L Configuration

#define	GFXMMU_LUT426L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT426L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT426L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT426L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT426L_EN			(0x1u<<0)

#define	GFXMMU_LUT426L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT426L_EN_B_0X1		(0x1u<<0)

// LUT426H Configuration

#define	GFXMMU_LUT426H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT426H_LO_0			(0x1u<<0)

// LUT427L Configuration

