hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT427L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT427L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT427L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT427L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT427L_EN			(0x1u<<0)

#define	GFXMMU_LUT427L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT427L_EN_B_0X1		(0x1u<<0)

// LUT427H Configuration

#define	GFXMMU_LUT427H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT427H_LO_0			(0x1u<<0)

// LUT428L Configuration

#define	GFXMMU_LUT428L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT428L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT428L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT428L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT428L_EN			(0x1u<<0)

#define	GFXMMU_LUT428L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT428L_EN_B_0X1		(0x1u<<0)

// LUT428H Configuration

#define	GFXMMU_LUT428H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT428H_LO_0			(0x1u<<0)

// LUT429L Configuration

#define	GFXMMU_LUT429L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT429L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT429L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT429L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT429L_EN			(0x1u<<0)

#define	GFXMMU_LUT429L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT429L_EN_B_0X1		(0x1u<<0)

// LUT429H Configuration

#define	GFXMMU_LUT429H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT429H_LO_0			(0x1u<<0)

// LUT430L Configuration

#define	GFXMMU_LUT430L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT430L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT430L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT430L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT430L_EN			(0x1u<<0)

#define	GFXMMU_LUT430L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT430L_EN_B_0X1		(0x1u<<0)

// LUT430H Configuration

#define	GFXMMU_LUT430H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT430H_LO_0			(0x1u<<0)

// LUT431L Configuration

#define	GFXMMU_LUT431L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT431L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT431L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT431L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT431L_EN			(0x1u<<0)

#define	GFXMMU_LUT431L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT431L_EN_B_0X1		(0x1u<<0)

// LUT431H Configuration

#define	GFXMMU_LUT431H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT431H_LO_0			(0x1u<<0)

// LUT432L Configuration

#define	GFXMMU_LUT432L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT432L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT432L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT432L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT432L_EN			(0x1u<<0)

#define	GFXMMU_LUT432L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT432L_EN_B_0X1		(0x1u<<0)

// LUT432H Configuration

#define	GFXMMU_LUT432H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT432H_LO_0			(0x1u<<0)

// LUT433L Configuration

#define	GFXMMU_LUT433L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT433L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT433L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT433L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT433L_EN			(0x1u<<0)

#define	GFXMMU_LUT433L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT433L_EN_B_0X1		(0x1u<<0)

// LUT433H Configuration

#define	GFXMMU_LUT433H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT433H_LO_0			(0x1u<<0)

// LUT434L Configuration

#define	GFXMMU_LUT434L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT434L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT434L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT434L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT434L_EN			(0x1u<<0)

#define	GFXMMU_LUT434L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT434L_EN_B_0X1		(0x1u<<0)

// LUT434H Configuration

#define	GFXMMU_LUT434H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT434H_LO_0			(0x1u<<0)

// LUT435L Configuration

#define	GFXMMU_LUT435L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT435L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT435L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT435L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT435L_EN			(0x1u<<0)

#define	GFXMMU_LUT435L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT435L_EN_B_0X1		(0x1u<<0)

// LUT435H Configuration

#define	GFXMMU_LUT435H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT435H_LO_0			(0x1u<<0)

// LUT436L Configuration

#define	GFXMMU_LUT436L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT436L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT436L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT436L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT436L_EN			(0x1u<<0)

#define	GFXMMU_LUT436L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT436L_EN_B_0X1		(0x1u<<0)

// LUT436H Configuration

#define	GFXMMU_LUT436H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT436H_LO_0			(0x1u<<0)

// LUT437L Configuration

#define	GFXMMU_LUT437L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT437L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT437L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT437L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT437L_EN			(0x1u<<0)

#define	GFXMMU_LUT437L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT437L_EN_B_0X1		(0x1u<<0)

// LUT437H Configuration

#define	GFXMMU_LUT437H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT437H_LO_0			(0x1u<<0)

// LUT438L Configuration

#define	GFXMMU_LUT438L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT438L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT438L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT438L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT438L_EN			(0x1u<<0)

#define	GFXMMU_LUT438L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT438L_EN_B_0X1		(0x1u<<0)

// LUT438H Configuration

#define	GFXMMU_LUT438H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT438H_LO_0			(0x1u<<0)

// LUT439L Configuration

#define	GFXMMU_LUT439L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT439L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT439L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT439L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT439L_EN			(0x1u<<0)

#define	GFXMMU_LUT439L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT439L_EN_B_0X1		(0x1u<<0)

// LUT439H Configuration

#define	GFXMMU_LUT439H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT439H_LO_0			(0x1u<<0)

// LUT440L Configuration

#define	GFXMMU_LUT440L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT440L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT440L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT440L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT440L_EN			(0x1u<<0)

#define	GFXMMU_LUT440L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT440L_EN_B_0X1		(0x1u<<0)

// LUT440H Configuration

#define	GFXMMU_LUT440H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT440H_LO_0			(0x1u<<0)

// LUT441L Configuration

#define	GFXMMU_LUT441L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT441L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT441L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT441L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT441L_EN			(0x1u<<0)

#define	GFXMMU_LUT441L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT441L_EN_B_0X1		(0x1u<<0)

// LUT441H Configuration

