hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT441H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT441H_LO_0			(0x1u<<0)

// LUT442L Configuration

#define	GFXMMU_LUT442L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT442L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT442L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT442L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT442L_EN			(0x1u<<0)

#define	GFXMMU_LUT442L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT442L_EN_B_0X1		(0x1u<<0)

// LUT442H Configuration

#define	GFXMMU_LUT442H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT442H_LO_0			(0x1u<<0)

// LUT443L Configuration

#define	GFXMMU_LUT443L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT443L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT443L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT443L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT443L_EN			(0x1u<<0)

#define	GFXMMU_LUT443L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT443L_EN_B_0X1		(0x1u<<0)

// LUT443H Configuration

#define	GFXMMU_LUT443H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT443H_LO_0			(0x1u<<0)

// LUT444L Configuration

#define	GFXMMU_LUT444L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT444L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT444L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT444L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT444L_EN			(0x1u<<0)

#define	GFXMMU_LUT444L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT444L_EN_B_0X1		(0x1u<<0)

// LUT444H Configuration

#define	GFXMMU_LUT444H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT444H_LO_0			(0x1u<<0)

// LUT445L Configuration

#define	GFXMMU_LUT445L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT445L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT445L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT445L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT445L_EN			(0x1u<<0)

#define	GFXMMU_LUT445L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT445L_EN_B_0X1		(0x1u<<0)

// LUT445H Configuration

#define	GFXMMU_LUT445H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT445H_LO_0			(0x1u<<0)

// LUT446L Configuration

#define	GFXMMU_LUT446L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT446L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT446L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT446L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT446L_EN			(0x1u<<0)

#define	GFXMMU_LUT446L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT446L_EN_B_0X1		(0x1u<<0)

// LUT446H Configuration

#define	GFXMMU_LUT446H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT446H_LO_0			(0x1u<<0)

// LUT447L Configuration

#define	GFXMMU_LUT447L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT447L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT447L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT447L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT447L_EN			(0x1u<<0)

#define	GFXMMU_LUT447L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT447L_EN_B_0X1		(0x1u<<0)

// LUT447H Configuration

#define	GFXMMU_LUT447H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT447H_LO_0			(0x1u<<0)

// LUT448L Configuration

#define	GFXMMU_LUT448L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT448L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT448L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT448L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT448L_EN			(0x1u<<0)

#define	GFXMMU_LUT448L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT448L_EN_B_0X1		(0x1u<<0)

// LUT448H Configuration

#define	GFXMMU_LUT448H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT448H_LO_0			(0x1u<<0)

// LUT449L Configuration

#define	GFXMMU_LUT449L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT449L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT449L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT449L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT449L_EN			(0x1u<<0)

#define	GFXMMU_LUT449L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT449L_EN_B_0X1		(0x1u<<0)

// LUT449H Configuration

#define	GFXMMU_LUT449H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT449H_LO_0			(0x1u<<0)

// LUT450L Configuration

#define	GFXMMU_LUT450L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT450L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT450L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT450L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT450L_EN			(0x1u<<0)

#define	GFXMMU_LUT450L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT450L_EN_B_0X1		(0x1u<<0)

// LUT450H Configuration

#define	GFXMMU_LUT450H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT450H_LO_0			(0x1u<<0)

// LUT451L Configuration

#define	GFXMMU_LUT451L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT451L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT451L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT451L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT451L_EN			(0x1u<<0)

#define	GFXMMU_LUT451L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT451L_EN_B_0X1		(0x1u<<0)

// LUT451H Configuration

#define	GFXMMU_LUT451H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT451H_LO_0			(0x1u<<0)

// LUT452L Configuration

#define	GFXMMU_LUT452L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT452L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT452L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT452L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT452L_EN			(0x1u<<0)

#define	GFXMMU_LUT452L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT452L_EN_B_0X1		(0x1u<<0)

// LUT452H Configuration

#define	GFXMMU_LUT452H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT452H_LO_0			(0x1u<<0)

// LUT453L Configuration

#define	GFXMMU_LUT453L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT453L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT453L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT453L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT453L_EN			(0x1u<<0)

#define	GFXMMU_LUT453L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT453L_EN_B_0X1		(0x1u<<0)

// LUT453H Configuration

#define	GFXMMU_LUT453H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT453H_LO_0			(0x1u<<0)

// LUT454L Configuration

#define	GFXMMU_LUT454L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT454L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT454L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT454L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT454L_EN			(0x1u<<0)

#define	GFXMMU_LUT454L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT454L_EN_B_0X1		(0x1u<<0)

// LUT454H Configuration

#define	GFXMMU_LUT454H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT454H_LO_0			(0x1u<<0)

// LUT455L Configuration

#define	GFXMMU_LUT455L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT455L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT455L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT455L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT455L_EN			(0x1u<<0)

#define	GFXMMU_LUT455L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT455L_EN_B_0X1		(0x1u<<0)

// LUT455H Configuration

#define	GFXMMU_LUT455H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT455H_LO_0			(0x1u<<0)

// LUT456L Configuration

#define	GFXMMU_LUT456L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT456L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT456L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT456L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT456L_EN			(0x1u<<0)

#define	GFXMMU_LUT456L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT456L_EN_B_0X1		(0x1u<<0)

