hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT471L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT471L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT471L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT471L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT471L_EN			(0x1u<<0)

#define	GFXMMU_LUT471L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT471L_EN_B_0X1		(0x1u<<0)

// LUT471H Configuration

#define	GFXMMU_LUT471H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT471H_LO_0			(0x1u<<0)

// LUT472L Configuration

#define	GFXMMU_LUT472L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT472L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT472L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT472L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT472L_EN			(0x1u<<0)

#define	GFXMMU_LUT472L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT472L_EN_B_0X1		(0x1u<<0)

// LUT472H Configuration

#define	GFXMMU_LUT472H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT472H_LO_0			(0x1u<<0)

// LUT473L Configuration

#define	GFXMMU_LUT473L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT473L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT473L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT473L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT473L_EN			(0x1u<<0)

#define	GFXMMU_LUT473L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT473L_EN_B_0X1		(0x1u<<0)

// LUT473H Configuration

#define	GFXMMU_LUT473H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT473H_LO_0			(0x1u<<0)

// LUT474L Configuration

#define	GFXMMU_LUT474L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT474L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT474L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT474L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT474L_EN			(0x1u<<0)

#define	GFXMMU_LUT474L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT474L_EN_B_0X1		(0x1u<<0)

// LUT474H Configuration

#define	GFXMMU_LUT474H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT474H_LO_0			(0x1u<<0)

// LUT475L Configuration

#define	GFXMMU_LUT475L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT475L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT475L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT475L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT475L_EN			(0x1u<<0)

#define	GFXMMU_LUT475L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT475L_EN_B_0X1		(0x1u<<0)

// LUT475H Configuration

#define	GFXMMU_LUT475H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT475H_LO_0			(0x1u<<0)

// LUT476L Configuration

#define	GFXMMU_LUT476L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT476L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT476L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT476L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT476L_EN			(0x1u<<0)

#define	GFXMMU_LUT476L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT476L_EN_B_0X1		(0x1u<<0)

// LUT476H Configuration

#define	GFXMMU_LUT476H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT476H_LO_0			(0x1u<<0)

// LUT477L Configuration

#define	GFXMMU_LUT477L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT477L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT477L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT477L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT477L_EN			(0x1u<<0)

#define	GFXMMU_LUT477L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT477L_EN_B_0X1		(0x1u<<0)

// LUT477H Configuration

#define	GFXMMU_LUT477H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT477H_LO_0			(0x1u<<0)

// LUT478L Configuration

#define	GFXMMU_LUT478L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT478L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT478L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT478L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT478L_EN			(0x1u<<0)

#define	GFXMMU_LUT478L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT478L_EN_B_0X1		(0x1u<<0)

// LUT478H Configuration

#define	GFXMMU_LUT478H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT478H_LO_0			(0x1u<<0)

// LUT479L Configuration

#define	GFXMMU_LUT479L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT479L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT479L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT479L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT479L_EN			(0x1u<<0)

#define	GFXMMU_LUT479L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT479L_EN_B_0X1		(0x1u<<0)

// LUT479H Configuration

#define	GFXMMU_LUT479H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT479H_LO_0			(0x1u<<0)

// LUT480L Configuration

#define	GFXMMU_LUT480L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT480L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT480L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT480L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT480L_EN			(0x1u<<0)

#define	GFXMMU_LUT480L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT480L_EN_B_0X1		(0x1u<<0)

// LUT480H Configuration

#define	GFXMMU_LUT480H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT480H_LO_0			(0x1u<<0)

// LUT481L Configuration

#define	GFXMMU_LUT481L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT481L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT481L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT481L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT481L_EN			(0x1u<<0)

#define	GFXMMU_LUT481L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT481L_EN_B_0X1		(0x1u<<0)

// LUT481H Configuration

#define	GFXMMU_LUT481H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT481H_LO_0			(0x1u<<0)

// LUT482L Configuration

#define	GFXMMU_LUT482L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT482L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT482L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT482L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT482L_EN			(0x1u<<0)

#define	GFXMMU_LUT482L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT482L_EN_B_0X1		(0x1u<<0)

// LUT482H Configuration

#define	GFXMMU_LUT482H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT482H_LO_0			(0x1u<<0)

// LUT483L Configuration

#define	GFXMMU_LUT483L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT483L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT483L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT483L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT483L_EN			(0x1u<<0)

#define	GFXMMU_LUT483L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT483L_EN_B_0X1		(0x1u<<0)

// LUT483H Configuration

#define	GFXMMU_LUT483H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT483H_LO_0			(0x1u<<0)

// LUT484L Configuration

#define	GFXMMU_LUT484L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT484L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT484L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT484L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT484L_EN			(0x1u<<0)

#define	GFXMMU_LUT484L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT484L_EN_B_0X1		(0x1u<<0)

// LUT484H Configuration

#define	GFXMMU_LUT484H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT484H_LO_0			(0x1u<<0)

// LUT485L Configuration

#define	GFXMMU_LUT485L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT485L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT485L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT485L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT485L_EN			(0x1u<<0)

