hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT501L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT501L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT501L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT501L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT501L_EN			(0x1u<<0)

#define	GFXMMU_LUT501L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT501L_EN_B_0X1		(0x1u<<0)

// LUT501H Configuration

#define	GFXMMU_LUT501H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT501H_LO_0			(0x1u<<0)

// LUT502L Configuration

#define	GFXMMU_LUT502L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT502L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT502L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT502L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT502L_EN			(0x1u<<0)

#define	GFXMMU_LUT502L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT502L_EN_B_0X1		(0x1u<<0)

// LUT502H Configuration

#define	GFXMMU_LUT502H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT502H_LO_0			(0x1u<<0)

// LUT503L Configuration

#define	GFXMMU_LUT503L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT503L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT503L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT503L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT503L_EN			(0x1u<<0)

#define	GFXMMU_LUT503L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT503L_EN_B_0X1		(0x1u<<0)

// LUT503H Configuration

#define	GFXMMU_LUT503H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT503H_LO_0			(0x1u<<0)

// LUT504L Configuration

#define	GFXMMU_LUT504L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT504L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT504L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT504L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT504L_EN			(0x1u<<0)

#define	GFXMMU_LUT504L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT504L_EN_B_0X1		(0x1u<<0)

// LUT504H Configuration

#define	GFXMMU_LUT504H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT504H_LO_0			(0x1u<<0)

// LUT505L Configuration

#define	GFXMMU_LUT505L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT505L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT505L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT505L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT505L_EN			(0x1u<<0)

#define	GFXMMU_LUT505L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT505L_EN_B_0X1		(0x1u<<0)

// LUT505H Configuration

#define	GFXMMU_LUT505H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT505H_LO_0			(0x1u<<0)

// LUT506L Configuration

#define	GFXMMU_LUT506L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT506L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT506L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT506L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT506L_EN			(0x1u<<0)

#define	GFXMMU_LUT506L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT506L_EN_B_0X1		(0x1u<<0)

// LUT506H Configuration

#define	GFXMMU_LUT506H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT506H_LO_0			(0x1u<<0)

// LUT507L Configuration

#define	GFXMMU_LUT507L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT507L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT507L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT507L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT507L_EN			(0x1u<<0)

#define	GFXMMU_LUT507L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT507L_EN_B_0X1		(0x1u<<0)

// LUT507H Configuration

#define	GFXMMU_LUT507H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT507H_LO_0			(0x1u<<0)

// LUT508L Configuration

#define	GFXMMU_LUT508L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT508L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT508L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT508L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT508L_EN			(0x1u<<0)

#define	GFXMMU_LUT508L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT508L_EN_B_0X1		(0x1u<<0)

// LUT508H Configuration

#define	GFXMMU_LUT508H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT508H_LO_0			(0x1u<<0)

// LUT509L Configuration

#define	GFXMMU_LUT509L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT509L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT509L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT509L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT509L_EN			(0x1u<<0)

#define	GFXMMU_LUT509L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT509L_EN_B_0X1		(0x1u<<0)

// LUT509H Configuration

#define	GFXMMU_LUT509H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT509H_LO_0			(0x1u<<0)

// LUT510L Configuration

#define	GFXMMU_LUT510L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT510L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT510L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT510L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT510L_EN			(0x1u<<0)

#define	GFXMMU_LUT510L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT510L_EN_B_0X1		(0x1u<<0)

// LUT510H Configuration

#define	GFXMMU_LUT510H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT510H_LO_0			(0x1u<<0)

// LUT511L Configuration

#define	GFXMMU_LUT511L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT511L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT511L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT511L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT511L_EN			(0x1u<<0)

#define	GFXMMU_LUT511L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT511L_EN_B_0X1		(0x1u<<0)

// LUT511H Configuration

#define	GFXMMU_LUT511H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT511H_LO_0			(0x1u<<0)

// LUT512L Configuration

#define	GFXMMU_LUT512L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT512L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT512L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT512L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT512L_EN			(0x1u<<0)

#define	GFXMMU_LUT512L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT512L_EN_B_0X1		(0x1u<<0)

// LUT512H Configuration

#define	GFXMMU_LUT512H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT512H_LO_0			(0x1u<<0)

// LUT513L Configuration

#define	GFXMMU_LUT513L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT513L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT513L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT513L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT513L_EN			(0x1u<<0)

#define	GFXMMU_LUT513L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT513L_EN_B_0X1		(0x1u<<0)

// LUT513H Configuration

#define	GFXMMU_LUT513H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT513H_LO_0			(0x1u<<0)

// LUT514L Configuration

#define	GFXMMU_LUT514L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT514L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT514L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT514L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT514L_EN			(0x1u<<0)

#define	GFXMMU_LUT514L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT514L_EN_B_0X1		(0x1u<<0)

// LUT514H Configuration

#define	GFXMMU_LUT514H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT514H_LO_0			(0x1u<<0)

// LUT515L Configuration

#define	GFXMMU_LUT515L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT515L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT515L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT515L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT515L_EN			(0x1u<<0)

#define	GFXMMU_LUT515L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT515L_EN_B_0X1		(0x1u<<0)

