hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT545H Configuration

#define	GFXMMU_LUT545H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT545H_LO_0			(0x1u<<0)

// LUT546L Configuration

#define	GFXMMU_LUT546L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT546L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT546L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT546L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT546L_EN			(0x1u<<0)

#define	GFXMMU_LUT546L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT546L_EN_B_0X1		(0x1u<<0)

// LUT546H Configuration

#define	GFXMMU_LUT546H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT546H_LO_0			(0x1u<<0)

// LUT547L Configuration

#define	GFXMMU_LUT547L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT547L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT547L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT547L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT547L_EN			(0x1u<<0)

#define	GFXMMU_LUT547L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT547L_EN_B_0X1		(0x1u<<0)

// LUT547H Configuration

#define	GFXMMU_LUT547H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT547H_LO_0			(0x1u<<0)

// LUT548L Configuration

#define	GFXMMU_LUT548L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT548L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT548L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT548L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT548L_EN			(0x1u<<0)

#define	GFXMMU_LUT548L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT548L_EN_B_0X1		(0x1u<<0)

// LUT548H Configuration

#define	GFXMMU_LUT548H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT548H_LO_0			(0x1u<<0)

// LUT549L Configuration

#define	GFXMMU_LUT549L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT549L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT549L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT549L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT549L_EN			(0x1u<<0)

#define	GFXMMU_LUT549L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT549L_EN_B_0X1		(0x1u<<0)

// LUT549H Configuration

#define	GFXMMU_LUT549H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT549H_LO_0			(0x1u<<0)

// LUT550L Configuration

#define	GFXMMU_LUT550L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT550L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT550L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT550L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT550L_EN			(0x1u<<0)

#define	GFXMMU_LUT550L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT550L_EN_B_0X1		(0x1u<<0)

// LUT550H Configuration

#define	GFXMMU_LUT550H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT550H_LO_0			(0x1u<<0)

// LUT551L Configuration

#define	GFXMMU_LUT551L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT551L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT551L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT551L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT551L_EN			(0x1u<<0)

#define	GFXMMU_LUT551L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT551L_EN_B_0X1		(0x1u<<0)

// LUT551H Configuration

#define	GFXMMU_LUT551H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT551H_LO_0			(0x1u<<0)

// LUT552L Configuration

#define	GFXMMU_LUT552L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT552L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT552L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT552L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT552L_EN			(0x1u<<0)

#define	GFXMMU_LUT552L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT552L_EN_B_0X1		(0x1u<<0)

// LUT552H Configuration

#define	GFXMMU_LUT552H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT552H_LO_0			(0x1u<<0)

// LUT553L Configuration

#define	GFXMMU_LUT553L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT553L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT553L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT553L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT553L_EN			(0x1u<<0)

#define	GFXMMU_LUT553L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT553L_EN_B_0X1		(0x1u<<0)

// LUT553H Configuration

#define	GFXMMU_LUT553H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT553H_LO_0			(0x1u<<0)

// LUT554L Configuration

#define	GFXMMU_LUT554L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT554L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT554L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT554L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT554L_EN			(0x1u<<0)

#define	GFXMMU_LUT554L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT554L_EN_B_0X1		(0x1u<<0)

// LUT554H Configuration

#define	GFXMMU_LUT554H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT554H_LO_0			(0x1u<<0)

// LUT555L Configuration

#define	GFXMMU_LUT555L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT555L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT555L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT555L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT555L_EN			(0x1u<<0)

#define	GFXMMU_LUT555L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT555L_EN_B_0X1		(0x1u<<0)

// LUT555H Configuration

#define	GFXMMU_LUT555H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT555H_LO_0			(0x1u<<0)

// LUT556L Configuration

#define	GFXMMU_LUT556L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT556L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT556L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT556L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT556L_EN			(0x1u<<0)

#define	GFXMMU_LUT556L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT556L_EN_B_0X1		(0x1u<<0)

// LUT556H Configuration

#define	GFXMMU_LUT556H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT556H_LO_0			(0x1u<<0)

// LUT557L Configuration

#define	GFXMMU_LUT557L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT557L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT557L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT557L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT557L_EN			(0x1u<<0)

#define	GFXMMU_LUT557L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT557L_EN_B_0X1		(0x1u<<0)

// LUT557H Configuration

#define	GFXMMU_LUT557H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT557H_LO_0			(0x1u<<0)

// LUT558L Configuration

#define	GFXMMU_LUT558L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT558L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT558L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT558L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT558L_EN			(0x1u<<0)

#define	GFXMMU_LUT558L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT558L_EN_B_0X1		(0x1u<<0)

// LUT558H Configuration

#define	GFXMMU_LUT558H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT558H_LO_0			(0x1u<<0)

// LUT559L Configuration

#define	GFXMMU_LUT559L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT559L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT559L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT559L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT559L_EN			(0x1u<<0)

#define	GFXMMU_LUT559L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT559L_EN_B_0X1		(0x1u<<0)

// LUT559H Configuration

#define	GFXMMU_LUT559H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT559H_LO_0			(0x1u<<0)

// LUT560L Configuration

