hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT560L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT560L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT560L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT560L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT560L_EN			(0x1u<<0)

#define	GFXMMU_LUT560L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT560L_EN_B_0X1		(0x1u<<0)

// LUT560H Configuration

#define	GFXMMU_LUT560H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT560H_LO_0			(0x1u<<0)

// LUT561L Configuration

#define	GFXMMU_LUT561L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT561L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT561L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT561L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT561L_EN			(0x1u<<0)

#define	GFXMMU_LUT561L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT561L_EN_B_0X1		(0x1u<<0)

// LUT561H Configuration

#define	GFXMMU_LUT561H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT561H_LO_0			(0x1u<<0)

// LUT562L Configuration

#define	GFXMMU_LUT562L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT562L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT562L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT562L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT562L_EN			(0x1u<<0)

#define	GFXMMU_LUT562L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT562L_EN_B_0X1		(0x1u<<0)

// LUT562H Configuration

#define	GFXMMU_LUT562H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT562H_LO_0			(0x1u<<0)

// LUT563L Configuration

#define	GFXMMU_LUT563L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT563L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT563L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT563L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT563L_EN			(0x1u<<0)

#define	GFXMMU_LUT563L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT563L_EN_B_0X1		(0x1u<<0)

// LUT563H Configuration

#define	GFXMMU_LUT563H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT563H_LO_0			(0x1u<<0)

// LUT564L Configuration

#define	GFXMMU_LUT564L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT564L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT564L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT564L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT564L_EN			(0x1u<<0)

#define	GFXMMU_LUT564L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT564L_EN_B_0X1		(0x1u<<0)

// LUT564H Configuration

#define	GFXMMU_LUT564H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT564H_LO_0			(0x1u<<0)

// LUT565L Configuration

#define	GFXMMU_LUT565L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT565L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT565L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT565L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT565L_EN			(0x1u<<0)

#define	GFXMMU_LUT565L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT565L_EN_B_0X1		(0x1u<<0)

// LUT565H Configuration

#define	GFXMMU_LUT565H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT565H_LO_0			(0x1u<<0)

// LUT566L Configuration

#define	GFXMMU_LUT566L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT566L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT566L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT566L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT566L_EN			(0x1u<<0)

#define	GFXMMU_LUT566L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT566L_EN_B_0X1		(0x1u<<0)

// LUT566H Configuration

#define	GFXMMU_LUT566H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT566H_LO_0			(0x1u<<0)

// LUT567L Configuration

#define	GFXMMU_LUT567L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT567L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT567L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT567L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT567L_EN			(0x1u<<0)

#define	GFXMMU_LUT567L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT567L_EN_B_0X1		(0x1u<<0)

// LUT567H Configuration

#define	GFXMMU_LUT567H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT567H_LO_0			(0x1u<<0)

// LUT568L Configuration

#define	GFXMMU_LUT568L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT568L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT568L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT568L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT568L_EN			(0x1u<<0)

#define	GFXMMU_LUT568L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT568L_EN_B_0X1		(0x1u<<0)

// LUT568H Configuration

#define	GFXMMU_LUT568H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT568H_LO_0			(0x1u<<0)

// LUT569L Configuration

#define	GFXMMU_LUT569L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT569L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT569L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT569L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT569L_EN			(0x1u<<0)

#define	GFXMMU_LUT569L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT569L_EN_B_0X1		(0x1u<<0)

// LUT569H Configuration

#define	GFXMMU_LUT569H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT569H_LO_0			(0x1u<<0)

// LUT570L Configuration

#define	GFXMMU_LUT570L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT570L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT570L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT570L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT570L_EN			(0x1u<<0)

#define	GFXMMU_LUT570L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT570L_EN_B_0X1		(0x1u<<0)

// LUT570H Configuration

#define	GFXMMU_LUT570H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT570H_LO_0			(0x1u<<0)

// LUT571L Configuration

#define	GFXMMU_LUT571L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT571L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT571L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT571L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT571L_EN			(0x1u<<0)

#define	GFXMMU_LUT571L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT571L_EN_B_0X1		(0x1u<<0)

// LUT571H Configuration

#define	GFXMMU_LUT571H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT571H_LO_0			(0x1u<<0)

// LUT572L Configuration

#define	GFXMMU_LUT572L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT572L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT572L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT572L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT572L_EN			(0x1u<<0)

#define	GFXMMU_LUT572L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT572L_EN_B_0X1		(0x1u<<0)

// LUT572H Configuration

#define	GFXMMU_LUT572H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT572H_LO_0			(0x1u<<0)

// LUT573L Configuration

#define	GFXMMU_LUT573L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT573L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT573L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT573L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT573L_EN			(0x1u<<0)

#define	GFXMMU_LUT573L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT573L_EN_B_0X1		(0x1u<<0)

// LUT573H Configuration

#define	GFXMMU_LUT573H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT573H_LO_0			(0x1u<<0)

// LUT574L Configuration

#define	GFXMMU_LUT574L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT574L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT574L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT574L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT574L_EN			(0x1u<<0)

#define	GFXMMU_LUT574L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT574L_EN_B_0X1		(0x1u<<0)

// LUT574H Configuration

#define	GFXMMU_LUT574H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT574H_LO_0			(0x1u<<0)

// LUT575L Configuration

#define	GFXMMU_LUT575L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT575L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT575L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT575L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT575L_EN			(0x1u<<0)

#define	GFXMMU_LUT575L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT575L_EN_B_0X1		(0x1u<<0)

