hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT606L Configuration

#define	GFXMMU_LUT606L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT606L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT606L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT606L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT606L_EN			(0x1u<<0)

#define	GFXMMU_LUT606L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT606L_EN_B_0X1		(0x1u<<0)

// LUT606H Configuration

#define	GFXMMU_LUT606H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT606H_LO_0			(0x1u<<0)

// LUT607L Configuration

#define	GFXMMU_LUT607L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT607L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT607L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT607L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT607L_EN			(0x1u<<0)

#define	GFXMMU_LUT607L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT607L_EN_B_0X1		(0x1u<<0)

// LUT607H Configuration

#define	GFXMMU_LUT607H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT607H_LO_0			(0x1u<<0)

// LUT608L Configuration

#define	GFXMMU_LUT608L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT608L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT608L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT608L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT608L_EN			(0x1u<<0)

#define	GFXMMU_LUT608L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT608L_EN_B_0X1		(0x1u<<0)

// LUT608H Configuration

#define	GFXMMU_LUT608H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT608H_LO_0			(0x1u<<0)

// LUT609L Configuration

#define	GFXMMU_LUT609L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT609L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT609L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT609L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT609L_EN			(0x1u<<0)

#define	GFXMMU_LUT609L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT609L_EN_B_0X1		(0x1u<<0)

// LUT609H Configuration

#define	GFXMMU_LUT609H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT609H_LO_0			(0x1u<<0)

// LUT610L Configuration

#define	GFXMMU_LUT610L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT610L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT610L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT610L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT610L_EN			(0x1u<<0)

#define	GFXMMU_LUT610L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT610L_EN_B_0X1		(0x1u<<0)

// LUT610H Configuration

#define	GFXMMU_LUT610H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT610H_LO_0			(0x1u<<0)

// LUT611L Configuration

#define	GFXMMU_LUT611L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT611L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT611L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT611L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT611L_EN			(0x1u<<0)

#define	GFXMMU_LUT611L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT611L_EN_B_0X1		(0x1u<<0)

// LUT611H Configuration

#define	GFXMMU_LUT611H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT611H_LO_0			(0x1u<<0)

// LUT612L Configuration

#define	GFXMMU_LUT612L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT612L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT612L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT612L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT612L_EN			(0x1u<<0)

#define	GFXMMU_LUT612L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT612L_EN_B_0X1		(0x1u<<0)

// LUT612H Configuration

#define	GFXMMU_LUT612H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT612H_LO_0			(0x1u<<0)

// LUT613L Configuration

#define	GFXMMU_LUT613L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT613L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT613L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT613L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT613L_EN			(0x1u<<0)

#define	GFXMMU_LUT613L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT613L_EN_B_0X1		(0x1u<<0)

// LUT613H Configuration

#define	GFXMMU_LUT613H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT613H_LO_0			(0x1u<<0)

// LUT614L Configuration

#define	GFXMMU_LUT614L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT614L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT614L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT614L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT614L_EN			(0x1u<<0)

#define	GFXMMU_LUT614L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT614L_EN_B_0X1		(0x1u<<0)

// LUT614H Configuration

#define	GFXMMU_LUT614H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT614H_LO_0			(0x1u<<0)

// LUT615L Configuration

#define	GFXMMU_LUT615L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT615L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT615L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT615L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT615L_EN			(0x1u<<0)

#define	GFXMMU_LUT615L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT615L_EN_B_0X1		(0x1u<<0)

// LUT615H Configuration

#define	GFXMMU_LUT615H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT615H_LO_0			(0x1u<<0)

// LUT616L Configuration

#define	GFXMMU_LUT616L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT616L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT616L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT616L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT616L_EN			(0x1u<<0)

#define	GFXMMU_LUT616L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT616L_EN_B_0X1		(0x1u<<0)

// LUT616H Configuration

#define	GFXMMU_LUT616H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT616H_LO_0			(0x1u<<0)

// LUT617L Configuration

#define	GFXMMU_LUT617L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT617L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT617L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT617L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT617L_EN			(0x1u<<0)

#define	GFXMMU_LUT617L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT617L_EN_B_0X1		(0x1u<<0)

// LUT617H Configuration

#define	GFXMMU_LUT617H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT617H_LO_0			(0x1u<<0)

// LUT618L Configuration

#define	GFXMMU_LUT618L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT618L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT618L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT618L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT618L_EN			(0x1u<<0)

#define	GFXMMU_LUT618L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT618L_EN_B_0X1		(0x1u<<0)

// LUT618H Configuration

#define	GFXMMU_LUT618H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT618H_LO_0			(0x1u<<0)

// LUT619L Configuration

#define	GFXMMU_LUT619L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT619L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT619L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT619L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT619L_EN			(0x1u<<0)

#define	GFXMMU_LUT619L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT619L_EN_B_0X1		(0x1u<<0)

// LUT619H Configuration

#define	GFXMMU_LUT619H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT619H_LO_0			(0x1u<<0)

// LUT620L Configuration

#define	GFXMMU_LUT620L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT620L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT620L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT620L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT620L_EN			(0x1u<<0)

