hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT634H Configuration

#define	GFXMMU_LUT634H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT634H_LO_0			(0x1u<<0)

// LUT635L Configuration

#define	GFXMMU_LUT635L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT635L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT635L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT635L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT635L_EN			(0x1u<<0)

#define	GFXMMU_LUT635L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT635L_EN_B_0X1		(0x1u<<0)

// LUT635H Configuration

#define	GFXMMU_LUT635H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT635H_LO_0			(0x1u<<0)

// LUT636L Configuration

#define	GFXMMU_LUT636L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT636L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT636L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT636L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT636L_EN			(0x1u<<0)

#define	GFXMMU_LUT636L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT636L_EN_B_0X1		(0x1u<<0)

// LUT636H Configuration

#define	GFXMMU_LUT636H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT636H_LO_0			(0x1u<<0)

// LUT637L Configuration

#define	GFXMMU_LUT637L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT637L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT637L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT637L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT637L_EN			(0x1u<<0)

#define	GFXMMU_LUT637L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT637L_EN_B_0X1		(0x1u<<0)

// LUT637H Configuration

#define	GFXMMU_LUT637H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT637H_LO_0			(0x1u<<0)

// LUT638L Configuration

#define	GFXMMU_LUT638L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT638L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT638L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT638L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT638L_EN			(0x1u<<0)

#define	GFXMMU_LUT638L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT638L_EN_B_0X1		(0x1u<<0)

// LUT638H Configuration

#define	GFXMMU_LUT638H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT638H_LO_0			(0x1u<<0)

// LUT639L Configuration

#define	GFXMMU_LUT639L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT639L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT639L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT639L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT639L_EN			(0x1u<<0)

#define	GFXMMU_LUT639L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT639L_EN_B_0X1		(0x1u<<0)

// LUT639H Configuration

#define	GFXMMU_LUT639H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT639H_LO_0			(0x1u<<0)

// LUT640L Configuration

#define	GFXMMU_LUT640L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT640L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT640L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT640L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT640L_EN			(0x1u<<0)

#define	GFXMMU_LUT640L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT640L_EN_B_0X1		(0x1u<<0)

// LUT640H Configuration

#define	GFXMMU_LUT640H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT640H_LO_0			(0x1u<<0)

// LUT641L Configuration

#define	GFXMMU_LUT641L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT641L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT641L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT641L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT641L_EN			(0x1u<<0)

#define	GFXMMU_LUT641L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT641L_EN_B_0X1		(0x1u<<0)

// LUT641H Configuration

#define	GFXMMU_LUT641H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT641H_LO_0			(0x1u<<0)

// LUT642L Configuration

#define	GFXMMU_LUT642L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT642L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT642L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT642L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT642L_EN			(0x1u<<0)

#define	GFXMMU_LUT642L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT642L_EN_B_0X1		(0x1u<<0)

// LUT642H Configuration

#define	GFXMMU_LUT642H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT642H_LO_0			(0x1u<<0)

// LUT643L Configuration

#define	GFXMMU_LUT643L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT643L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT643L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT643L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT643L_EN			(0x1u<<0)

#define	GFXMMU_LUT643L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT643L_EN_B_0X1		(0x1u<<0)

// LUT643H Configuration

#define	GFXMMU_LUT643H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT643H_LO_0			(0x1u<<0)

// LUT644L Configuration

#define	GFXMMU_LUT644L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT644L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT644L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT644L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT644L_EN			(0x1u<<0)

#define	GFXMMU_LUT644L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT644L_EN_B_0X1		(0x1u<<0)

// LUT644H Configuration

#define	GFXMMU_LUT644H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT644H_LO_0			(0x1u<<0)

// LUT645L Configuration

#define	GFXMMU_LUT645L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT645L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT645L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT645L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT645L_EN			(0x1u<<0)

#define	GFXMMU_LUT645L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT645L_EN_B_0X1		(0x1u<<0)

// LUT645H Configuration

#define	GFXMMU_LUT645H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT645H_LO_0			(0x1u<<0)

// LUT646L Configuration

#define	GFXMMU_LUT646L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT646L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT646L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT646L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT646L_EN			(0x1u<<0)

#define	GFXMMU_LUT646L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT646L_EN_B_0X1		(0x1u<<0)

// LUT646H Configuration

#define	GFXMMU_LUT646H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT646H_LO_0			(0x1u<<0)

// LUT647L Configuration

#define	GFXMMU_LUT647L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT647L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT647L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT647L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT647L_EN			(0x1u<<0)

#define	GFXMMU_LUT647L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT647L_EN_B_0X1		(0x1u<<0)

// LUT647H Configuration

#define	GFXMMU_LUT647H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT647H_LO_0			(0x1u<<0)

// LUT648L Configuration

#define	GFXMMU_LUT648L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT648L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT648L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT648L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT648L_EN			(0x1u<<0)

#define	GFXMMU_LUT648L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT648L_EN_B_0X1		(0x1u<<0)

// LUT648H Configuration

#define	GFXMMU_LUT648H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT648H_LO_0			(0x1u<<0)

// LUT649L Configuration

#define	GFXMMU_LUT649L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT649L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT649L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT649L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT649L_EN			(0x1u<<0)

#define	GFXMMU_LUT649L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT649L_EN_B_0X1		(0x1u<<0)

// LUT649H Configuration

#define	GFXMMU_LUT649H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT649H_LO_0			(0x1u<<0)

