hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT650L Configuration

#define	GFXMMU_LUT650L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT650L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT650L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT650L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT650L_EN			(0x1u<<0)

#define	GFXMMU_LUT650L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT650L_EN_B_0X1		(0x1u<<0)

// LUT650H Configuration

#define	GFXMMU_LUT650H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT650H_LO_0			(0x1u<<0)

// LUT651L Configuration

#define	GFXMMU_LUT651L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT651L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT651L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT651L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT651L_EN			(0x1u<<0)

#define	GFXMMU_LUT651L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT651L_EN_B_0X1		(0x1u<<0)

// LUT651H Configuration

#define	GFXMMU_LUT651H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT651H_LO_0			(0x1u<<0)

// LUT652L Configuration

#define	GFXMMU_LUT652L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT652L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT652L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT652L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT652L_EN			(0x1u<<0)

#define	GFXMMU_LUT652L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT652L_EN_B_0X1		(0x1u<<0)

// LUT652H Configuration

#define	GFXMMU_LUT652H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT652H_LO_0			(0x1u<<0)

// LUT653L Configuration

#define	GFXMMU_LUT653L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT653L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT653L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT653L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT653L_EN			(0x1u<<0)

#define	GFXMMU_LUT653L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT653L_EN_B_0X1		(0x1u<<0)

// LUT653H Configuration

#define	GFXMMU_LUT653H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT653H_LO_0			(0x1u<<0)

// LUT654L Configuration

#define	GFXMMU_LUT654L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT654L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT654L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT654L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT654L_EN			(0x1u<<0)

#define	GFXMMU_LUT654L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT654L_EN_B_0X1		(0x1u<<0)

// LUT654H Configuration

#define	GFXMMU_LUT654H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT654H_LO_0			(0x1u<<0)

// LUT655L Configuration

#define	GFXMMU_LUT655L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT655L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT655L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT655L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT655L_EN			(0x1u<<0)

#define	GFXMMU_LUT655L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT655L_EN_B_0X1		(0x1u<<0)

// LUT655H Configuration

#define	GFXMMU_LUT655H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT655H_LO_0			(0x1u<<0)

// LUT656L Configuration

#define	GFXMMU_LUT656L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT656L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT656L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT656L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT656L_EN			(0x1u<<0)

#define	GFXMMU_LUT656L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT656L_EN_B_0X1		(0x1u<<0)

// LUT656H Configuration

#define	GFXMMU_LUT656H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT656H_LO_0			(0x1u<<0)

// LUT657L Configuration

#define	GFXMMU_LUT657L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT657L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT657L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT657L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT657L_EN			(0x1u<<0)

#define	GFXMMU_LUT657L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT657L_EN_B_0X1		(0x1u<<0)

// LUT657H Configuration

#define	GFXMMU_LUT657H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT657H_LO_0			(0x1u<<0)

// LUT658L Configuration

#define	GFXMMU_LUT658L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT658L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT658L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT658L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT658L_EN			(0x1u<<0)

#define	GFXMMU_LUT658L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT658L_EN_B_0X1		(0x1u<<0)

// LUT658H Configuration

#define	GFXMMU_LUT658H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT658H_LO_0			(0x1u<<0)

// LUT659L Configuration

#define	GFXMMU_LUT659L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT659L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT659L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT659L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT659L_EN			(0x1u<<0)

#define	GFXMMU_LUT659L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT659L_EN_B_0X1		(0x1u<<0)

// LUT659H Configuration

#define	GFXMMU_LUT659H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT659H_LO_0			(0x1u<<0)

// LUT660L Configuration

#define	GFXMMU_LUT660L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT660L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT660L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT660L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT660L_EN			(0x1u<<0)

#define	GFXMMU_LUT660L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT660L_EN_B_0X1		(0x1u<<0)

// LUT660H Configuration

#define	GFXMMU_LUT660H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT660H_LO_0			(0x1u<<0)

// LUT661L Configuration

#define	GFXMMU_LUT661L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT661L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT661L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT661L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT661L_EN			(0x1u<<0)

#define	GFXMMU_LUT661L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT661L_EN_B_0X1		(0x1u<<0)

// LUT661H Configuration

#define	GFXMMU_LUT661H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT661H_LO_0			(0x1u<<0)

// LUT662L Configuration

#define	GFXMMU_LUT662L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT662L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT662L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT662L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT662L_EN			(0x1u<<0)

#define	GFXMMU_LUT662L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT662L_EN_B_0X1		(0x1u<<0)

// LUT662H Configuration

#define	GFXMMU_LUT662H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT662H_LO_0			(0x1u<<0)

// LUT663L Configuration

#define	GFXMMU_LUT663L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT663L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT663L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT663L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT663L_EN			(0x1u<<0)

#define	GFXMMU_LUT663L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT663L_EN_B_0X1		(0x1u<<0)

// LUT663H Configuration

#define	GFXMMU_LUT663H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT663H_LO_0			(0x1u<<0)

// LUT664L Configuration

#define	GFXMMU_LUT664L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT664L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT664L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT664L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT664L_EN			(0x1u<<0)

#define	GFXMMU_LUT664L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT664L_EN_B_0X1		(0x1u<<0)

