hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT680L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT680L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT680L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT680L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT680L_EN			(0x1u<<0)

#define	GFXMMU_LUT680L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT680L_EN_B_0X1		(0x1u<<0)

// LUT680H Configuration

#define	GFXMMU_LUT680H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT680H_LO_0			(0x1u<<0)

// LUT681L Configuration

#define	GFXMMU_LUT681L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT681L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT681L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT681L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT681L_EN			(0x1u<<0)

#define	GFXMMU_LUT681L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT681L_EN_B_0X1		(0x1u<<0)

// LUT681H Configuration

#define	GFXMMU_LUT681H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT681H_LO_0			(0x1u<<0)

// LUT682L Configuration

#define	GFXMMU_LUT682L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT682L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT682L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT682L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT682L_EN			(0x1u<<0)

#define	GFXMMU_LUT682L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT682L_EN_B_0X1		(0x1u<<0)

// LUT682H Configuration

#define	GFXMMU_LUT682H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT682H_LO_0			(0x1u<<0)

// LUT683L Configuration

#define	GFXMMU_LUT683L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT683L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT683L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT683L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT683L_EN			(0x1u<<0)

#define	GFXMMU_LUT683L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT683L_EN_B_0X1		(0x1u<<0)

// LUT683H Configuration

#define	GFXMMU_LUT683H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT683H_LO_0			(0x1u<<0)

// LUT684L Configuration

#define	GFXMMU_LUT684L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT684L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT684L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT684L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT684L_EN			(0x1u<<0)

#define	GFXMMU_LUT684L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT684L_EN_B_0X1		(0x1u<<0)

// LUT684H Configuration

#define	GFXMMU_LUT684H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT684H_LO_0			(0x1u<<0)

// LUT685L Configuration

#define	GFXMMU_LUT685L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT685L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT685L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT685L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT685L_EN			(0x1u<<0)

#define	GFXMMU_LUT685L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT685L_EN_B_0X1		(0x1u<<0)

// LUT685H Configuration

#define	GFXMMU_LUT685H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT685H_LO_0			(0x1u<<0)

// LUT686L Configuration

#define	GFXMMU_LUT686L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT686L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT686L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT686L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT686L_EN			(0x1u<<0)

#define	GFXMMU_LUT686L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT686L_EN_B_0X1		(0x1u<<0)

// LUT686H Configuration

#define	GFXMMU_LUT686H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT686H_LO_0			(0x1u<<0)

// LUT687L Configuration

#define	GFXMMU_LUT687L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT687L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT687L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT687L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT687L_EN			(0x1u<<0)

#define	GFXMMU_LUT687L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT687L_EN_B_0X1		(0x1u<<0)

// LUT687H Configuration

#define	GFXMMU_LUT687H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT687H_LO_0			(0x1u<<0)

// LUT688L Configuration

#define	GFXMMU_LUT688L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT688L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT688L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT688L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT688L_EN			(0x1u<<0)

#define	GFXMMU_LUT688L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT688L_EN_B_0X1		(0x1u<<0)

// LUT688H Configuration

#define	GFXMMU_LUT688H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT688H_LO_0			(0x1u<<0)

// LUT689L Configuration

#define	GFXMMU_LUT689L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT689L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT689L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT689L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT689L_EN			(0x1u<<0)

#define	GFXMMU_LUT689L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT689L_EN_B_0X1		(0x1u<<0)

// LUT689H Configuration

#define	GFXMMU_LUT689H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT689H_LO_0			(0x1u<<0)

// LUT690L Configuration

#define	GFXMMU_LUT690L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT690L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT690L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT690L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT690L_EN			(0x1u<<0)

#define	GFXMMU_LUT690L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT690L_EN_B_0X1		(0x1u<<0)

// LUT690H Configuration

#define	GFXMMU_LUT690H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT690H_LO_0			(0x1u<<0)

// LUT691L Configuration

#define	GFXMMU_LUT691L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT691L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT691L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT691L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT691L_EN			(0x1u<<0)

#define	GFXMMU_LUT691L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT691L_EN_B_0X1		(0x1u<<0)

// LUT691H Configuration

#define	GFXMMU_LUT691H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT691H_LO_0			(0x1u<<0)

// LUT692L Configuration

#define	GFXMMU_LUT692L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT692L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT692L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT692L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT692L_EN			(0x1u<<0)

#define	GFXMMU_LUT692L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT692L_EN_B_0X1		(0x1u<<0)

// LUT692H Configuration

#define	GFXMMU_LUT692H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT692H_LO_0			(0x1u<<0)

// LUT693L Configuration

#define	GFXMMU_LUT693L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT693L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT693L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT693L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT693L_EN			(0x1u<<0)

#define	GFXMMU_LUT693L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT693L_EN_B_0X1		(0x1u<<0)

// LUT693H Configuration

#define	GFXMMU_LUT693H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT693H_LO_0			(0x1u<<0)

// LUT694L Configuration

#define	GFXMMU_LUT694L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT694L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT694L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT694L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT694L_EN			(0x1u<<0)

#define	GFXMMU_LUT694L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT694L_EN_B_0X1		(0x1u<<0)

// LUT694H Configuration

