hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT709H Configuration

#define	GFXMMU_LUT709H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT709H_LO_0			(0x1u<<0)

// LUT710L Configuration

#define	GFXMMU_LUT710L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT710L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT710L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT710L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT710L_EN			(0x1u<<0)

#define	GFXMMU_LUT710L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT710L_EN_B_0X1		(0x1u<<0)

// LUT710H Configuration

#define	GFXMMU_LUT710H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT710H_LO_0			(0x1u<<0)

// LUT711L Configuration

#define	GFXMMU_LUT711L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT711L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT711L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT711L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT711L_EN			(0x1u<<0)

#define	GFXMMU_LUT711L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT711L_EN_B_0X1		(0x1u<<0)

// LUT711H Configuration

#define	GFXMMU_LUT711H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT711H_LO_0			(0x1u<<0)

// LUT712L Configuration

#define	GFXMMU_LUT712L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT712L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT712L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT712L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT712L_EN			(0x1u<<0)

#define	GFXMMU_LUT712L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT712L_EN_B_0X1		(0x1u<<0)

// LUT712H Configuration

#define	GFXMMU_LUT712H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT712H_LO_0			(0x1u<<0)

// LUT713L Configuration

#define	GFXMMU_LUT713L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT713L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT713L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT713L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT713L_EN			(0x1u<<0)

#define	GFXMMU_LUT713L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT713L_EN_B_0X1		(0x1u<<0)

// LUT713H Configuration

#define	GFXMMU_LUT713H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT713H_LO_0			(0x1u<<0)

// LUT714L Configuration

#define	GFXMMU_LUT714L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT714L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT714L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT714L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT714L_EN			(0x1u<<0)

#define	GFXMMU_LUT714L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT714L_EN_B_0X1		(0x1u<<0)

// LUT714H Configuration

#define	GFXMMU_LUT714H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT714H_LO_0			(0x1u<<0)

// LUT715L Configuration

#define	GFXMMU_LUT715L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT715L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT715L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT715L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT715L_EN			(0x1u<<0)

#define	GFXMMU_LUT715L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT715L_EN_B_0X1		(0x1u<<0)

// LUT715H Configuration

#define	GFXMMU_LUT715H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT715H_LO_0			(0x1u<<0)

// LUT716L Configuration

#define	GFXMMU_LUT716L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT716L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT716L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT716L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT716L_EN			(0x1u<<0)

#define	GFXMMU_LUT716L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT716L_EN_B_0X1		(0x1u<<0)

// LUT716H Configuration

#define	GFXMMU_LUT716H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT716H_LO_0			(0x1u<<0)

// LUT717L Configuration

#define	GFXMMU_LUT717L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT717L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT717L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT717L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT717L_EN			(0x1u<<0)

#define	GFXMMU_LUT717L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT717L_EN_B_0X1		(0x1u<<0)

// LUT717H Configuration

#define	GFXMMU_LUT717H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT717H_LO_0			(0x1u<<0)

// LUT718L Configuration

#define	GFXMMU_LUT718L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT718L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT718L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT718L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT718L_EN			(0x1u<<0)

#define	GFXMMU_LUT718L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT718L_EN_B_0X1		(0x1u<<0)

// LUT718H Configuration

#define	GFXMMU_LUT718H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT718H_LO_0			(0x1u<<0)

// LUT719L Configuration

#define	GFXMMU_LUT719L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT719L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT719L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT719L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT719L_EN			(0x1u<<0)

#define	GFXMMU_LUT719L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT719L_EN_B_0X1		(0x1u<<0)

// LUT719H Configuration

#define	GFXMMU_LUT719H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT719H_LO_0			(0x1u<<0)

// LUT720L Configuration

#define	GFXMMU_LUT720L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT720L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT720L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT720L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT720L_EN			(0x1u<<0)

#define	GFXMMU_LUT720L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT720L_EN_B_0X1		(0x1u<<0)

// LUT720H Configuration

#define	GFXMMU_LUT720H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT720H_LO_0			(0x1u<<0)

// LUT721L Configuration

#define	GFXMMU_LUT721L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT721L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT721L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT721L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT721L_EN			(0x1u<<0)

#define	GFXMMU_LUT721L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT721L_EN_B_0X1		(0x1u<<0)

// LUT721H Configuration

#define	GFXMMU_LUT721H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT721H_LO_0			(0x1u<<0)

// LUT722L Configuration

#define	GFXMMU_LUT722L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT722L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT722L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT722L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT722L_EN			(0x1u<<0)

#define	GFXMMU_LUT722L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT722L_EN_B_0X1		(0x1u<<0)

// LUT722H Configuration

#define	GFXMMU_LUT722H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT722H_LO_0			(0x1u<<0)

// LUT723L Configuration

#define	GFXMMU_LUT723L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT723L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT723L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT723L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT723L_EN			(0x1u<<0)

#define	GFXMMU_LUT723L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT723L_EN_B_0X1		(0x1u<<0)

// LUT723H Configuration

#define	GFXMMU_LUT723H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT723H_LO_0			(0x1u<<0)

// LUT724L Configuration

#define	GFXMMU_LUT724L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT724L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT724L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT724L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT724L_EN			(0x1u<<0)

#define	GFXMMU_LUT724L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT724L_EN_B_0X1		(0x1u<<0)

// LUT724H Configuration

