hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT754H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT754H_LO_0			(0x1u<<0)

// LUT755L Configuration

#define	GFXMMU_LUT755L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT755L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT755L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT755L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT755L_EN			(0x1u<<0)

#define	GFXMMU_LUT755L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT755L_EN_B_0X1		(0x1u<<0)

// LUT755H Configuration

#define	GFXMMU_LUT755H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT755H_LO_0			(0x1u<<0)

// LUT756L Configuration

#define	GFXMMU_LUT756L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT756L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT756L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT756L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT756L_EN			(0x1u<<0)

#define	GFXMMU_LUT756L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT756L_EN_B_0X1		(0x1u<<0)

// LUT756H Configuration

#define	GFXMMU_LUT756H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT756H_LO_0			(0x1u<<0)

// LUT757L Configuration

#define	GFXMMU_LUT757L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT757L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT757L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT757L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT757L_EN			(0x1u<<0)

#define	GFXMMU_LUT757L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT757L_EN_B_0X1		(0x1u<<0)

// LUT757H Configuration

#define	GFXMMU_LUT757H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT757H_LO_0			(0x1u<<0)

// LUT758L Configuration

#define	GFXMMU_LUT758L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT758L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT758L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT758L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT758L_EN			(0x1u<<0)

#define	GFXMMU_LUT758L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT758L_EN_B_0X1		(0x1u<<0)

// LUT758H Configuration

#define	GFXMMU_LUT758H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT758H_LO_0			(0x1u<<0)

// LUT759L Configuration

#define	GFXMMU_LUT759L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT759L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT759L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT759L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT759L_EN			(0x1u<<0)

#define	GFXMMU_LUT759L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT759L_EN_B_0X1		(0x1u<<0)

// LUT759H Configuration

#define	GFXMMU_LUT759H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT759H_LO_0			(0x1u<<0)

// LUT760L Configuration

#define	GFXMMU_LUT760L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT760L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT760L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT760L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT760L_EN			(0x1u<<0)

#define	GFXMMU_LUT760L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT760L_EN_B_0X1		(0x1u<<0)

// LUT760H Configuration

#define	GFXMMU_LUT760H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT760H_LO_0			(0x1u<<0)

// LUT761L Configuration

#define	GFXMMU_LUT761L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT761L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT761L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT761L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT761L_EN			(0x1u<<0)

#define	GFXMMU_LUT761L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT761L_EN_B_0X1		(0x1u<<0)

// LUT761H Configuration

#define	GFXMMU_LUT761H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT761H_LO_0			(0x1u<<0)

// LUT762L Configuration

#define	GFXMMU_LUT762L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT762L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT762L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT762L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT762L_EN			(0x1u<<0)

#define	GFXMMU_LUT762L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT762L_EN_B_0X1		(0x1u<<0)

// LUT762H Configuration

#define	GFXMMU_LUT762H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT762H_LO_0			(0x1u<<0)

// LUT763L Configuration

#define	GFXMMU_LUT763L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT763L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT763L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT763L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT763L_EN			(0x1u<<0)

#define	GFXMMU_LUT763L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT763L_EN_B_0X1		(0x1u<<0)

// LUT763H Configuration

#define	GFXMMU_LUT763H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT763H_LO_0			(0x1u<<0)

// LUT764L Configuration

#define	GFXMMU_LUT764L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT764L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT764L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT764L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT764L_EN			(0x1u<<0)

#define	GFXMMU_LUT764L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT764L_EN_B_0X1		(0x1u<<0)

// LUT764H Configuration

#define	GFXMMU_LUT764H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT764H_LO_0			(0x1u<<0)

// LUT765L Configuration

#define	GFXMMU_LUT765L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT765L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT765L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT765L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT765L_EN			(0x1u<<0)

#define	GFXMMU_LUT765L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT765L_EN_B_0X1		(0x1u<<0)

// LUT765H Configuration

#define	GFXMMU_LUT765H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT765H_LO_0			(0x1u<<0)

// LUT766L Configuration

#define	GFXMMU_LUT766L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT766L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT766L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT766L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT766L_EN			(0x1u<<0)

#define	GFXMMU_LUT766L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT766L_EN_B_0X1		(0x1u<<0)

// LUT766H Configuration

#define	GFXMMU_LUT766H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT766H_LO_0			(0x1u<<0)

// LUT767L Configuration

#define	GFXMMU_LUT767L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT767L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT767L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT767L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT767L_EN			(0x1u<<0)

#define	GFXMMU_LUT767L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT767L_EN_B_0X1		(0x1u<<0)

// LUT767H Configuration

#define	GFXMMU_LUT767H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT767H_LO_0			(0x1u<<0)

// LUT768L Configuration

#define	GFXMMU_LUT768L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT768L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT768L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT768L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT768L_EN			(0x1u<<0)

#define	GFXMMU_LUT768L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT768L_EN_B_0X1		(0x1u<<0)

// LUT768H Configuration

#define	GFXMMU_LUT768H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT768H_LO_0			(0x1u<<0)

// LUT769L Configuration

