hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT769L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT769L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT769L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT769L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT769L_EN			(0x1u<<0)

#define	GFXMMU_LUT769L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT769L_EN_B_0X1		(0x1u<<0)

// LUT769H Configuration

#define	GFXMMU_LUT769H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT769H_LO_0			(0x1u<<0)

// LUT770L Configuration

#define	GFXMMU_LUT770L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT770L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT770L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT770L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT770L_EN			(0x1u<<0)

#define	GFXMMU_LUT770L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT770L_EN_B_0X1		(0x1u<<0)

// LUT770H Configuration

#define	GFXMMU_LUT770H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT770H_LO_0			(0x1u<<0)

// LUT771L Configuration

#define	GFXMMU_LUT771L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT771L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT771L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT771L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT771L_EN			(0x1u<<0)

#define	GFXMMU_LUT771L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT771L_EN_B_0X1		(0x1u<<0)

// LUT771H Configuration

#define	GFXMMU_LUT771H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT771H_LO_0			(0x1u<<0)

// LUT772L Configuration

#define	GFXMMU_LUT772L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT772L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT772L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT772L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT772L_EN			(0x1u<<0)

#define	GFXMMU_LUT772L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT772L_EN_B_0X1		(0x1u<<0)

// LUT772H Configuration

#define	GFXMMU_LUT772H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT772H_LO_0			(0x1u<<0)

// LUT773L Configuration

#define	GFXMMU_LUT773L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT773L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT773L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT773L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT773L_EN			(0x1u<<0)

#define	GFXMMU_LUT773L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT773L_EN_B_0X1		(0x1u<<0)

// LUT773H Configuration

#define	GFXMMU_LUT773H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT773H_LO_0			(0x1u<<0)

// LUT774L Configuration

#define	GFXMMU_LUT774L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT774L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT774L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT774L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT774L_EN			(0x1u<<0)

#define	GFXMMU_LUT774L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT774L_EN_B_0X1		(0x1u<<0)

// LUT774H Configuration

#define	GFXMMU_LUT774H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT774H_LO_0			(0x1u<<0)

// LUT775L Configuration

#define	GFXMMU_LUT775L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT775L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT775L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT775L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT775L_EN			(0x1u<<0)

#define	GFXMMU_LUT775L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT775L_EN_B_0X1		(0x1u<<0)

// LUT775H Configuration

#define	GFXMMU_LUT775H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT775H_LO_0			(0x1u<<0)

// LUT776L Configuration

#define	GFXMMU_LUT776L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT776L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT776L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT776L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT776L_EN			(0x1u<<0)

#define	GFXMMU_LUT776L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT776L_EN_B_0X1		(0x1u<<0)

// LUT776H Configuration

#define	GFXMMU_LUT776H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT776H_LO_0			(0x1u<<0)

// LUT777L Configuration

#define	GFXMMU_LUT777L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT777L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT777L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT777L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT777L_EN			(0x1u<<0)

#define	GFXMMU_LUT777L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT777L_EN_B_0X1		(0x1u<<0)

// LUT777H Configuration

#define	GFXMMU_LUT777H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT777H_LO_0			(0x1u<<0)

// LUT778L Configuration

#define	GFXMMU_LUT778L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT778L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT778L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT778L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT778L_EN			(0x1u<<0)

#define	GFXMMU_LUT778L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT778L_EN_B_0X1		(0x1u<<0)

// LUT778H Configuration

#define	GFXMMU_LUT778H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT778H_LO_0			(0x1u<<0)

// LUT779L Configuration

#define	GFXMMU_LUT779L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT779L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT779L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT779L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT779L_EN			(0x1u<<0)

#define	GFXMMU_LUT779L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT779L_EN_B_0X1		(0x1u<<0)

// LUT779H Configuration

#define	GFXMMU_LUT779H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT779H_LO_0			(0x1u<<0)

// LUT780L Configuration

#define	GFXMMU_LUT780L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT780L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT780L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT780L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT780L_EN			(0x1u<<0)

#define	GFXMMU_LUT780L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT780L_EN_B_0X1		(0x1u<<0)

// LUT780H Configuration

#define	GFXMMU_LUT780H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT780H_LO_0			(0x1u<<0)

// LUT781L Configuration

#define	GFXMMU_LUT781L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT781L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT781L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT781L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT781L_EN			(0x1u<<0)

#define	GFXMMU_LUT781L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT781L_EN_B_0X1		(0x1u<<0)

// LUT781H Configuration

#define	GFXMMU_LUT781H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT781H_LO_0			(0x1u<<0)

// LUT782L Configuration

#define	GFXMMU_LUT782L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT782L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT782L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT782L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT782L_EN			(0x1u<<0)

#define	GFXMMU_LUT782L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT782L_EN_B_0X1		(0x1u<<0)

// LUT782H Configuration

#define	GFXMMU_LUT782H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT782H_LO_0			(0x1u<<0)

// LUT783L Configuration

#define	GFXMMU_LUT783L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT783L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT783L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT783L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT783L_EN			(0x1u<<0)

