hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT783L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT783L_EN_B_0X1		(0x1u<<0)

// LUT783H Configuration

#define	GFXMMU_LUT783H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT783H_LO_0			(0x1u<<0)

// LUT784L Configuration

#define	GFXMMU_LUT784L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT784L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT784L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT784L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT784L_EN			(0x1u<<0)

#define	GFXMMU_LUT784L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT784L_EN_B_0X1		(0x1u<<0)

// LUT784H Configuration

#define	GFXMMU_LUT784H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT784H_LO_0			(0x1u<<0)

// LUT785L Configuration

#define	GFXMMU_LUT785L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT785L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT785L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT785L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT785L_EN			(0x1u<<0)

#define	GFXMMU_LUT785L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT785L_EN_B_0X1		(0x1u<<0)

// LUT785H Configuration

#define	GFXMMU_LUT785H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT785H_LO_0			(0x1u<<0)

// LUT786L Configuration

#define	GFXMMU_LUT786L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT786L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT786L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT786L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT786L_EN			(0x1u<<0)

#define	GFXMMU_LUT786L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT786L_EN_B_0X1		(0x1u<<0)

// LUT786H Configuration

#define	GFXMMU_LUT786H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT786H_LO_0			(0x1u<<0)

// LUT787L Configuration

#define	GFXMMU_LUT787L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT787L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT787L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT787L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT787L_EN			(0x1u<<0)

#define	GFXMMU_LUT787L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT787L_EN_B_0X1		(0x1u<<0)

// LUT787H Configuration

#define	GFXMMU_LUT787H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT787H_LO_0			(0x1u<<0)

// LUT788L Configuration

#define	GFXMMU_LUT788L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT788L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT788L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT788L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT788L_EN			(0x1u<<0)

#define	GFXMMU_LUT788L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT788L_EN_B_0X1		(0x1u<<0)

// LUT788H Configuration

#define	GFXMMU_LUT788H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT788H_LO_0			(0x1u<<0)

// LUT789L Configuration

#define	GFXMMU_LUT789L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT789L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT789L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT789L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT789L_EN			(0x1u<<0)

#define	GFXMMU_LUT789L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT789L_EN_B_0X1		(0x1u<<0)

// LUT789H Configuration

#define	GFXMMU_LUT789H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT789H_LO_0			(0x1u<<0)

// LUT790L Configuration

#define	GFXMMU_LUT790L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT790L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT790L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT790L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT790L_EN			(0x1u<<0)

#define	GFXMMU_LUT790L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT790L_EN_B_0X1		(0x1u<<0)

// LUT790H Configuration

#define	GFXMMU_LUT790H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT790H_LO_0			(0x1u<<0)

// LUT791L Configuration

#define	GFXMMU_LUT791L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT791L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT791L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT791L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT791L_EN			(0x1u<<0)

#define	GFXMMU_LUT791L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT791L_EN_B_0X1		(0x1u<<0)

// LUT791H Configuration

#define	GFXMMU_LUT791H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT791H_LO_0			(0x1u<<0)

// LUT792L Configuration

#define	GFXMMU_LUT792L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT792L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT792L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT792L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT792L_EN			(0x1u<<0)

#define	GFXMMU_LUT792L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT792L_EN_B_0X1		(0x1u<<0)

// LUT792H Configuration

#define	GFXMMU_LUT792H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT792H_LO_0			(0x1u<<0)

// LUT793L Configuration

#define	GFXMMU_LUT793L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT793L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT793L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT793L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT793L_EN			(0x1u<<0)

#define	GFXMMU_LUT793L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT793L_EN_B_0X1		(0x1u<<0)

// LUT793H Configuration

#define	GFXMMU_LUT793H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT793H_LO_0			(0x1u<<0)

// LUT794L Configuration

#define	GFXMMU_LUT794L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT794L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT794L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT794L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT794L_EN			(0x1u<<0)

#define	GFXMMU_LUT794L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT794L_EN_B_0X1		(0x1u<<0)

// LUT794H Configuration

#define	GFXMMU_LUT794H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT794H_LO_0			(0x1u<<0)

// LUT795L Configuration

#define	GFXMMU_LUT795L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT795L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT795L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT795L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT795L_EN			(0x1u<<0)

#define	GFXMMU_LUT795L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT795L_EN_B_0X1		(0x1u<<0)

// LUT795H Configuration

#define	GFXMMU_LUT795H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT795H_LO_0			(0x1u<<0)

// LUT796L Configuration

#define	GFXMMU_LUT796L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT796L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT796L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT796L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT796L_EN			(0x1u<<0)

#define	GFXMMU_LUT796L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT796L_EN_B_0X1		(0x1u<<0)

// LUT796H Configuration

#define	GFXMMU_LUT796H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT796H_LO_0			(0x1u<<0)

// LUT797L Configuration

#define	GFXMMU_LUT797L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT797L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT797L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT797L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT797L_EN			(0x1u<<0)

#define	GFXMMU_LUT797L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT797L_EN_B_0X1		(0x1u<<0)

// LUT797H Configuration

#define	GFXMMU_LUT797H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT797H_LO_0			(0x1u<<0)

// LUT798L Configuration

