hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT798L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT798L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT798L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT798L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT798L_EN			(0x1u<<0)

#define	GFXMMU_LUT798L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT798L_EN_B_0X1		(0x1u<<0)

// LUT798H Configuration

#define	GFXMMU_LUT798H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT798H_LO_0			(0x1u<<0)

// LUT799L Configuration

#define	GFXMMU_LUT799L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT799L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT799L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT799L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT799L_EN			(0x1u<<0)

#define	GFXMMU_LUT799L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT799L_EN_B_0X1		(0x1u<<0)

// LUT799H Configuration

#define	GFXMMU_LUT799H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT799H_LO_0			(0x1u<<0)

// LUT800L Configuration

#define	GFXMMU_LUT800L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT800L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT800L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT800L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT800L_EN			(0x1u<<0)

#define	GFXMMU_LUT800L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT800L_EN_B_0X1		(0x1u<<0)

// LUT800H Configuration

#define	GFXMMU_LUT800H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT800H_LO_0			(0x1u<<0)

// LUT801L Configuration

#define	GFXMMU_LUT801L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT801L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT801L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT801L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT801L_EN			(0x1u<<0)

#define	GFXMMU_LUT801L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT801L_EN_B_0X1		(0x1u<<0)

// LUT801H Configuration

#define	GFXMMU_LUT801H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT801H_LO_0			(0x1u<<0)

// LUT802L Configuration

#define	GFXMMU_LUT802L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT802L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT802L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT802L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT802L_EN			(0x1u<<0)

#define	GFXMMU_LUT802L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT802L_EN_B_0X1		(0x1u<<0)

// LUT802H Configuration

#define	GFXMMU_LUT802H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT802H_LO_0			(0x1u<<0)

// LUT803L Configuration

#define	GFXMMU_LUT803L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT803L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT803L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT803L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT803L_EN			(0x1u<<0)

#define	GFXMMU_LUT803L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT803L_EN_B_0X1		(0x1u<<0)

// LUT803H Configuration

#define	GFXMMU_LUT803H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT803H_LO_0			(0x1u<<0)

// LUT804L Configuration

#define	GFXMMU_LUT804L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT804L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT804L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT804L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT804L_EN			(0x1u<<0)

#define	GFXMMU_LUT804L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT804L_EN_B_0X1		(0x1u<<0)

// LUT804H Configuration

#define	GFXMMU_LUT804H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT804H_LO_0			(0x1u<<0)

// LUT805L Configuration

#define	GFXMMU_LUT805L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT805L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT805L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT805L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT805L_EN			(0x1u<<0)

#define	GFXMMU_LUT805L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT805L_EN_B_0X1		(0x1u<<0)

// LUT805H Configuration

#define	GFXMMU_LUT805H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT805H_LO_0			(0x1u<<0)

// LUT806L Configuration

#define	GFXMMU_LUT806L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT806L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT806L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT806L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT806L_EN			(0x1u<<0)

#define	GFXMMU_LUT806L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT806L_EN_B_0X1		(0x1u<<0)

// LUT806H Configuration

#define	GFXMMU_LUT806H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT806H_LO_0			(0x1u<<0)

// LUT807L Configuration

#define	GFXMMU_LUT807L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT807L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT807L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT807L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT807L_EN			(0x1u<<0)

#define	GFXMMU_LUT807L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT807L_EN_B_0X1		(0x1u<<0)

// LUT807H Configuration

#define	GFXMMU_LUT807H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT807H_LO_0			(0x1u<<0)

// LUT808L Configuration

#define	GFXMMU_LUT808L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT808L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT808L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT808L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT808L_EN			(0x1u<<0)

#define	GFXMMU_LUT808L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT808L_EN_B_0X1		(0x1u<<0)

// LUT808H Configuration

#define	GFXMMU_LUT808H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT808H_LO_0			(0x1u<<0)

// LUT809L Configuration

#define	GFXMMU_LUT809L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT809L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT809L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT809L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT809L_EN			(0x1u<<0)

#define	GFXMMU_LUT809L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT809L_EN_B_0X1		(0x1u<<0)

// LUT809H Configuration

#define	GFXMMU_LUT809H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT809H_LO_0			(0x1u<<0)

// LUT810L Configuration

#define	GFXMMU_LUT810L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT810L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT810L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT810L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT810L_EN			(0x1u<<0)

#define	GFXMMU_LUT810L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT810L_EN_B_0X1		(0x1u<<0)

// LUT810H Configuration

#define	GFXMMU_LUT810H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT810H_LO_0			(0x1u<<0)

// LUT811L Configuration

#define	GFXMMU_LUT811L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT811L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT811L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT811L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT811L_EN			(0x1u<<0)

#define	GFXMMU_LUT811L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT811L_EN_B_0X1		(0x1u<<0)

// LUT811H Configuration

#define	GFXMMU_LUT811H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT811H_LO_0			(0x1u<<0)

// LUT812L Configuration

#define	GFXMMU_LUT812L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT812L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT812L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT812L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT812L_EN			(0x1u<<0)

#define	GFXMMU_LUT812L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT812L_EN_B_0X1		(0x1u<<0)

// LUT812H Configuration

#define	GFXMMU_LUT812H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT812H_LO_0			(0x1u<<0)

