hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT813L Configuration

#define	GFXMMU_LUT813L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT813L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT813L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT813L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT813L_EN			(0x1u<<0)

#define	GFXMMU_LUT813L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT813L_EN_B_0X1		(0x1u<<0)

// LUT813H Configuration

#define	GFXMMU_LUT813H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT813H_LO_0			(0x1u<<0)

// LUT814L Configuration

#define	GFXMMU_LUT814L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT814L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT814L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT814L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT814L_EN			(0x1u<<0)

#define	GFXMMU_LUT814L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT814L_EN_B_0X1		(0x1u<<0)

// LUT814H Configuration

#define	GFXMMU_LUT814H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT814H_LO_0			(0x1u<<0)

// LUT815L Configuration

#define	GFXMMU_LUT815L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT815L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT815L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT815L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT815L_EN			(0x1u<<0)

#define	GFXMMU_LUT815L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT815L_EN_B_0X1		(0x1u<<0)

// LUT815H Configuration

#define	GFXMMU_LUT815H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT815H_LO_0			(0x1u<<0)

// LUT816L Configuration

#define	GFXMMU_LUT816L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT816L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT816L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT816L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT816L_EN			(0x1u<<0)

#define	GFXMMU_LUT816L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT816L_EN_B_0X1		(0x1u<<0)

// LUT816H Configuration

#define	GFXMMU_LUT816H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT816H_LO_0			(0x1u<<0)

// LUT817L Configuration

#define	GFXMMU_LUT817L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT817L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT817L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT817L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT817L_EN			(0x1u<<0)

#define	GFXMMU_LUT817L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT817L_EN_B_0X1		(0x1u<<0)

// LUT817H Configuration

#define	GFXMMU_LUT817H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT817H_LO_0			(0x1u<<0)

// LUT818L Configuration

#define	GFXMMU_LUT818L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT818L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT818L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT818L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT818L_EN			(0x1u<<0)

#define	GFXMMU_LUT818L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT818L_EN_B_0X1		(0x1u<<0)

// LUT818H Configuration

#define	GFXMMU_LUT818H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT818H_LO_0			(0x1u<<0)

// LUT819L Configuration

#define	GFXMMU_LUT819L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT819L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT819L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT819L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT819L_EN			(0x1u<<0)

#define	GFXMMU_LUT819L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT819L_EN_B_0X1		(0x1u<<0)

// LUT819H Configuration

#define	GFXMMU_LUT819H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT819H_LO_0			(0x1u<<0)

// LUT820L Configuration

#define	GFXMMU_LUT820L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT820L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT820L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT820L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT820L_EN			(0x1u<<0)

#define	GFXMMU_LUT820L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT820L_EN_B_0X1		(0x1u<<0)

// LUT820H Configuration

#define	GFXMMU_LUT820H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT820H_LO_0			(0x1u<<0)

// LUT821L Configuration

#define	GFXMMU_LUT821L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT821L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT821L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT821L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT821L_EN			(0x1u<<0)

#define	GFXMMU_LUT821L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT821L_EN_B_0X1		(0x1u<<0)

// LUT821H Configuration

#define	GFXMMU_LUT821H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT821H_LO_0			(0x1u<<0)

// LUT822L Configuration

#define	GFXMMU_LUT822L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT822L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT822L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT822L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT822L_EN			(0x1u<<0)

#define	GFXMMU_LUT822L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT822L_EN_B_0X1		(0x1u<<0)

// LUT822H Configuration

#define	GFXMMU_LUT822H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT822H_LO_0			(0x1u<<0)

// LUT823L Configuration

#define	GFXMMU_LUT823L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT823L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT823L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT823L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT823L_EN			(0x1u<<0)

#define	GFXMMU_LUT823L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT823L_EN_B_0X1		(0x1u<<0)

// LUT823H Configuration

#define	GFXMMU_LUT823H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT823H_LO_0			(0x1u<<0)

// LUT824L Configuration

#define	GFXMMU_LUT824L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT824L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT824L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT824L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT824L_EN			(0x1u<<0)

#define	GFXMMU_LUT824L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT824L_EN_B_0X1		(0x1u<<0)

// LUT824H Configuration

#define	GFXMMU_LUT824H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT824H_LO_0			(0x1u<<0)

// LUT825L Configuration

#define	GFXMMU_LUT825L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT825L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT825L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT825L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT825L_EN			(0x1u<<0)

#define	GFXMMU_LUT825L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT825L_EN_B_0X1		(0x1u<<0)

// LUT825H Configuration

#define	GFXMMU_LUT825H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT825H_LO_0			(0x1u<<0)

// LUT826L Configuration

#define	GFXMMU_LUT826L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT826L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT826L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT826L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT826L_EN			(0x1u<<0)

#define	GFXMMU_LUT826L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT826L_EN_B_0X1		(0x1u<<0)

// LUT826H Configuration

#define	GFXMMU_LUT826H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT826H_LO_0			(0x1u<<0)

// LUT827L Configuration

#define	GFXMMU_LUT827L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT827L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT827L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT827L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT827L_EN			(0x1u<<0)

#define	GFXMMU_LUT827L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT827L_EN_B_0X1		(0x1u<<0)

