hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT827H Configuration

#define	GFXMMU_LUT827H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT827H_LO_0			(0x1u<<0)

// LUT828L Configuration

#define	GFXMMU_LUT828L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT828L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT828L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT828L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT828L_EN			(0x1u<<0)

#define	GFXMMU_LUT828L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT828L_EN_B_0X1		(0x1u<<0)

// LUT828H Configuration

#define	GFXMMU_LUT828H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT828H_LO_0			(0x1u<<0)

// LUT829L Configuration

#define	GFXMMU_LUT829L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT829L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT829L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT829L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT829L_EN			(0x1u<<0)

#define	GFXMMU_LUT829L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT829L_EN_B_0X1		(0x1u<<0)

// LUT829H Configuration

#define	GFXMMU_LUT829H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT829H_LO_0			(0x1u<<0)

// LUT830L Configuration

#define	GFXMMU_LUT830L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT830L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT830L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT830L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT830L_EN			(0x1u<<0)

#define	GFXMMU_LUT830L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT830L_EN_B_0X1		(0x1u<<0)

// LUT830H Configuration

#define	GFXMMU_LUT830H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT830H_LO_0			(0x1u<<0)

// LUT831L Configuration

#define	GFXMMU_LUT831L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT831L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT831L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT831L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT831L_EN			(0x1u<<0)

#define	GFXMMU_LUT831L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT831L_EN_B_0X1		(0x1u<<0)

// LUT831H Configuration

#define	GFXMMU_LUT831H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT831H_LO_0			(0x1u<<0)

// LUT832L Configuration

#define	GFXMMU_LUT832L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT832L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT832L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT832L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT832L_EN			(0x1u<<0)

#define	GFXMMU_LUT832L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT832L_EN_B_0X1		(0x1u<<0)

// LUT832H Configuration

#define	GFXMMU_LUT832H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT832H_LO_0			(0x1u<<0)

// LUT833L Configuration

#define	GFXMMU_LUT833L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT833L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT833L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT833L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT833L_EN			(0x1u<<0)

#define	GFXMMU_LUT833L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT833L_EN_B_0X1		(0x1u<<0)

// LUT833H Configuration

#define	GFXMMU_LUT833H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT833H_LO_0			(0x1u<<0)

// LUT834L Configuration

#define	GFXMMU_LUT834L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT834L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT834L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT834L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT834L_EN			(0x1u<<0)

#define	GFXMMU_LUT834L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT834L_EN_B_0X1		(0x1u<<0)

// LUT834H Configuration

#define	GFXMMU_LUT834H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT834H_LO_0			(0x1u<<0)

// LUT835L Configuration

#define	GFXMMU_LUT835L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT835L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT835L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT835L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT835L_EN			(0x1u<<0)

#define	GFXMMU_LUT835L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT835L_EN_B_0X1		(0x1u<<0)

// LUT835H Configuration

#define	GFXMMU_LUT835H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT835H_LO_0			(0x1u<<0)

// LUT836L Configuration

#define	GFXMMU_LUT836L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT836L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT836L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT836L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT836L_EN			(0x1u<<0)

#define	GFXMMU_LUT836L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT836L_EN_B_0X1		(0x1u<<0)

// LUT836H Configuration

#define	GFXMMU_LUT836H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT836H_LO_0			(0x1u<<0)

// LUT837L Configuration

#define	GFXMMU_LUT837L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT837L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT837L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT837L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT837L_EN			(0x1u<<0)

#define	GFXMMU_LUT837L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT837L_EN_B_0X1		(0x1u<<0)

// LUT837H Configuration

#define	GFXMMU_LUT837H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT837H_LO_0			(0x1u<<0)

// LUT838L Configuration

#define	GFXMMU_LUT838L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT838L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT838L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT838L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT838L_EN			(0x1u<<0)

#define	GFXMMU_LUT838L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT838L_EN_B_0X1		(0x1u<<0)

// LUT838H Configuration

#define	GFXMMU_LUT838H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT838H_LO_0			(0x1u<<0)

// LUT839L Configuration

#define	GFXMMU_LUT839L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT839L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT839L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT839L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT839L_EN			(0x1u<<0)

#define	GFXMMU_LUT839L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT839L_EN_B_0X1		(0x1u<<0)

// LUT839H Configuration

#define	GFXMMU_LUT839H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT839H_LO_0			(0x1u<<0)

// LUT840L Configuration

#define	GFXMMU_LUT840L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT840L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT840L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT840L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT840L_EN			(0x1u<<0)

#define	GFXMMU_LUT840L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT840L_EN_B_0X1		(0x1u<<0)

// LUT840H Configuration

#define	GFXMMU_LUT840H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT840H_LO_0			(0x1u<<0)

// LUT841L Configuration

#define	GFXMMU_LUT841L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT841L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT841L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT841L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT841L_EN			(0x1u<<0)

#define	GFXMMU_LUT841L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT841L_EN_B_0X1		(0x1u<<0)

// LUT841H Configuration

#define	GFXMMU_LUT841H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT841H_LO_0			(0x1u<<0)

// LUT842L Configuration

#define	GFXMMU_LUT842L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT842L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT842L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT842L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT842L_EN			(0x1u<<0)

