hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT842L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT842L_EN_B_0X1		(0x1u<<0)

// LUT842H Configuration

#define	GFXMMU_LUT842H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT842H_LO_0			(0x1u<<0)

// LUT843L Configuration

#define	GFXMMU_LUT843L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT843L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT843L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT843L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT843L_EN			(0x1u<<0)

#define	GFXMMU_LUT843L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT843L_EN_B_0X1		(0x1u<<0)

// LUT843H Configuration

#define	GFXMMU_LUT843H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT843H_LO_0			(0x1u<<0)

// LUT844L Configuration

#define	GFXMMU_LUT844L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT844L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT844L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT844L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT844L_EN			(0x1u<<0)

#define	GFXMMU_LUT844L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT844L_EN_B_0X1		(0x1u<<0)

// LUT844H Configuration

#define	GFXMMU_LUT844H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT844H_LO_0			(0x1u<<0)

// LUT845L Configuration

#define	GFXMMU_LUT845L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT845L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT845L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT845L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT845L_EN			(0x1u<<0)

#define	GFXMMU_LUT845L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT845L_EN_B_0X1		(0x1u<<0)

// LUT845H Configuration

#define	GFXMMU_LUT845H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT845H_LO_0			(0x1u<<0)

// LUT846L Configuration

#define	GFXMMU_LUT846L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT846L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT846L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT846L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT846L_EN			(0x1u<<0)

#define	GFXMMU_LUT846L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT846L_EN_B_0X1		(0x1u<<0)

// LUT846H Configuration

#define	GFXMMU_LUT846H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT846H_LO_0			(0x1u<<0)

// LUT847L Configuration

#define	GFXMMU_LUT847L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT847L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT847L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT847L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT847L_EN			(0x1u<<0)

#define	GFXMMU_LUT847L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT847L_EN_B_0X1		(0x1u<<0)

// LUT847H Configuration

#define	GFXMMU_LUT847H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT847H_LO_0			(0x1u<<0)

// LUT848L Configuration

#define	GFXMMU_LUT848L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT848L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT848L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT848L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT848L_EN			(0x1u<<0)

#define	GFXMMU_LUT848L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT848L_EN_B_0X1		(0x1u<<0)

// LUT848H Configuration

#define	GFXMMU_LUT848H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT848H_LO_0			(0x1u<<0)

// LUT849L Configuration

#define	GFXMMU_LUT849L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT849L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT849L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT849L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT849L_EN			(0x1u<<0)

#define	GFXMMU_LUT849L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT849L_EN_B_0X1		(0x1u<<0)

// LUT849H Configuration

#define	GFXMMU_LUT849H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT849H_LO_0			(0x1u<<0)

// LUT850L Configuration

#define	GFXMMU_LUT850L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT850L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT850L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT850L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT850L_EN			(0x1u<<0)

#define	GFXMMU_LUT850L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT850L_EN_B_0X1		(0x1u<<0)

// LUT850H Configuration

#define	GFXMMU_LUT850H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT850H_LO_0			(0x1u<<0)

// LUT851L Configuration

#define	GFXMMU_LUT851L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT851L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT851L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT851L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT851L_EN			(0x1u<<0)

#define	GFXMMU_LUT851L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT851L_EN_B_0X1		(0x1u<<0)

// LUT851H Configuration

#define	GFXMMU_LUT851H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT851H_LO_0			(0x1u<<0)

// LUT852L Configuration

#define	GFXMMU_LUT852L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT852L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT852L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT852L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT852L_EN			(0x1u<<0)

#define	GFXMMU_LUT852L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT852L_EN_B_0X1		(0x1u<<0)

// LUT852H Configuration

#define	GFXMMU_LUT852H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT852H_LO_0			(0x1u<<0)

// LUT853L Configuration

#define	GFXMMU_LUT853L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT853L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT853L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT853L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT853L_EN			(0x1u<<0)

#define	GFXMMU_LUT853L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT853L_EN_B_0X1		(0x1u<<0)

// LUT853H Configuration

#define	GFXMMU_LUT853H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT853H_LO_0			(0x1u<<0)

// LUT854L Configuration

#define	GFXMMU_LUT854L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT854L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT854L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT854L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT854L_EN			(0x1u<<0)

#define	GFXMMU_LUT854L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT854L_EN_B_0X1		(0x1u<<0)

// LUT854H Configuration

#define	GFXMMU_LUT854H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT854H_LO_0			(0x1u<<0)

// LUT855L Configuration

#define	GFXMMU_LUT855L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT855L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT855L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT855L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT855L_EN			(0x1u<<0)

#define	GFXMMU_LUT855L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT855L_EN_B_0X1		(0x1u<<0)

// LUT855H Configuration

#define	GFXMMU_LUT855H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT855H_LO_0			(0x1u<<0)

// LUT856L Configuration

#define	GFXMMU_LUT856L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT856L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT856L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT856L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT856L_EN			(0x1u<<0)

#define	GFXMMU_LUT856L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT856L_EN_B_0X1		(0x1u<<0)

// LUT856H Configuration

#define	GFXMMU_LUT856H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT856H_LO_0			(0x1u<<0)

