hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT857L Configuration

#define	GFXMMU_LUT857L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT857L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT857L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT857L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT857L_EN			(0x1u<<0)

#define	GFXMMU_LUT857L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT857L_EN_B_0X1		(0x1u<<0)

// LUT857H Configuration

#define	GFXMMU_LUT857H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT857H_LO_0			(0x1u<<0)

// LUT858L Configuration

#define	GFXMMU_LUT858L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT858L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT858L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT858L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT858L_EN			(0x1u<<0)

#define	GFXMMU_LUT858L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT858L_EN_B_0X1		(0x1u<<0)

// LUT858H Configuration

#define	GFXMMU_LUT858H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT858H_LO_0			(0x1u<<0)

// LUT859L Configuration

#define	GFXMMU_LUT859L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT859L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT859L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT859L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT859L_EN			(0x1u<<0)

#define	GFXMMU_LUT859L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT859L_EN_B_0X1		(0x1u<<0)

// LUT859H Configuration

#define	GFXMMU_LUT859H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT859H_LO_0			(0x1u<<0)

// LUT860L Configuration

#define	GFXMMU_LUT860L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT860L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT860L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT860L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT860L_EN			(0x1u<<0)

#define	GFXMMU_LUT860L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT860L_EN_B_0X1		(0x1u<<0)

// LUT860H Configuration

#define	GFXMMU_LUT860H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT860H_LO_0			(0x1u<<0)

// LUT861L Configuration

#define	GFXMMU_LUT861L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT861L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT861L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT861L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT861L_EN			(0x1u<<0)

#define	GFXMMU_LUT861L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT861L_EN_B_0X1		(0x1u<<0)

// LUT861H Configuration

#define	GFXMMU_LUT861H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT861H_LO_0			(0x1u<<0)

// LUT862L Configuration

#define	GFXMMU_LUT862L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT862L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT862L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT862L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT862L_EN			(0x1u<<0)

#define	GFXMMU_LUT862L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT862L_EN_B_0X1		(0x1u<<0)

// LUT862H Configuration

#define	GFXMMU_LUT862H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT862H_LO_0			(0x1u<<0)

// LUT863L Configuration

#define	GFXMMU_LUT863L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT863L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT863L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT863L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT863L_EN			(0x1u<<0)

#define	GFXMMU_LUT863L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT863L_EN_B_0X1		(0x1u<<0)

// LUT863H Configuration

#define	GFXMMU_LUT863H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT863H_LO_0			(0x1u<<0)

// LUT864L Configuration

#define	GFXMMU_LUT864L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT864L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT864L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT864L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT864L_EN			(0x1u<<0)

#define	GFXMMU_LUT864L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT864L_EN_B_0X1		(0x1u<<0)

// LUT864H Configuration

#define	GFXMMU_LUT864H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT864H_LO_0			(0x1u<<0)

// LUT865L Configuration

#define	GFXMMU_LUT865L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT865L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT865L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT865L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT865L_EN			(0x1u<<0)

#define	GFXMMU_LUT865L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT865L_EN_B_0X1		(0x1u<<0)

// LUT865H Configuration

#define	GFXMMU_LUT865H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT865H_LO_0			(0x1u<<0)

// LUT866L Configuration

#define	GFXMMU_LUT866L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT866L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT866L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT866L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT866L_EN			(0x1u<<0)

#define	GFXMMU_LUT866L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT866L_EN_B_0X1		(0x1u<<0)

// LUT866H Configuration

#define	GFXMMU_LUT866H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT866H_LO_0			(0x1u<<0)

// LUT867L Configuration

#define	GFXMMU_LUT867L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT867L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT867L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT867L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT867L_EN			(0x1u<<0)

#define	GFXMMU_LUT867L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT867L_EN_B_0X1		(0x1u<<0)

// LUT867H Configuration

#define	GFXMMU_LUT867H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT867H_LO_0			(0x1u<<0)

// LUT868L Configuration

#define	GFXMMU_LUT868L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT868L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT868L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT868L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT868L_EN			(0x1u<<0)

#define	GFXMMU_LUT868L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT868L_EN_B_0X1		(0x1u<<0)

// LUT868H Configuration

#define	GFXMMU_LUT868H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT868H_LO_0			(0x1u<<0)

// LUT869L Configuration

#define	GFXMMU_LUT869L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT869L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT869L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT869L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT869L_EN			(0x1u<<0)

#define	GFXMMU_LUT869L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT869L_EN_B_0X1		(0x1u<<0)

// LUT869H Configuration

#define	GFXMMU_LUT869H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT869H_LO_0			(0x1u<<0)

// LUT870L Configuration

#define	GFXMMU_LUT870L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT870L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT870L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT870L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT870L_EN			(0x1u<<0)

#define	GFXMMU_LUT870L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT870L_EN_B_0X1		(0x1u<<0)

// LUT870H Configuration

#define	GFXMMU_LUT870H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT870H_LO_0			(0x1u<<0)

// LUT871L Configuration

#define	GFXMMU_LUT871L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT871L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT871L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT871L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT871L_EN			(0x1u<<0)

#define	GFXMMU_LUT871L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT871L_EN_B_0X1		(0x1u<<0)

