hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT871H Configuration

#define	GFXMMU_LUT871H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT871H_LO_0			(0x1u<<0)

// LUT872L Configuration

#define	GFXMMU_LUT872L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT872L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT872L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT872L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT872L_EN			(0x1u<<0)

#define	GFXMMU_LUT872L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT872L_EN_B_0X1		(0x1u<<0)

// LUT872H Configuration

#define	GFXMMU_LUT872H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT872H_LO_0			(0x1u<<0)

// LUT873L Configuration

#define	GFXMMU_LUT873L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT873L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT873L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT873L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT873L_EN			(0x1u<<0)

#define	GFXMMU_LUT873L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT873L_EN_B_0X1		(0x1u<<0)

// LUT873H Configuration

#define	GFXMMU_LUT873H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT873H_LO_0			(0x1u<<0)

// LUT874L Configuration

#define	GFXMMU_LUT874L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT874L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT874L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT874L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT874L_EN			(0x1u<<0)

#define	GFXMMU_LUT874L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT874L_EN_B_0X1		(0x1u<<0)

// LUT874H Configuration

#define	GFXMMU_LUT874H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT874H_LO_0			(0x1u<<0)

// LUT875L Configuration

#define	GFXMMU_LUT875L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT875L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT875L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT875L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT875L_EN			(0x1u<<0)

#define	GFXMMU_LUT875L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT875L_EN_B_0X1		(0x1u<<0)

// LUT875H Configuration

#define	GFXMMU_LUT875H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT875H_LO_0			(0x1u<<0)

// LUT876L Configuration

#define	GFXMMU_LUT876L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT876L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT876L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT876L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT876L_EN			(0x1u<<0)

#define	GFXMMU_LUT876L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT876L_EN_B_0X1		(0x1u<<0)

// LUT876H Configuration

#define	GFXMMU_LUT876H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT876H_LO_0			(0x1u<<0)

// LUT877L Configuration

#define	GFXMMU_LUT877L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT877L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT877L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT877L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT877L_EN			(0x1u<<0)

#define	GFXMMU_LUT877L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT877L_EN_B_0X1		(0x1u<<0)

// LUT877H Configuration

#define	GFXMMU_LUT877H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT877H_LO_0			(0x1u<<0)

// LUT878L Configuration

#define	GFXMMU_LUT878L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT878L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT878L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT878L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT878L_EN			(0x1u<<0)

#define	GFXMMU_LUT878L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT878L_EN_B_0X1		(0x1u<<0)

// LUT878H Configuration

#define	GFXMMU_LUT878H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT878H_LO_0			(0x1u<<0)

// LUT879L Configuration

#define	GFXMMU_LUT879L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT879L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT879L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT879L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT879L_EN			(0x1u<<0)

#define	GFXMMU_LUT879L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT879L_EN_B_0X1		(0x1u<<0)

// LUT879H Configuration

#define	GFXMMU_LUT879H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT879H_LO_0			(0x1u<<0)

// LUT880L Configuration

#define	GFXMMU_LUT880L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT880L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT880L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT880L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT880L_EN			(0x1u<<0)

#define	GFXMMU_LUT880L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT880L_EN_B_0X1		(0x1u<<0)

// LUT880H Configuration

#define	GFXMMU_LUT880H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT880H_LO_0			(0x1u<<0)

// LUT881L Configuration

#define	GFXMMU_LUT881L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT881L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT881L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT881L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT881L_EN			(0x1u<<0)

#define	GFXMMU_LUT881L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT881L_EN_B_0X1		(0x1u<<0)

// LUT881H Configuration

#define	GFXMMU_LUT881H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT881H_LO_0			(0x1u<<0)

// LUT882L Configuration

#define	GFXMMU_LUT882L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT882L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT882L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT882L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT882L_EN			(0x1u<<0)

#define	GFXMMU_LUT882L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT882L_EN_B_0X1		(0x1u<<0)

// LUT882H Configuration

#define	GFXMMU_LUT882H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT882H_LO_0			(0x1u<<0)

// LUT883L Configuration

#define	GFXMMU_LUT883L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT883L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT883L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT883L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT883L_EN			(0x1u<<0)

#define	GFXMMU_LUT883L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT883L_EN_B_0X1		(0x1u<<0)

// LUT883H Configuration

#define	GFXMMU_LUT883H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT883H_LO_0			(0x1u<<0)

// LUT884L Configuration

#define	GFXMMU_LUT884L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT884L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT884L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT884L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT884L_EN			(0x1u<<0)

#define	GFXMMU_LUT884L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT884L_EN_B_0X1		(0x1u<<0)

// LUT884H Configuration

#define	GFXMMU_LUT884H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT884H_LO_0			(0x1u<<0)

// LUT885L Configuration

#define	GFXMMU_LUT885L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT885L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT885L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT885L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT885L_EN			(0x1u<<0)

#define	GFXMMU_LUT885L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT885L_EN_B_0X1		(0x1u<<0)

// LUT885H Configuration

#define	GFXMMU_LUT885H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT885H_LO_0			(0x1u<<0)

// LUT886L Configuration

#define	GFXMMU_LUT886L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT886L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT886L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT886L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT886L_EN			(0x1u<<0)

#define	GFXMMU_LUT886L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT886L_EN_B_0X1		(0x1u<<0)

