hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT886H Configuration

#define	GFXMMU_LUT886H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT886H_LO_0			(0x1u<<0)

// LUT887L Configuration

#define	GFXMMU_LUT887L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT887L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT887L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT887L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT887L_EN			(0x1u<<0)

#define	GFXMMU_LUT887L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT887L_EN_B_0X1		(0x1u<<0)

// LUT887H Configuration

#define	GFXMMU_LUT887H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT887H_LO_0			(0x1u<<0)

// LUT888L Configuration

#define	GFXMMU_LUT888L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT888L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT888L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT888L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT888L_EN			(0x1u<<0)

#define	GFXMMU_LUT888L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT888L_EN_B_0X1		(0x1u<<0)

// LUT888H Configuration

#define	GFXMMU_LUT888H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT888H_LO_0			(0x1u<<0)

// LUT889L Configuration

#define	GFXMMU_LUT889L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT889L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT889L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT889L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT889L_EN			(0x1u<<0)

#define	GFXMMU_LUT889L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT889L_EN_B_0X1		(0x1u<<0)

// LUT889H Configuration

#define	GFXMMU_LUT889H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT889H_LO_0			(0x1u<<0)

// LUT890L Configuration

#define	GFXMMU_LUT890L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT890L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT890L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT890L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT890L_EN			(0x1u<<0)

#define	GFXMMU_LUT890L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT890L_EN_B_0X1		(0x1u<<0)

// LUT890H Configuration

#define	GFXMMU_LUT890H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT890H_LO_0			(0x1u<<0)

// LUT891L Configuration

#define	GFXMMU_LUT891L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT891L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT891L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT891L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT891L_EN			(0x1u<<0)

#define	GFXMMU_LUT891L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT891L_EN_B_0X1		(0x1u<<0)

// LUT891H Configuration

#define	GFXMMU_LUT891H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT891H_LO_0			(0x1u<<0)

// LUT892L Configuration

#define	GFXMMU_LUT892L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT892L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT892L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT892L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT892L_EN			(0x1u<<0)

#define	GFXMMU_LUT892L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT892L_EN_B_0X1		(0x1u<<0)

// LUT892H Configuration

#define	GFXMMU_LUT892H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT892H_LO_0			(0x1u<<0)

// LUT893L Configuration

#define	GFXMMU_LUT893L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT893L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT893L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT893L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT893L_EN			(0x1u<<0)

#define	GFXMMU_LUT893L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT893L_EN_B_0X1		(0x1u<<0)

// LUT893H Configuration

#define	GFXMMU_LUT893H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT893H_LO_0			(0x1u<<0)

// LUT894L Configuration

#define	GFXMMU_LUT894L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT894L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT894L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT894L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT894L_EN			(0x1u<<0)

#define	GFXMMU_LUT894L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT894L_EN_B_0X1		(0x1u<<0)

// LUT894H Configuration

#define	GFXMMU_LUT894H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT894H_LO_0			(0x1u<<0)

// LUT895L Configuration

#define	GFXMMU_LUT895L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT895L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT895L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT895L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT895L_EN			(0x1u<<0)

#define	GFXMMU_LUT895L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT895L_EN_B_0X1		(0x1u<<0)

// LUT895H Configuration

#define	GFXMMU_LUT895H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT895H_LO_0			(0x1u<<0)

// LUT896L Configuration

#define	GFXMMU_LUT896L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT896L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT896L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT896L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT896L_EN			(0x1u<<0)

#define	GFXMMU_LUT896L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT896L_EN_B_0X1		(0x1u<<0)

// LUT896H Configuration

#define	GFXMMU_LUT896H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT896H_LO_0			(0x1u<<0)

// LUT897L Configuration

#define	GFXMMU_LUT897L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT897L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT897L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT897L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT897L_EN			(0x1u<<0)

#define	GFXMMU_LUT897L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT897L_EN_B_0X1		(0x1u<<0)

// LUT897H Configuration

#define	GFXMMU_LUT897H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT897H_LO_0			(0x1u<<0)

// LUT898L Configuration

#define	GFXMMU_LUT898L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT898L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT898L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT898L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT898L_EN			(0x1u<<0)

#define	GFXMMU_LUT898L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT898L_EN_B_0X1		(0x1u<<0)

// LUT898H Configuration

#define	GFXMMU_LUT898H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT898H_LO_0			(0x1u<<0)

// LUT899L Configuration

#define	GFXMMU_LUT899L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT899L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT899L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT899L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT899L_EN			(0x1u<<0)

#define	GFXMMU_LUT899L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT899L_EN_B_0X1		(0x1u<<0)

// LUT899H Configuration

#define	GFXMMU_LUT899H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT899H_LO_0			(0x1u<<0)

// LUT900L Configuration

#define	GFXMMU_LUT900L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT900L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT900L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT900L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT900L_EN			(0x1u<<0)

#define	GFXMMU_LUT900L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT900L_EN_B_0X1		(0x1u<<0)

// LUT900H Configuration

#define	GFXMMU_LUT900H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT900H_LO_0			(0x1u<<0)

// LUT901L Configuration

