hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT901L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT901L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT901L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT901L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT901L_EN			(0x1u<<0)

#define	GFXMMU_LUT901L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT901L_EN_B_0X1		(0x1u<<0)

// LUT901H Configuration

#define	GFXMMU_LUT901H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT901H_LO_0			(0x1u<<0)

// LUT902L Configuration

#define	GFXMMU_LUT902L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT902L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT902L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT902L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT902L_EN			(0x1u<<0)

#define	GFXMMU_LUT902L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT902L_EN_B_0X1		(0x1u<<0)

// LUT902H Configuration

#define	GFXMMU_LUT902H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT902H_LO_0			(0x1u<<0)

// LUT903L Configuration

#define	GFXMMU_LUT903L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT903L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT903L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT903L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT903L_EN			(0x1u<<0)

#define	GFXMMU_LUT903L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT903L_EN_B_0X1		(0x1u<<0)

// LUT903H Configuration

#define	GFXMMU_LUT903H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT903H_LO_0			(0x1u<<0)

// LUT904L Configuration

#define	GFXMMU_LUT904L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT904L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT904L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT904L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT904L_EN			(0x1u<<0)

#define	GFXMMU_LUT904L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT904L_EN_B_0X1		(0x1u<<0)

// LUT904H Configuration

#define	GFXMMU_LUT904H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT904H_LO_0			(0x1u<<0)

// LUT905L Configuration

#define	GFXMMU_LUT905L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT905L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT905L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT905L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT905L_EN			(0x1u<<0)

#define	GFXMMU_LUT905L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT905L_EN_B_0X1		(0x1u<<0)

// LUT905H Configuration

#define	GFXMMU_LUT905H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT905H_LO_0			(0x1u<<0)

// LUT906L Configuration

#define	GFXMMU_LUT906L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT906L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT906L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT906L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT906L_EN			(0x1u<<0)

#define	GFXMMU_LUT906L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT906L_EN_B_0X1		(0x1u<<0)

// LUT906H Configuration

#define	GFXMMU_LUT906H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT906H_LO_0			(0x1u<<0)

// LUT907L Configuration

#define	GFXMMU_LUT907L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT907L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT907L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT907L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT907L_EN			(0x1u<<0)

#define	GFXMMU_LUT907L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT907L_EN_B_0X1		(0x1u<<0)

// LUT907H Configuration

#define	GFXMMU_LUT907H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT907H_LO_0			(0x1u<<0)

// LUT908L Configuration

#define	GFXMMU_LUT908L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT908L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT908L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT908L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT908L_EN			(0x1u<<0)

#define	GFXMMU_LUT908L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT908L_EN_B_0X1		(0x1u<<0)

// LUT908H Configuration

#define	GFXMMU_LUT908H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT908H_LO_0			(0x1u<<0)

// LUT909L Configuration

#define	GFXMMU_LUT909L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT909L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT909L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT909L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT909L_EN			(0x1u<<0)

#define	GFXMMU_LUT909L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT909L_EN_B_0X1		(0x1u<<0)

// LUT909H Configuration

#define	GFXMMU_LUT909H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT909H_LO_0			(0x1u<<0)

// LUT910L Configuration

#define	GFXMMU_LUT910L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT910L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT910L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT910L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT910L_EN			(0x1u<<0)

#define	GFXMMU_LUT910L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT910L_EN_B_0X1		(0x1u<<0)

// LUT910H Configuration

#define	GFXMMU_LUT910H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT910H_LO_0			(0x1u<<0)

// LUT911L Configuration

#define	GFXMMU_LUT911L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT911L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT911L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT911L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT911L_EN			(0x1u<<0)

#define	GFXMMU_LUT911L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT911L_EN_B_0X1		(0x1u<<0)

// LUT911H Configuration

#define	GFXMMU_LUT911H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT911H_LO_0			(0x1u<<0)

// LUT912L Configuration

#define	GFXMMU_LUT912L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT912L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT912L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT912L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT912L_EN			(0x1u<<0)

#define	GFXMMU_LUT912L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT912L_EN_B_0X1		(0x1u<<0)

// LUT912H Configuration

#define	GFXMMU_LUT912H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT912H_LO_0			(0x1u<<0)

// LUT913L Configuration

#define	GFXMMU_LUT913L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT913L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT913L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT913L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT913L_EN			(0x1u<<0)

#define	GFXMMU_LUT913L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT913L_EN_B_0X1		(0x1u<<0)

// LUT913H Configuration

#define	GFXMMU_LUT913H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT913H_LO_0			(0x1u<<0)

// LUT914L Configuration

#define	GFXMMU_LUT914L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT914L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT914L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT914L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT914L_EN			(0x1u<<0)

#define	GFXMMU_LUT914L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT914L_EN_B_0X1		(0x1u<<0)

// LUT914H Configuration

#define	GFXMMU_LUT914H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT914H_LO_0			(0x1u<<0)

// LUT915L Configuration

#define	GFXMMU_LUT915L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT915L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT915L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT915L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT915L_EN			(0x1u<<0)

