hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT960L Configuration

#define	GFXMMU_LUT960L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT960L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT960L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT960L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT960L_EN			(0x1u<<0)

#define	GFXMMU_LUT960L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT960L_EN_B_0X1		(0x1u<<0)

// LUT960H Configuration

#define	GFXMMU_LUT960H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT960H_LO_0			(0x1u<<0)

// LUT961L Configuration

#define	GFXMMU_LUT961L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT961L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT961L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT961L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT961L_EN			(0x1u<<0)

#define	GFXMMU_LUT961L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT961L_EN_B_0X1		(0x1u<<0)

// LUT961H Configuration

#define	GFXMMU_LUT961H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT961H_LO_0			(0x1u<<0)

// LUT962L Configuration

#define	GFXMMU_LUT962L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT962L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT962L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT962L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT962L_EN			(0x1u<<0)

#define	GFXMMU_LUT962L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT962L_EN_B_0X1		(0x1u<<0)

// LUT962H Configuration

#define	GFXMMU_LUT962H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT962H_LO_0			(0x1u<<0)

// LUT963L Configuration

#define	GFXMMU_LUT963L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT963L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT963L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT963L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT963L_EN			(0x1u<<0)

#define	GFXMMU_LUT963L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT963L_EN_B_0X1		(0x1u<<0)

// LUT963H Configuration

#define	GFXMMU_LUT963H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT963H_LO_0			(0x1u<<0)

// LUT964L Configuration

#define	GFXMMU_LUT964L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT964L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT964L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT964L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT964L_EN			(0x1u<<0)

#define	GFXMMU_LUT964L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT964L_EN_B_0X1		(0x1u<<0)

// LUT964H Configuration

#define	GFXMMU_LUT964H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT964H_LO_0			(0x1u<<0)

// LUT965L Configuration

#define	GFXMMU_LUT965L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT965L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT965L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT965L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT965L_EN			(0x1u<<0)

#define	GFXMMU_LUT965L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT965L_EN_B_0X1		(0x1u<<0)

// LUT965H Configuration

#define	GFXMMU_LUT965H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT965H_LO_0			(0x1u<<0)

// LUT966L Configuration

#define	GFXMMU_LUT966L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT966L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT966L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT966L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT966L_EN			(0x1u<<0)

#define	GFXMMU_LUT966L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT966L_EN_B_0X1		(0x1u<<0)

// LUT966H Configuration

#define	GFXMMU_LUT966H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT966H_LO_0			(0x1u<<0)

// LUT967L Configuration

#define	GFXMMU_LUT967L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT967L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT967L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT967L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT967L_EN			(0x1u<<0)

#define	GFXMMU_LUT967L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT967L_EN_B_0X1		(0x1u<<0)

// LUT967H Configuration

#define	GFXMMU_LUT967H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT967H_LO_0			(0x1u<<0)

// LUT968L Configuration

#define	GFXMMU_LUT968L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT968L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT968L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT968L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT968L_EN			(0x1u<<0)

#define	GFXMMU_LUT968L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT968L_EN_B_0X1		(0x1u<<0)

// LUT968H Configuration

#define	GFXMMU_LUT968H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT968H_LO_0			(0x1u<<0)

// LUT969L Configuration

#define	GFXMMU_LUT969L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT969L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT969L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT969L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT969L_EN			(0x1u<<0)

#define	GFXMMU_LUT969L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT969L_EN_B_0X1		(0x1u<<0)

// LUT969H Configuration

#define	GFXMMU_LUT969H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT969H_LO_0			(0x1u<<0)

// LUT970L Configuration

#define	GFXMMU_LUT970L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT970L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT970L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT970L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT970L_EN			(0x1u<<0)

#define	GFXMMU_LUT970L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT970L_EN_B_0X1		(0x1u<<0)

// LUT970H Configuration

#define	GFXMMU_LUT970H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT970H_LO_0			(0x1u<<0)

// LUT971L Configuration

#define	GFXMMU_LUT971L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT971L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT971L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT971L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT971L_EN			(0x1u<<0)

#define	GFXMMU_LUT971L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT971L_EN_B_0X1		(0x1u<<0)

// LUT971H Configuration

#define	GFXMMU_LUT971H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT971H_LO_0			(0x1u<<0)

// LUT972L Configuration

#define	GFXMMU_LUT972L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT972L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT972L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT972L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT972L_EN			(0x1u<<0)

#define	GFXMMU_LUT972L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT972L_EN_B_0X1		(0x1u<<0)

// LUT972H Configuration

#define	GFXMMU_LUT972H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT972H_LO_0			(0x1u<<0)

// LUT973L Configuration

#define	GFXMMU_LUT973L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT973L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT973L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT973L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT973L_EN			(0x1u<<0)

#define	GFXMMU_LUT973L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT973L_EN_B_0X1		(0x1u<<0)

// LUT973H Configuration

#define	GFXMMU_LUT973H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT973H_LO_0			(0x1u<<0)

// LUT974L Configuration

#define	GFXMMU_LUT974L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT974L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT974L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT974L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT974L_EN			(0x1u<<0)

#define	GFXMMU_LUT974L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT974L_EN_B_0X1		(0x1u<<0)

// LUT974H Configuration

