hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
#define	GFXMMU_LUT974H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT974H_LO_0			(0x1u<<0)

// LUT975L Configuration

#define	GFXMMU_LUT975L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT975L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT975L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT975L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT975L_EN			(0x1u<<0)

#define	GFXMMU_LUT975L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT975L_EN_B_0X1		(0x1u<<0)

// LUT975H Configuration

#define	GFXMMU_LUT975H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT975H_LO_0			(0x1u<<0)

// LUT976L Configuration

#define	GFXMMU_LUT976L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT976L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT976L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT976L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT976L_EN			(0x1u<<0)

#define	GFXMMU_LUT976L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT976L_EN_B_0X1		(0x1u<<0)

// LUT976H Configuration

#define	GFXMMU_LUT976H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT976H_LO_0			(0x1u<<0)

// LUT977L Configuration

#define	GFXMMU_LUT977L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT977L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT977L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT977L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT977L_EN			(0x1u<<0)

#define	GFXMMU_LUT977L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT977L_EN_B_0X1		(0x1u<<0)

// LUT977H Configuration

#define	GFXMMU_LUT977H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT977H_LO_0			(0x1u<<0)

// LUT978L Configuration

#define	GFXMMU_LUT978L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT978L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT978L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT978L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT978L_EN			(0x1u<<0)

#define	GFXMMU_LUT978L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT978L_EN_B_0X1		(0x1u<<0)

// LUT978H Configuration

#define	GFXMMU_LUT978H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT978H_LO_0			(0x1u<<0)

// LUT979L Configuration

#define	GFXMMU_LUT979L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT979L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT979L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT979L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT979L_EN			(0x1u<<0)

#define	GFXMMU_LUT979L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT979L_EN_B_0X1		(0x1u<<0)

// LUT979H Configuration

#define	GFXMMU_LUT979H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT979H_LO_0			(0x1u<<0)

// LUT980L Configuration

#define	GFXMMU_LUT980L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT980L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT980L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT980L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT980L_EN			(0x1u<<0)

#define	GFXMMU_LUT980L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT980L_EN_B_0X1		(0x1u<<0)

// LUT980H Configuration

#define	GFXMMU_LUT980H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT980H_LO_0			(0x1u<<0)

// LUT981L Configuration

#define	GFXMMU_LUT981L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT981L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT981L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT981L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT981L_EN			(0x1u<<0)

#define	GFXMMU_LUT981L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT981L_EN_B_0X1		(0x1u<<0)

// LUT981H Configuration

#define	GFXMMU_LUT981H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT981H_LO_0			(0x1u<<0)

// LUT982L Configuration

#define	GFXMMU_LUT982L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT982L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT982L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT982L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT982L_EN			(0x1u<<0)

#define	GFXMMU_LUT982L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT982L_EN_B_0X1		(0x1u<<0)

// LUT982H Configuration

#define	GFXMMU_LUT982H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT982H_LO_0			(0x1u<<0)

// LUT983L Configuration

#define	GFXMMU_LUT983L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT983L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT983L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT983L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT983L_EN			(0x1u<<0)

#define	GFXMMU_LUT983L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT983L_EN_B_0X1		(0x1u<<0)

// LUT983H Configuration

#define	GFXMMU_LUT983H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT983H_LO_0			(0x1u<<0)

// LUT984L Configuration

#define	GFXMMU_LUT984L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT984L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT984L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT984L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT984L_EN			(0x1u<<0)

#define	GFXMMU_LUT984L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT984L_EN_B_0X1		(0x1u<<0)

// LUT984H Configuration

#define	GFXMMU_LUT984H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT984H_LO_0			(0x1u<<0)

// LUT985L Configuration

#define	GFXMMU_LUT985L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT985L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT985L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT985L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT985L_EN			(0x1u<<0)

#define	GFXMMU_LUT985L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT985L_EN_B_0X1		(0x1u<<0)

// LUT985H Configuration

#define	GFXMMU_LUT985H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT985H_LO_0			(0x1u<<0)

// LUT986L Configuration

#define	GFXMMU_LUT986L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT986L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT986L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT986L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT986L_EN			(0x1u<<0)

#define	GFXMMU_LUT986L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT986L_EN_B_0X1		(0x1u<<0)

// LUT986H Configuration

#define	GFXMMU_LUT986H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT986H_LO_0			(0x1u<<0)

// LUT987L Configuration

#define	GFXMMU_LUT987L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT987L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT987L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT987L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT987L_EN			(0x1u<<0)

#define	GFXMMU_LUT987L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT987L_EN_B_0X1		(0x1u<<0)

// LUT987H Configuration

#define	GFXMMU_LUT987H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT987H_LO_0			(0x1u<<0)

// LUT988L Configuration

#define	GFXMMU_LUT988L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT988L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT988L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT988L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT988L_EN			(0x1u<<0)

#define	GFXMMU_LUT988L_EN_B_0X0		(0x0u<<0)
#define	GFXMMU_LUT988L_EN_B_0X1		(0x1u<<0)

// LUT988H Configuration

#define	GFXMMU_LUT988H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT988H_LO_0			(0x1u<<0)

