hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gfxmmu.h
// LUT1003H Configuration

#define	GFXMMU_LUT1003H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1003H_LO_0		(0x1u<<0)

// LUT1004L Configuration

#define	GFXMMU_LUT1004L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1004L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1004L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1004L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1004L_EN			(0x1u<<0)

#define	GFXMMU_LUT1004L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1004L_EN_B_0X1	(0x1u<<0)

// LUT1004H Configuration

#define	GFXMMU_LUT1004H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1004H_LO_0		(0x1u<<0)

// LUT1005L Configuration

#define	GFXMMU_LUT1005L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1005L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1005L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1005L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1005L_EN			(0x1u<<0)

#define	GFXMMU_LUT1005L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1005L_EN_B_0X1	(0x1u<<0)

// LUT1005H Configuration

#define	GFXMMU_LUT1005H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1005H_LO_0		(0x1u<<0)

// LUT1006L Configuration

#define	GFXMMU_LUT1006L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1006L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1006L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1006L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1006L_EN			(0x1u<<0)

#define	GFXMMU_LUT1006L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1006L_EN_B_0X1	(0x1u<<0)

// LUT1006H Configuration

#define	GFXMMU_LUT1006H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1006H_LO_0		(0x1u<<0)

// LUT1007L Configuration

#define	GFXMMU_LUT1007L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1007L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1007L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1007L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1007L_EN			(0x1u<<0)

#define	GFXMMU_LUT1007L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1007L_EN_B_0X1	(0x1u<<0)

// LUT1007H Configuration

#define	GFXMMU_LUT1007H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1007H_LO_0		(0x1u<<0)

// LUT1008L Configuration

#define	GFXMMU_LUT1008L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1008L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1008L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1008L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1008L_EN			(0x1u<<0)

#define	GFXMMU_LUT1008L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1008L_EN_B_0X1	(0x1u<<0)

// LUT1008H Configuration

#define	GFXMMU_LUT1008H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1008H_LO_0		(0x1u<<0)

// LUT1009L Configuration

#define	GFXMMU_LUT1009L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1009L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1009L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1009L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1009L_EN			(0x1u<<0)

#define	GFXMMU_LUT1009L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1009L_EN_B_0X1	(0x1u<<0)

// LUT1009H Configuration

#define	GFXMMU_LUT1009H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1009H_LO_0		(0x1u<<0)

// LUT1010L Configuration

#define	GFXMMU_LUT1010L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1010L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1010L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1010L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1010L_EN			(0x1u<<0)

#define	GFXMMU_LUT1010L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1010L_EN_B_0X1	(0x1u<<0)

// LUT1010H Configuration

#define	GFXMMU_LUT1010H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1010H_LO_0		(0x1u<<0)

// LUT1011L Configuration

#define	GFXMMU_LUT1011L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1011L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1011L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1011L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1011L_EN			(0x1u<<0)

#define	GFXMMU_LUT1011L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1011L_EN_B_0X1	(0x1u<<0)

// LUT1011H Configuration

#define	GFXMMU_LUT1011H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1011H_LO_0		(0x1u<<0)

// LUT1012L Configuration

#define	GFXMMU_LUT1012L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1012L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1012L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1012L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1012L_EN			(0x1u<<0)

#define	GFXMMU_LUT1012L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1012L_EN_B_0X1	(0x1u<<0)

// LUT1012H Configuration

#define	GFXMMU_LUT1012H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1012H_LO_0		(0x1u<<0)

// LUT1013L Configuration

#define	GFXMMU_LUT1013L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1013L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1013L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1013L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1013L_EN			(0x1u<<0)

#define	GFXMMU_LUT1013L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1013L_EN_B_0X1	(0x1u<<0)

// LUT1013H Configuration

#define	GFXMMU_LUT1013H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1013H_LO_0		(0x1u<<0)

// LUT1014L Configuration

#define	GFXMMU_LUT1014L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1014L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1014L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1014L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1014L_EN			(0x1u<<0)

#define	GFXMMU_LUT1014L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1014L_EN_B_0X1	(0x1u<<0)

// LUT1014H Configuration

#define	GFXMMU_LUT1014H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1014H_LO_0		(0x1u<<0)

// LUT1015L Configuration

#define	GFXMMU_LUT1015L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1015L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1015L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1015L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1015L_EN			(0x1u<<0)

#define	GFXMMU_LUT1015L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1015L_EN_B_0X1	(0x1u<<0)

// LUT1015H Configuration

#define	GFXMMU_LUT1015H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1015H_LO_0		(0x1u<<0)

// LUT1016L Configuration

#define	GFXMMU_LUT1016L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1016L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1016L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1016L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1016L_EN			(0x1u<<0)

#define	GFXMMU_LUT1016L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1016L_EN_B_0X1	(0x1u<<0)

// LUT1016H Configuration

#define	GFXMMU_LUT1016H_LO			(0x3FFFFu<<0)
#define	GFXMMU_LUT1016H_LO_0		(0x1u<<0)

// LUT1017L Configuration

#define	GFXMMU_LUT1017L_LVB			(0xFFu<<16)
#define	GFXMMU_LUT1017L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1017L_FVB			(0xFFu<<8)
#define	GFXMMU_LUT1017L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1017L_EN			(0x1u<<0)

#define	GFXMMU_LUT1017L_EN_B_0X0	(0x0u<<0)
#define	GFXMMU_LUT1017L_EN_B_0X1	(0x1u<<0)

